#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2E78 (0x3318 - 0x4A0)
// AnimBlueprintGeneratedClass Biplane_AnimBP_Base.Biplane_AnimBP_Base_C
class UBiplane_AnimBP_Base_C : public UFortFerretVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4A0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_A64784764ADC9A502A9787AFD88B4907; // 0x4A8(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_BDBBCBF9483B76BBF9C937BA5B6C29D5; // 0x5B0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_F0986EA143C674B3EE5E02944C54453C; // 0x6B8(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_853551E24293DAE2B10189B7BEEF464C; // 0x7C0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6DD801454AE29899A9FCD5B6FF2F9437; // 0x8C8(0x108)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_35A2D2F643292920AD9C2E839377EA23; // 0x9D0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_DC188DFC42B264935F40299C5A05169D; // 0xB80(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_FF71ECA0450E871EE748068DC265AD22; // 0xD30(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_DCE5C6144A394DB45B1128A84B2642FE; // 0xEE0(0x1B0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_0B73DED14D871A2AF7EFDF93EDBABEFD; // 0x1090(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_D3F5900A4CB6AA04961791BE6B92910E; // 0x1198(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_DEE4FFE6414A29670B098BABB7447E83; // 0x12A0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_BFC8A18B41A60D6810432AB4F47F34F0; // 0x13A8(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6E17BE5F4DEE18285FAF9DB6B0E404F9; // 0x14B0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7EFECE2C471D0C829A0D288012E2E2A0; // 0x15B8(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_685449DA44E01C6517CC70B7CBE02959; // 0x16C0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5D637BC941956856FBD0298829486F4D; // 0x17C8(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3A257325491B43197BEFCB9BDFC866C0; // 0x18D0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13E2ADB34EF5A2E6263F66B2ED6A64B7; // 0x19D8(0x108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_750AB1064E4745E4189DDCBF3D3D5EF9; // 0x1AE0(0x20)()
	struct FAnimNode_Root                        AnimGraphNode_Root_5CD289A14AB8CD0E0F3991AD2C316C2E; // 0x1B00(0x20)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_7B643BE24F40F570685A5D8FFC2DDEC5; // 0x1B20(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_126CAFA34722A8329F3D0DBF5E0E655D; // 0x1CD0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_3CF4117D49CA473753B04FA8BEBC2DF7; // 0x1E80(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_18733F7D410104B9B63B598DC46DE57B; // 0x2030(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_9B6C46F14F4C576FED3CF2A9591C593A; // 0x21E0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_1E5B35BA452CDF9325C8D0B2704BCB81; // 0x2390(0x1B0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_40185C5440420806535A78A843811084; // 0x2540(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_528A7E2C41196C51CD54A49219861CBD; // 0x2648(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8AC429324FEEE3112460D194D8BE64B8; // 0x2750(0x108)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9B2A103C4BB583B3A6B95BB34C7FCBE5; // 0x2858(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_954DF3594AD9FF8C01CAA1B0B1F798D6; // 0x2880(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4C5C506C41DD557BB92C318A7A406EFA; // 0x28A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F6DE82AB4947D10AC9D210B1409FD711; // 0x28D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F18C1D1645DD78B42618E3BD0CC91504; // 0x28F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F6AFB6D846863BD93F986BB2BA8B9C7A; // 0x2920(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8A9DF5814B78FA3E3E42F4BAE68FF699; // 0x2948(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C3D6B905421658875500FCB4F0D74FDF; // 0x29C0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8BB1DB074ADBB3E5D1821881E74E562D; // 0x29E0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_53E1745849D694075C170ABB28D69374; // 0x2A58(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3003BDA94824EC4197B95B80CC15AA62; // 0x2A78(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4384071D46C0B7CB5B23B7A401857EDD; // 0x2AF0(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_023EFCCF40996F7BD1C2F38037B5D986; // 0x2B10(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7A28A23C499EF7712A960593274D6A5E; // 0x2BF0(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_C9B1FF1740F5298F528473A33D2EEFA6; // 0x2C10(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FF8407764A76EB8096E8D99A3A383626; // 0x2CF0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_62844E334EE5DD66EBA4258F338029DA; // 0x2D10(0xB0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C8FA9F5C4E4457FAC0E8A590D0FF6895; // 0x2DC0(0x20)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_86A421AE41BDAABD7263469B47F218DC; // 0x2DE0(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2C70309747E78DF1E962A5B290BD6EAC; // 0x2EA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4FF9C0BD4329A40414751E856C1BB5E7; // 0x2ED0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96EC170F4B228634C93E2E806EA77BC8; // 0x2EF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8BC58A104FAD03D8F02007AED7032F7F; // 0x2F20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6EEE570C465FFE3817D674860B9A0BA1; // 0x2F48(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CC4782A2402234350EDF56B8DEE753DB; // 0x2F70(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_CECD382F47BD128C000AAB8FE3B9019D; // 0x2FE8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A980AE6545D1E6220A9403898C891F47; // 0x3008(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E0ADDA814D9B0EC030ECA0AD781A1247; // 0x3080(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F4EA455A42013ED7AEA714B26A9D9509; // 0x30A0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_97FAEFC34706A0A6F34E428FB342664A; // 0x3118(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9D8C7FC844A92483AF66E39D783164BE; // 0x3138(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_81095E7E4425180BCCC922807A1889FD; // 0x31B0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CB4F9DAD4BF4352168E06D9E3323CAD5; // 0x31D0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8538801D4BE754F36880EBA8E55CB2F8; // 0x3248(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3F99370543926E9E2F1D06826FDDBCBA; // 0x3268(0xB0)()

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Biplane_AnimBP_Base_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_Biplane_AnimBP_Base_AnimGraphNode_BlendSpacePlayer_023EFCCF40996F7BD1C2F38037B5D986();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Biplane_AnimBP_Base_AnimGraphNode_ModifyBone_3A257325491B43197BEFCB9BDFC866C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Biplane_AnimBP_Base_AnimGraphNode_ModifyBone_D3F5900A4CB6AA04961791BE6B92910E();
	void ExecuteUbergraph_Biplane_AnimBP_Base(int32 EntryPoint, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_NegateVector_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_NegateRotator_ReturnValue);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
