#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1BB8 (0x77B8 - 0x5C00)
// AnimBlueprintGeneratedClass FerretVehicle_Driver_AnimBP.FerretVehicle_Driver_AnimBP_C
class UFerretVehicle_Driver_AnimBP_C : public UFortPlayerAnimInstance_FerretDriver
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x5C00(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_86E019B5417399C6B98DEEA138F6763C; // 0x5C08(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E3AEC5AF45CE09AEC07D75AE68E57058; // 0x5C28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2CDDFE324446D38601DDC480503A4ECF; // 0x5C50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82C47A57427D55B01405E693015E4FCE; // 0x5C78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_030E2D4C4EC6F0BFDE9294A2D1BE05E1; // 0x5CA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_720B995943A2A44D9F5A0AA06135DEAE; // 0x5CC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A6A0BD2A48FB499BE2CFF7B6D2CF1B35; // 0x5CF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17D94225452927F6C669A2A75151B3A4; // 0x5D18(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_369E1476444FFBF88F4836AE643AA152; // 0x5D40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_132B7C614907679D49C349912CA5E6DA; // 0x5D68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BB05E1DB487F856A5CB7FE89F0933AF9; // 0x5D90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E134B39B462EACCE3BE6B6A6089B661D; // 0x5DB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_546CAA9C466A052F165EE889E14D2B0D; // 0x5DE0(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2882770448D00044B68669AC9504C80F; // 0x5E08(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_BA91DF144EE8CD92D10E479976ECE42D; // 0x5E30(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6ED4B8D744DB677B7A443F84DA190B75; // 0x5E50(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F97480C5488B05F23048F5AAA4D460BF; // 0x5E78(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19EA6CC745DD5A1AFE38628DAF6624CE; // 0x5E98(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_270186B84FC9DAAA5E3D4AAA9D3F01D0; // 0x5F10(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_95C01E9C474F65F285BE668947E2267A; // 0x5F30(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_BF067950493C9F208903EA951CFC7D0B; // 0x5FA8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2F6434504A1D66C784242C965386A75B; // 0x5FC8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39AFC76B483EABD8F7ABC5A081E09CC4; // 0x6040(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2695D469458915D9CBBC75A0EA182699; // 0x6060(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24B126A54B60C6C402F175934FA964D8; // 0x60D8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_97F423E0404954D8B95268997056ED8F; // 0x60F8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_0523EE75421982F569709EB2D4067ECE; // 0x6170(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_609985344D1CCFBA3BEFA2896F65910F; // 0x6190(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9A9949A841896BD67D69858E3A57E12F; // 0x6270(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A516451A490F8930F83E7194E45C37B8; // 0x6290(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8EE7C87A47CA0AAB7272DC9D8E1A5CBD; // 0x62B8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_0FC0F7D14599BB4D26B13BA6B9028322; // 0x62D8(0xB0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_31A68ECE486408308AAC5BA481A59BAF; // 0x6388(0x188)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_CBD55E9A452F43DF361952800637AC3E; // 0x6510(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E817796447A309134CC743B77AA8527F; // 0x65D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1A3B08D94CEB69A72058699375984BD7; // 0x6600(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40C5D9D140ED70627A718F9079159732; // 0x6628(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6FBEA78F41AD3BD2E0AF0DBDDB2245DF; // 0x6650(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FC030264429B308784ECEABA72EC5704; // 0x6678(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_434DC2F24C8F2C10DC6A7BB20EDFB453; // 0x66F0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1339661E485FBD71434C7FB469A7F1D8; // 0x6710(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_A132C467450CCDB6C4BE13B70CBD7ACF; // 0x6788(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_368F7AA446B5ECC2FECC06AF0B7B512D; // 0x67A8(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_BC5DDF9548D05B983B963FA730E49DC7; // 0x6820(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2DB24B7C4352C296A982698BC4D91178; // 0x68C0(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_68B7F548469D02996DBC16B012255D02; // 0x6938(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BA12F0A54465EC3813987BAB27005B78; // 0x69D8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E7B0ADDE42003546F937CA876DA1D79A; // 0x6A50(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_D966F8F04E48F58A5EDA7ABD527E4ED0; // 0x6A70(0xB0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_60B7FFB549CB35325591118CB52A04A1; // 0x6B20(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6BFA0B594043ED6AC3521AB7294391E1; // 0x6B68(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_87E9AA8F4D8BC5F76705429A0A8DEDAC; // 0x6C30(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_671F85FD419449427FDA4C82E7D29DA5; // 0x6CE0(0x78)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_B6A682B54F3DFF61A2A7D88EA1C7DADD; // 0x6D58(0x18)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_BB414B9745FA480D18DFA0A18AE47F8B; // 0x6D70(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D991A3054A0E46F8CA1D0DA4B83D1671; // 0x6E38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E7ACB6A94A9B3436022AE4BA1572518B; // 0x6E60(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2F2003C64A31E088EC839C84D66DEFE7; // 0x6E88(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DBCD4DB444153C4E494294A754F8650C; // 0x6EB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C3CB00024A9941D2C6FD6791FB82B1F2; // 0x6ED8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_91457DC145E5DA0721D139968390FD44; // 0x6F00(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_029A6DD741DD0771B2A040894EDD84F7; // 0x6F78(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B99D61F54A29596B5AC36AB09F9118E5; // 0x6F98(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8D52092243A1CBFF953419973E10EB8E; // 0x7010(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0DBCA143486D38E2E6BEE9A44BF41442; // 0x7030(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_584FE815490877354A0D4AB9F3D746A0; // 0x70A8(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_93B0D40E4C2DD1BA7B4288B8E98933D0; // 0x70C8(0x18)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FE35B727416B2615B22862A2CE193F1C; // 0x70E0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F6367532453DDCE55D25CC86EDDED804; // 0x7100(0xB0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_42C32626464890E12458619FDCB765EA; // 0x71B0(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4F40EC184B847F59B890B4A8E85B1DFD; // 0x72B8(0x108)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_95BB4E814C6415B27C3EB7B9F8DF9770; // 0x73C0(0xF8)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_859EE5114B5D3EC835327D9B43A75F9A; // 0x74B8(0xF8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_87E73F534051F498EF3BC59D6DAEA03E; // 0x75B0(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6200EB3E42FE46A4403E97BAAB931D33; // 0x75D0(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_C57DEA9E4C233E4D60A0F1A26381BC21; // 0x75F0(0xE0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_B35E9318416FBAA2C93DC193BD494562; // 0x76D0(0xB8)()
	struct FRotator                              HandLocalRotationOffsetLeft;                       // 0x7788(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              HandLocalRotationOffsetRight;                      // 0x7794(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                               HandLocalTranslateOffsetRight;                     // 0x77A0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               HandLocalTranslateOffsetLeft;                      // 0x77AC(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FerretVehicle_Driver_AnimBP_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_FerretVehicle_Driver_AnimBP_AnimGraphNode_BlendSpacePlayer_609985344D1CCFBA3BEFA2896F65910F();
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_FerretVehicle_Driver_AnimBP(int32 EntryPoint, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
