#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.SetEnabled
struct AAIHotSpot_SetEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.RemoveGroupFromHotspot
struct AAIHotSpot_RemoveGroupFromHotspot_Params
{
public:
	TArray<class AAIController*>                 GroupOfAI;                                         // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1151[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.RemoveFromHotspot
struct AAIHotSpot_RemoveFromHotspot_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAssignFromWaitingList;                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1152[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotOccupied
struct AAIHotSpot_OnSlotOccupied_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotFreed
struct AAIHotSpot_OnSlotFreed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotEnabled
struct AAIHotSpot_OnSlotEnabled_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotDisabled
struct AAIHotSpot_OnSlotDisabled_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotClaimed
struct AAIHotSpot_OnSlotClaimed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotBlocked
struct AAIHotSpot_OnSlotBlocked_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnRemovedSlotlessBehavior
struct AAIHotSpot_OnRemovedSlotlessBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClamingSlot;                                    // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1153[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnRemovedBehavior
struct AAIHotSpot_OnRemovedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    PrevState;                                         // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasOnWaitingList;                                 // 0x11(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1154[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnMoveToSlotFinished
struct AAIHotSpot_OnMoveToSlotFinished_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResult;                                           // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1155[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.OnHotSpotEnabled
struct AAIHotSpot_OnHotSpotEnabled_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.OnHotSpotDisabled
struct AAIHotSpot_OnHotSpotDisabled_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedSlotlessBehavior
struct AAIHotSpot_OnAssignedSlotlessBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1156[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedOccupiedBehavior
struct AAIHotSpot_OnAssignedOccupiedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1157[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedClaimedBehavior
struct AAIHotSpot_OnAssignedClaimedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasOnWaitingList;                                 // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x11(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1158[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OccupySlotByIndex
struct AAIHotSpot_OccupySlotByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1159[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.IsSlotlessAssignmentAllowed
struct AAIHotSpot_IsSlotlessAssignmentAllowed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.IsEnabled
struct AAIHotSpot_IsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.IsAIAllowed
struct AAIHotSpot_IsAIAllowed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.HasEnabledSlots
struct AAIHotSpot_HasEnabledSlots_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.HasAssignedAI
struct AAIHotSpot_HasAssignedAI_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115B[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotUserIdByIndex
struct AAIHotSpot_GetSlotUserIdByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotStateByOwner
struct AAIHotSpot_GetSlotStateByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotStateByIndex
struct AAIHotSpot_GetSlotStateByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotRotationByIndex
struct AAIHotSpot_GetSlotRotationByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotOwnerByIndex
struct AAIHotSpot_GetSlotOwnerByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotLocationByIndex
struct AAIHotSpot_GetSlotLocationByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotIndexByOwner
struct AAIHotSpot_GetSlotIndexByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotCount
struct AAIHotSpot_GetSlotCount_Params
{
public:
	enum class EAIHotSpotSlotFilter              Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1160[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotByOwner
struct AAIHotSpot_GetSlotByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotByIndex
struct AAIHotSpot_GetSlotByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1161[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetAssignedAICount
struct AAIHotSpot_GetAssignedAICount_Params
{
public:
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1162[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.GetAssignedAI
struct AAIHotSpot_GetAssignedAI_Params
{
public:
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1163[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AAIController*>                 ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AIHotSpot.FindBestSlotIndices
struct AAIHotSpot_FindBestSlotIndices_Params
{
public:
	TArray<class AAIController*>                 AI;                                                // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.FindBestSlotIndex
struct AAIHotSpot_FindBestSlotIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1164[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.CanUseSlotByIndex
struct AAIHotSpot_CanUseSlotByIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1165[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.AssignToSlotByIndex
struct AAIHotSpot_AssignToSlotByIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1166[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.AssignToHotspot
struct AAIHotSpot_AssignToHotspot_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1167[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.AssignGroupToHotspot
struct AAIHotSpot_AssignGroupToHotspot_Params
{
public:
	TArray<class AAIController*>                 GroupOfAI;                                         // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1168[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.AssignFromWaitingList
struct AAIHotSpot_AssignFromWaitingList_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotState
struct UAIHotSpotSlot_SetSlotState_Params
{
public:
	enum class EAIHotSpotSlot                    NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotOwnerAndState
struct UAIHotSpotSlot_SetSlotOwnerAndState_Params
{
public:
	class AAIController*                         NewOwner;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    NewState;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotEnabled
struct UAIHotSpotSlot_SetSlotEnabled_Params
{
public:
	bool                                         bNewEnabled;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.OnStateChanged
struct UAIHotSpotSlot_OnStateChanged_Params
{
public:
	class AAIController*                         SlotOwner;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    NewState;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1170[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.IsEnabled
struct UAIHotSpotSlot_IsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.IsAIAllowed
struct UAIHotSpotSlot_IsAIAllowed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1171[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.HasUserId
struct UAIHotSpotSlot_HasUserId_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotUserId
struct UAIHotSpotSlot_GetSlotUserId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotState
struct UAIHotSpotSlot_GetSlotState_Params
{
public:
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotRotation
struct UAIHotSpotSlot_GetSlotRotation_Params
{
public:
	struct FRotator                              ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotRadius
struct UAIHotSpotSlot_GetSlotRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotOwner
struct UAIHotSpotSlot_GetSlotOwner_Params
{
public:
	class AAIController*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotLocation
struct UAIHotSpotSlot_GetSlotLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotIndex
struct UAIHotSpotSlot_GetSlotIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotHeight
struct UAIHotSpotSlot_GetSlotHeight_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotBounds
struct UAIHotSpotSlot_GetSlotBounds_Params
{
public:
	struct FBox                                  ReturnValue;                                       // 0x0(0x1C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetHotSpot
struct UAIHotSpotSlot_GetHotSpot_Params
{
public:
	class AAIHotSpot*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpotSlot.ClearSlot
struct UAIHotSpotSlot_ClearSlot_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.GetHotSpot
struct UAIHotSpotSlotGenerator_GetHotSpot_Params
{
public:
	class AAIHotSpot*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.GenerateSlots
struct UAIHotSpotSlotGenerator_GenerateSlots_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.AddSlot
struct UAIHotSpotSlotGenerator_AddSlot_Params
{
public:
	struct FVector                               RelativeLocation;                                  // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RelativeRotation;                                  // 0xC(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAIHotSpotSlot>            CustomSlotClass;                                   // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnabled;                                          // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1175[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AsyncAction_WaitForScriptedActions.WaitForScriptedAction
struct UAsyncAction_WaitForScriptedActions_WaitForScriptedAction_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortClientEventName                  EventType;                                         // 0x8(0x10)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UAsyncAction_WaitForScriptedActions*   ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AsyncAction_WaitForScriptedActions.WaitForMultipleScriptedActions
struct UAsyncAction_WaitForScriptedActions_WaitForMultipleScriptedActions_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortClientEventName>          EventTypes;                                        // 0x8(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncAction_WaitForScriptedActions*   ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AsyncAction_WaitForScriptedActions.WaitForAllScriptedActions
struct UAsyncAction_WaitForScriptedActions_WaitForAllScriptedActions_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_WaitForScriptedActions*   ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteGame.AsyncAction_WaitForScriptedActions.OnFinishedDelegate__DelegateSignature
struct UAsyncAction_WaitForScriptedActions_OnFinishedDelegate__DelegateSignature_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function FortniteGame.AsyncOverlapQueue.ThrottledAsyncSphereOverlapActors
struct UAsyncOverlapQueue_ThrottledAsyncSphereOverlapActors_Params
{
public:
	class AActor*                                ContextActor;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x14(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        ActorsToIgnore;                                    // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	UDelegateProperty_                           ShouldCancelProcess;                               // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	UDelegateProperty_                           ProcessHitActorFunction;                           // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	UDelegateProperty_                           CompletionFunction;                                // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function FortniteGame.AsyncOverlapQueue.AsyncSphereOverlapActors
struct UAsyncOverlapQueue_AsyncSphereOverlapActors_Params
{
public:
	class AActor*                                ContextActor;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x14(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        ActorsToIgnore;                                    // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	UDelegateProperty_                           ShouldCancelProcess;                               // 0x28(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	UDelegateProperty_                           ProcessHitActorFunction;                           // 0x38(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	UDelegateProperty_                           CompletionFunction;                                // 0x48(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.AsyncTaskQueue.OnAsyncTaskFinished
struct UAsyncTaskQueue_OnAsyncTaskFinished_Params
{
public:
	struct FAsyncTaskResult                      Result;                                            // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.WakeUp
struct AFortAIController_WakeUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.UnregisterForGoalDetection
struct AFortAIController_UnregisterForGoalDetection_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.UnlockMovementResource
struct AFortAIController_UnlockMovementResource_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.UnlockBehaviorResource
struct AFortAIController_UnlockBehaviorResource_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIController.SetupCustomVIM
struct AFortAIController_SetupCustomVIM_Params
{
public:
	class UClass*                                VIM;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.SetTeamInt
struct AFortAIController_SetTeamInt_Params
{
public:
	uint8                                        InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.SetTeam
struct AFortAIController_SetTeam_Params
{
public:
	enum class EFortTeam                         InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIController.SetPawnAIType
struct AFortAIController_SetPawnAIType_Params
{
public:
	enum class EFortressAIType                   NewAIType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                SpawnSpot;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.SetIsSleeping
struct AFortAIController_SetIsSleeping_Params
{
public:
	bool                                         bNewSleepStatus;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIController.SetGoalActor
struct AFortAIController_SetGoalActor_Params
{
public:
	class AActor*                                InActor;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLocationAlwaysKnown;                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.SetFullPeripheralVision
struct AFortAIController_SetFullPeripheralVision_Params
{
public:
	bool                                         bNewFullPeripheralVision;                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.SetAlwaysGameplayRelevant
struct AFortAIController_SetAlwaysGameplayRelevant_Params
{
public:
	bool                                         bInAlwaysGameplayRelevant;                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.OnBuildingActorGoalDestroyed
struct AFortAIController_OnBuildingActorGoalDestroyed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.LockMovementResource
struct AFortAIController_LockMovementResource_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIController.LockBehaviorResource
struct AFortAIController_LockBehaviorResource_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIController.IsIgnoringProximity
struct AFortAIController_IsIgnoringProximity_Params
{
public:
	class AFortAIController*                     FortAIController;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAIController.IsAllowedToSleep
struct AFortAIController_IsAllowedToSleep_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortAIController.IgnoreProximityForDuration
struct AFortAIController_IgnoreProximityForDuration_Params
{
public:
	float                                        DurationToIgnore;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIController.GetGoalActor
struct AFortAIController_GetGoalActor_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIController.GetEncounterInfo
struct AFortAIController_GetEncounterInfo_Params
{
public:
	class UFortAIEncounterInfo*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortAIController.CreateBuildingActor
struct AFortAIController_CreateBuildingActor_Params
{
public:
	TSubclassOf<class ABuildingSMActor>          BuildingClass;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               BuildLoc;                                          // 0x8(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              BuildRot;                                          // 0x14(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bMirrored;                                         // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x21(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1180[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.UnregisterPatrolWard
struct AFortAIDirector_UnregisterPatrolWard_Params
{
public:
	UInterfaceProperty_                          PatrolWard;                                        // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.RegisterPatrolWard
struct AFortAIDirector_RegisterPatrolWard_Params
{
public:
	UInterfaceProperty_                          PatrolWard;                                        // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIDirector.ReceivePawnSpawned
struct AFortAIDirector_ReceivePawnSpawned_Params
{
public:
	class AFortPawn*                             SpawnedPawn;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteGame.FortAIDirector.PostDayPhaseChanged
struct AFortAIDirector_PostDayPhaseChanged_Params
{
public:
	enum class EFortDayPhase                     CurrentDayPhase;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     PreviousDayPhase;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAtCreation;                                       // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.OnRestStarted
struct AFortAIDirector_OnRestStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.OnRampStarted
struct AFortAIDirector_OnRampStarted_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIDirector.OnPlayerSpawn
struct AFortAIDirector_OnPlayerSpawn_Params
{
public:
	class AFortPlayerPawn*                       PlayerPawn;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIDirector.OnPlayerDied
struct AFortAIDirector_OnPlayerDied_Params
{
public:
	class AFortPlayerPawn*                       PlayerPawn;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.OnPeakStarted
struct AFortAIDirector_OnPeakStarted_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAIDirector.OnPawnDied
struct AFortAIDirector_OnPawnDied_Params
{
public:
	class AFortAIPawn*                           KilledPawn;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.OnFadeStarted
struct AFortAIDirector_OnFadeStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.OnDirectorDeactivated
struct AFortAIDirector_OnDirectorDeactivated_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function FortniteGame.FortAIDirector.OnDayPhaseChanged
struct AFortAIDirector_OnDayPhaseChanged_Params
{
public:
	enum class EFortDayPhase                     CurrentDayPhase;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     PreviousDayPhase;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAtCreation;                                       // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.IsPointTooCloseToPatrolWards
struct AFortAIDirector_IsPointTooCloseToPatrolWards_Params
{
public:
	struct FVector                               Point;                                             // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWardAffectType                   WardEffectTypeFilter;                              // 0xC(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xD(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118A[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// Function FortniteGame.FortAIDirector.IsLineTooCloseToPatrolWards
struct AFortAIDirector_IsLineTooCloseToPatrolWards_Params
{
public:
	struct FVector                               LineStart;                                         // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LineEnd;                                           // 0xC(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// Function FortniteGame.FortAIDirector.IsAnyEncounterGoalWithinDistanceOfPoint
struct AFortAIDirector_IsAnyEncounterGoalWithinDistanceOfPoint_Params
{
public:
	struct FVector                               Point;                                             // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Distance;                                          // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnlyActiveEncounters;                             // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x11(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118C[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.IsAnyAIRelevantToPlayer
struct AFortAIDirector_IsAnyAIRelevantToPlayer_Params
{
public:
	class AFortPlayerPawn*                       Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.IsAnyActiveEncounterRelevantToPlayer
struct AFortAIDirector_IsAnyActiveEncounterRelevantToPlayer_Params
{
public:
	class AFortPlayerPawn*                       Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.IsAnyActiveEncounterRelevantToDefender
struct AFortAIDirector_IsAnyActiveEncounterRelevantToDefender_Params
{
public:
	class AFortAIPawn*                           Defender;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.GetVectorFromEncounterDirection
struct AFortAIDirector_GetVectorFromEncounterDirection_Params
{
public:
	enum class EFortEncounterDirection           Direction;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1190[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortAIDirector.GetRiftsFromClosestActiveEncounterTo
struct AFortAIDirector_GetRiftsFromClosestActiveEncounterTo_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ABuildingRift*>                 ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortAIDirector.GetNumPlayers
struct AFortAIDirector_GetNumPlayers_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.GetEncounterDirectionFromVector
struct AFortAIDirector_GetEncounterDirectionFromVector_Params
{
public:
	struct FVector                               DirectionVector;                                   // 0x0(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortEncounterDirection           ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1191[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAIDirector.GetAmbientThreatEncounterSpawnLocations
struct AFortAIDirector_GetAmbientThreatEncounterSpawnLocations_Params
{
public:
	TArray<struct FVector>                       AmbientThreatEncounterSpawnLocations;              // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.Deactivate
struct AFortAIDirector_Deactivate_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortAIDirector.ConvertInvalidDirectionsToValidDirections
struct AFortAIDirector_ConvertInvalidDirectionsToValidDirections_Params
{
public:
	TArray<enum class EFortEncounterDirection>   InvalidDirections;                                 // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<enum class EFortEncounterDirection>   ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAIDirector.Activate
struct AFortAIDirector_Activate_Params
{
public:
};

// 0x2C (0x2C - 0x0)
// Function FortniteGame.FortAISystem.IsInCone2D
struct UFortAISystem_IsInCone2D_Params
{
public:
	struct FVector                               ConeOrigin;                                        // 0x0(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ConeDirection;                                     // 0xC(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HalfAngle;                                         // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationToCheck;                                   // 0x1C(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11AD[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.ShouldShowPreviewOnCurrentHero
struct UFortItemDefinition_ShouldShowPreviewOnCurrentHero_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.IsInventorySizeLimited
struct UFortItemDefinition_IsInventorySizeLimited_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetTooltip
struct UFortItemDefinition_GetTooltip_Params
{
public:
	bool                                         bSummaryTooltip;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortTooltip>              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSmallPreviewImageBrush
struct UFortItemDefinition_GetSmallPreviewImageBrush_Params
{
public:
	struct FSlateBrush                           ReturnValue;                                       // 0x0(0x88)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSmallPreviewImage
struct UFortItemDefinition_GetSmallPreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSingleLineDescription
struct UFortItemDefinition_GetSingleLineDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetShortDescription
struct UFortItemDefinition_GetShortDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetRichDescription
struct UFortItemDefinition_GetRichDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteGame.FortItemDefinition.GetRarityOrSeriesColors
struct UFortItemDefinition_GetRarityOrSeriesColors_Params
{
public:
	struct FFortColorPalette                     ReturnValue;                                       // 0x0(0x50)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.GetRarity
struct UFortItemDefinition_GetRarity_Params
{
public:
	enum class EFortRarity                       ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewStaticMeshAsset
struct UFortItemDefinition_GetPreviewStaticMeshAsset_Params
{
public:
	TSoftObjectPtr<class UStaticMesh>            Asset;                                             // 0x0(0x28)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewSkeletalMeshAsset
struct UFortItemDefinition_GetPreviewSkeletalMeshAsset_Params
{
public:
	TSoftObjectPtr<class USkeletalMesh>          Asset;                                             // 0x0(0x28)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewPrefabAsset
struct UFortItemDefinition_GetPreviewPrefabAsset_Params
{
public:
	TSoftClassPtr<class AActor>                  Asset;                                             // 0x0(0x28)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewMeshOffset
struct UFortItemDefinition_GetPreviewMeshOffset_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewAssets
struct UFortItemDefinition_GetPreviewAssets_Params
{
public:
	TArray<TSoftObjectPtr<class UObject>>        Assets;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPersistentName
struct UFortItemDefinition_GetPersistentName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItemDefinition.GetLargePreviewImage
struct UFortItemDefinition_GetLargePreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDefinition.GetItemTypeName
struct UFortItemDefinition_GetItemTypeName_Params
{
public:
	bool                                         bUsePlural;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.GetItemType
struct UFortItemDefinition_GetItemType_Params
{
public:
	enum class EFortItemType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDisplayStats
struct UFortItemDefinition_GetDisplayStats_Params
{
public:
	class UFortTooltipDisplayStatsList*          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDisplayName
struct UFortItemDefinition_GetDisplayName_Params
{
public:
	bool                                         bBaseName;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDisplayAssetPath
struct UFortItemDefinition_GetDisplayAssetPath_Params
{
public:
	struct FSoftObjectPath                       ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDescription
struct UFortItemDefinition_GetDescription_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.CustomizePreviewPrefab
struct UFortItemDefinition_CustomizePreviewPrefab_Params
{
public:
	class AActor*                                PrefabInstance;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.CustomizePreviewMesh
struct UFortItemDefinition_CustomizePreviewMesh_Params
{
public:
	class UMeshComponent*                        Mesh;                                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.CreateTemporaryItemInstanceBP
struct UFortItemDefinition_CreateTemporaryItemInstanceBP_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.CreateTemporaryInstanceFromExistingItemBP
struct UFortItemDefinition_CreateTemporaryInstanceFromExistingItemBP_Params
{
public:
	class UFortItem*                             ExistingItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.HasVariants
struct UAthenaCosmeticItemDefinition_HasVariants_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.HasModifiableVariants
struct UAthenaCosmeticItemDefinition_HasModifiableVariants_Params
{
public:
	class UFortItem*                             InItem;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetVariantChannel
struct UAthenaCosmeticItemDefinition_GetVariantChannel_Params
{
public:
	struct FGameplayTag                          InVariantChannelTag;                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCosmeticVariant*                  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetPreviewPawnRotationOffset
struct UAthenaCosmeticItemDefinition_GetPreviewPawnRotationOffset_Params
{
public:
	struct FRotator                              ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetItemVariantPreviews
struct UAthenaCosmeticItemDefinition_GetItemVariantPreviews_Params
{
public:
	TArray<struct FFortCosmeticVariantPreview>   ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetItemAdaptiveStatPreviews
struct UAthenaCosmeticItemDefinition_GetItemAdaptiveStatPreviews_Params
{
public:
	TArray<struct FFortCosmeticAdaptiveStatPreview> ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetDefaultVariantChannels
struct UAthenaCosmeticItemDefinition_GetDefaultVariantChannels_Params
{
public:
	TArray<struct FMcpVariantChannelInfo>        OutDefaultVariantData;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.GetAdaptivePlayerStatsList
struct UAthenaCosmeticItemDefinition_GetAdaptivePlayerStatsList_Params
{
public:
	struct FGameplayTagContainer                 ReturnValue;                                       // 0x0(0x20)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AthenaCosmeticItemDefinition.ApplyVariants
struct UAthenaCosmeticItemDefinition_ApplyVariants_Params
{
public:
	class AActor*                                InActor;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMcpVariantChannelInfo>        VariantChannels;                                   // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaCharacterPartItemDefinition.GetCharacterParts
struct UAthenaCharacterPartItemDefinition_GetCharacterParts_Params
{
public:
	TArray<class UCustomCharacterPart*>          ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.UseDefaultHealthBar
struct ABuildingActor_UseDefaultHealthBar_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.SnapDmgVisualsToCurrentHealth
struct ABuildingActor_SnapDmgVisualsToCurrentHealth_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.SilentDie
struct ABuildingActor_SilentDie_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.ShouldDie
struct ABuildingActor_ShouldDie_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           EventInstigator;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetTeam
struct ABuildingActor_SetTeam_Params
{
public:
	uint8                                        InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetSuppressHealthBar
struct ABuildingActor_SetSuppressHealthBar_Params
{
public:
	bool                                         bNewValue;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetQuestHighlight
struct ABuildingActor_SetQuestHighlight_Params
{
public:
	bool                                         Enabled;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetNavigationModifier
struct ABuildingActor_SetNavigationModifier_Params
{
public:
	bool                                         bEnableModifier;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.SetHealthBarIndicatorDifficultyRating
struct ABuildingActor_SetHealthBarIndicatorDifficultyRating_Params
{
public:
	int32                                        InDisplayLevel;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.SetHealth
struct ABuildingActor_SetHealth_Params
{
public:
	float                                        NewHealth;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.SetCustomState
struct ABuildingActor_SetCustomState_Params
{
public:
	class FString                                NewState;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetCanExportNavigationObstacle
struct ABuildingActor_SetCanExportNavigationObstacle_Params
{
public:
	bool                                         InCanExportNavigationObstacle;                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetCanBeSavedToCreativeVolume
struct ABuildingActor_SetCanBeSavedToCreativeVolume_Params
{
public:
	bool                                         bCanBeSaved;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.Resave
struct ABuildingActor_Resave_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.RemoveEditorOnlyInstanceGameplayTags
struct ABuildingActor_RemoveEditorOnlyInstanceGameplayTags_Params
{
public:
	struct FGameplayTagContainer                 TagsToRemove;                                      // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.RemoveAbilitySystemComponentAfterAutoBuildIfFullHealth
struct ABuildingActor_RemoveAbilitySystemComponentAfterAutoBuildIfFullHealth_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.PlacedByPlayer
struct ABuildingActor_PlacedByPlayer_Params
{
public:
	class AFortPlayerStateZone*                  PlayerState;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.PlacedByPlacementTool
struct ABuildingActor_PlacedByPlacementTool_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnWorldReady
struct ABuildingActor_OnWorldReady_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.OnSetCustomDepthStencilValue
struct ABuildingActor_OnSetCustomDepthStencilValue_Params
{
public:
	TArray<class UPrimitiveComponent*>           PrimComponents;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bUseCustomDepth;                                   // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        StencilValue;                                      // 0x14(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOutConsume;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_Team
struct ABuildingActor_OnRep_Team_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_InstantDeath
struct ABuildingActor_OnRep_InstantDeath_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_InitialOverlappingVehicles
struct ABuildingActor_OnRep_InitialOverlappingVehicles_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_CustomState
struct ABuildingActor_OnRep_CustomState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_CurrentBuildingLevel
struct ABuildingActor_OnRep_CurrentBuildingLevel_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_BuildingAttributeSet
struct ABuildingActor_OnRep_BuildingAttributeSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_bForceReplayRollback
struct ABuildingActor_OnRep_bForceReplayRollback_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_bCollisionBlockedByPawns
struct ABuildingActor_OnRep_bCollisionBlockedByPawns_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_AbilitySystemComponent
struct ABuildingActor_OnRep_AbilitySystemComponent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnMatchStarted
struct ABuildingActor_OnMatchStarted_Params
{
public:
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDeathServer
struct ABuildingActor_OnDeathServer_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitInfo;                                           // 0x34(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDeathPlayEffects
struct ABuildingActor_OnDeathPlayEffects_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitInfo;                                           // 0x34(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPawn*                             InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteGame.BuildingActor.OnDayPhaseChanged
struct ABuildingActor_OnDayPhaseChanged_Params
{
public:
	enum class EFortDayPhase                     CurrentDayPhase;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     PreviousDayPhase;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAtCreation;                                       // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDamageServer
struct ABuildingActor_OnDamageServer_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitInfo;                                           // 0x34(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDamagePlayEffects
struct ABuildingActor_OnDamagePlayEffects_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitInfo;                                           // 0x34(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPawn*                             InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.BuildingActor.OnBuildingActorInitialized
struct ABuildingActor_OnBuildingActorInitialized_Params
{
public:
	enum class EFortBuildingInitializationReason InitializationReason;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingPersistentState      BuildingPersistentState;                           // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.IsPlayerBuilt
struct ABuildingActor_IsPlayerBuilt_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.IsDamaged
struct ABuildingActor_IsDamaged_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteGame.BuildingActor.IsAcceptablePositionForPlacement
struct ABuildingActor_IsAcceptablePositionForPlacement_Params
{
public:
	struct FVector                               InLocation;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              InRotation;                                        // 0xC(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AFortDecoTool*                         DecoTool;                                          // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCDO;                                            // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OutFailureReason;                                  // 0x28(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x40(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingActor.InitializeKismetSpawnedBuildingActor
struct ABuildingActor_InitializeKismetSpawnedBuildingActor_Params
{
public:
	class ABuildingActor*                        BuildingOwner;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 SpawningController;                                // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePlayerBuildAnimations;                         // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.HasHealthLeft
struct ABuildingActor_HasHealthLeft_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.HandleDestroyed
struct ABuildingActor_HandleDestroyed_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetShieldPercent
struct ABuildingActor_GetShieldPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetShieldOrHealthPercent
struct ABuildingActor_GetShieldOrHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetShield
struct ABuildingActor_GetShield_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.GetOwningPlayerState
struct ABuildingActor_GetOwningPlayerState_Params
{
public:
	class AFortPlayerState*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.GetOwningController
struct ABuildingActor_GetOwningController_Params
{
public:
	class AController*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetMissingHealth
struct ABuildingActor_GetMissingHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetMaxShield
struct ABuildingActor_GetMaxShield_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetMaxHealth
struct ABuildingActor_GetMaxHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetHealthPercent
struct ABuildingActor_GetHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetHealth
struct ABuildingActor_GetHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.GetEditorTestTags
struct ABuildingActor_GetEditorTestTags_Params
{
public:
	struct FGameplayTagContainer                 TagContainer;                                      // 0x0(0x20)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.GetCustomState
struct ABuildingActor_GetCustomState_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetCurrentBuildingLevel
struct ABuildingActor_GetCurrentBuildingLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.BuildingActor.GetCentroid
struct ABuildingActor_GetCentroid_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_InstantDeath
struct ABuildingActor_GameplayCue_InstantDeath_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_Healing
struct ABuildingActor_GameplayCue_Healing_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_Damage
struct ABuildingActor_GameplayCue_Damage_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.ForceBuildingHealth
struct ABuildingActor_ForceBuildingHealth_Params
{
public:
	float                                        NewHealth;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.CustomStateChanged
struct ABuildingActor_CustomStateChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.ClearPlayedDying
struct ABuildingActor_ClearPlayedDying_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnLocalInteract
struct ABuildingActor_BlueprintOnLocalInteract_Params
{
public:
	class AFortPlayerPawn*                       InteractingPawn;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnInteract
struct ABuildingActor_BlueprintOnInteract_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnBeginInteract
struct ABuildingActor_BlueprintOnBeginInteract_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintGetInteractionString
struct ABuildingActor_BlueprintGetInteractionString_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintGetFailedInteractionString
struct ABuildingActor_BlueprintGetFailedInteractionString_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintCanInteract
struct ABuildingActor_BlueprintCanInteract_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.AddEditorOnlyInstanceGameplayTags
struct ABuildingActor_AddEditorOnlyInstanceGameplayTags_Params
{
public:
	struct FGameplayTagContainer                 NewTags;                                           // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetTouchComponentForAbilityDeliveryInfo
struct ABuildingGameplayActor_SetTouchComponentForAbilityDeliveryInfo_Params
{
public:
	class UPrimitiveComponent*                   PrimitiveComponent;                                // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetInitialVelocity
struct ABuildingGameplayActor_SetInitialVelocity_Params
{
public:
	struct FVector                               InitialVelocity;                                   // 0x0(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetIgnoreInstigatorCollision
struct ABuildingGameplayActor_SetIgnoreInstigatorCollision_Params
{
public:
	bool                                         bShouldIgnore;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetAbilitySourceLevel
struct ABuildingGameplayActor_SetAbilitySourceLevel_Params
{
public:
	int32                                        NewAbilitySourceLevel;                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnReplicatedVelocityStartOrStop
struct ABuildingGameplayActor_OnReplicatedVelocityStartOrStop_Params
{
public:
	bool                                         bStart;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnRegisteredTouchComponentEndOverlap
struct ABuildingGameplayActor_OnRegisteredTouchComponentEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Other;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnRegisteredTouchComponentBeginOverlap
struct ABuildingGameplayActor_OnRegisteredTouchComponentBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Other;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnDropped
struct ABuildingGameplayActor_OnDropped_Params
{
public:
	bool                                         bValidLocation;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPassesPlacementRestrictions;                      // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasIntentionallyPlaced;                           // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_RemoveGameplayCue
struct ABuildingGameplayActor_K2_RemoveGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_ExecuteGameplayCueWithParams
struct ABuildingGameplayActor_K2_ExecuteGameplayCueWithParams_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x8(0xB8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_ExecuteGameplayCue
struct ABuildingGameplayActor_K2_ExecuteGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          Context;                                           // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_AddGameplayCue
struct ABuildingGameplayActor_K2_AddGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          Context;                                           // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.BuildingGameplayActor.GetTargetingSourceTransform
struct ABuildingGameplayActor_GetTargetingSourceTransform_Params
{
public:
	enum class EFortAbilityTargetingSource       Source;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D5[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ReturnValue;                                       // 0x10(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.ForceChangeOwnerInstigator
struct ABuildingGameplayActor_ForceChangeOwnerInstigator_Params
{
public:
	class AFortPlayerController*                 NewInstigator;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.EnableAbilityDeliveryInfo
struct ABuildingGameplayActor_EnableAbilityDeliveryInfo_Params
{
public:
	struct FGameplayTag                          BucketTag;                                         // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.DisableAbilityDeliveryInfo
struct ABuildingGameplayActor_DisableAbilityDeliveryInfo_Params
{
public:
	struct FGameplayTag                          BucketTag;                                         // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.OnStateChange
struct AAthenaBarrierFlag_OnStateChange_Params
{
public:
	enum class EBarrierFlagState                 NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.OnRep_FoodTeam
struct AAthenaBarrierFlag_OnRep_FoodTeam_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.OnRep_CurrentState
struct AAthenaBarrierFlag_OnRep_CurrentState_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.OnNewFoodTeam
struct AAthenaBarrierFlag_OnNewFoodTeam_Params
{
public:
	enum class EBarrierFoodTeam                  NewFoodTeam;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.GetObjectiveActor
struct AAthenaBarrierFlag_GetObjectiveActor_Params
{
public:
	class AAthenaBarrierObjective*               ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AthenaBarrierFlag.GetMeshScale
struct AAthenaBarrierFlag_GetMeshScale_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.GetHeadMesh
struct AAthenaBarrierFlag_GetHeadMesh_Params
{
public:
	class UStaticMesh*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AthenaBarrierFlag.ClientSetLlamaRotation
struct AAthenaBarrierFlag_ClientSetLlamaRotation_Params
{
public:
	struct FRotator                              NewDirection;                                      // 0x0(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierFlag.ClientSetIsFriendly
struct AAthenaBarrierFlag_ClientSetIsFriendly_Params
{
public:
	bool                                         bIsFriendlyLlama;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.UpdateInGameHealth
struct AAthenaBarrierObjective_UpdateInGameHealth_Params
{
public:
	float                                        NewHealthPercent;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.SetHeadMesh
struct AAthenaBarrierObjective_SetHeadMesh_Params
{
public:
	class UStaticMesh*                           NewMesh;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               NewScale;                                          // 0x8(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               NewOffset;                                         // 0x14(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>            MaterialsToSwap;                                   // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnRep_ObjectiveDamageState
struct AAthenaBarrierObjective_OnRep_ObjectiveDamageState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnRep_HeadRotationYaw
struct AAthenaBarrierObjective_OnRep_HeadRotationYaw_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnRep_FoodTeam
struct AAthenaBarrierObjective_OnRep_FoodTeam_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnNewDamageState
struct AAthenaBarrierObjective_OnNewDamageState_Params
{
public:
	enum class EBarrierObjectiveDamageState      NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnHeadRotationSet
struct AAthenaBarrierObjective_OnHeadRotationSet_Params
{
public:
	float                                        NewYaw;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.OnGeneratorDestroyed
struct AAthenaBarrierObjective_OnGeneratorDestroyed_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.IsFriendlyTeam
struct AAthenaBarrierObjective_IsFriendlyTeam_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.GetObjectiveDamageState
struct AAthenaBarrierObjective_GetObjectiveDamageState_Params
{
public:
	enum class EBarrierObjectiveDamageState      ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.GetFoodTeam
struct AAthenaBarrierObjective_GetFoodTeam_Params
{
public:
	enum class EBarrierFoodTeam                  ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaBarrierObjective.ApplyTimerGE
struct AAthenaBarrierObjective_ApplyTimerGE_Params
{
public:
	float                                        TimerLength;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetLobbyLoopingSound
struct UAthenaBattleBusItemDefinition_GetLobbyLoopingSound_Params
{
public:
	class USoundBase*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetLobbyLoopingMusic
struct UAthenaBattleBusItemDefinition_GetLobbyLoopingMusic_Params
{
public:
	class USoundBase*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetIgnitionSound
struct UAthenaBattleBusItemDefinition_GetIgnitionSound_Params
{
public:
	class USoundBase*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetFlightLoopingSound
struct UAthenaBattleBusItemDefinition_GetFlightLoopingSound_Params
{
public:
	class USoundBase*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetFlightLoopingMusic
struct UAthenaBattleBusItemDefinition_GetFlightLoopingMusic_Params
{
public:
	class USoundBase*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaBattleBusItemDefinition.GetBusPrefabClass
struct UAthenaBattleBusItemDefinition_GetBusPrefabClass_Params
{
public:
	TSoftClassPtr<class ABattleBusCosmeticInstanceBase> ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.WallStartingToComeDown
struct AAthenaBigBaseWall_WallStartingToComeDown_Params
{
public:
	bool                                         bIsOnBurgerSide;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.UpdateWallTime
struct AAthenaBigBaseWall_UpdateWallTime_Params
{
public:
	float                                        Digit_0;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Digit_1;                                           // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Digit_2;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Digit_3;                                           // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.ShowOrHideTimer
struct AAthenaBigBaseWall_ShowOrHideTimer_Params
{
public:
	bool                                         bNewVisibleState;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.OnRep_WallGravity
struct AAthenaBigBaseWall_OnRep_WallGravity_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.OnRep_TimeUntilWallComesDown
struct AAthenaBigBaseWall_OnRep_TimeUntilWallComesDown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.OnRep_ResetBool
struct AAthenaBigBaseWall_OnRep_ResetBool_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.OnRep_BarrierState
struct AAthenaBigBaseWall_OnRep_BarrierState_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaBigBaseWall.OnNewBarrierState
struct AAthenaBigBaseWall_OnNewBarrierState_Params
{
public:
	enum class EBarrierState                     NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCapturePoint.SetActivatedState
struct AAthenaCapturePoint_SetActivatedState_Params
{
public:
	bool                                         bInActivated;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_ReplicatedCapturePercentage
struct AAthenaCapturePoint_OnRep_ReplicatedCapturePercentage_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_IconMaterialIndexParameter
struct AAthenaCapturePoint_OnRep_IconMaterialIndexParameter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_CaptureState
struct AAthenaCapturePoint_OnRep_CaptureState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_bPermanentShutdown
struct AAthenaCapturePoint_OnRep_bPermanentShutdown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_bLocked
struct AAthenaCapturePoint_OnRep_bLocked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnRep_bActivated
struct AAthenaCapturePoint_OnRep_bActivated_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnLeaveCapturePoint
struct AAthenaCapturePoint_OnLeaveCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnEnterCapturePoint
struct AAthenaCapturePoint_OnEnterCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnCapturePointStateChange
struct AAthenaCapturePoint_OnCapturePointStateChange_Params
{
public:
	enum class ECapturePointState                InState;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InTeam;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnCapturePointLockStateChange
struct AAthenaCapturePoint_OnCapturePointLockStateChange_Params
{
public:
	bool                                         bInLocked;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCapturePoint.OnCapturePointActiveStateChange
struct AAthenaCapturePoint_OnCapturePointActiveStateChange_Params
{
public:
	bool                                         bInActive;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCapturePoint.HasDancingPlayer
struct AAthenaCapturePoint_HasDancingPlayer_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaCapturePoint.GetNumDancingPlayers
struct AAthenaCapturePoint_GetNumDancingPlayers_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCapturePoint.GetCaptureState
struct AAthenaCapturePoint_GetCaptureState_Params
{
public:
	enum class ECapturePointState                ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.ShouldDisplayOverallQuestInformation
struct UFortQuestItemDefinition_ShouldDisplayOverallQuestInformation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.ShouldAutoLaunch
struct UFortQuestItemDefinition_ShouldAutoLaunch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.IsTutorialQuest
struct UFortQuestItemDefinition_IsTutorialQuest_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.IsIncludedInCategories
struct UFortQuestItemDefinition_IsIncludedInCategories_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.IsHidden
struct UFortQuestItemDefinition_IsHidden_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.IsDeprecated
struct UFortQuestItemDefinition_IsDeprecated_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetWeight
struct UFortQuestItemDefinition_GetWeight_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetUpdateObjectiveOncePerMatch
struct UFortQuestItemDefinition_GetUpdateObjectiveOncePerMatch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetSelectRewardsConversation
struct UFortQuestItemDefinition_GetSelectRewardsConversation_Params
{
public:
	class UFortConversation*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetSelectableRewards_BP
struct UFortQuestItemDefinition_GetSelectableRewards_BP_Params
{
public:
	TArray<struct FFortMcpQuestRewardInfo>       ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetRewardType
struct UFortQuestItemDefinition_GetRewardType_Params
{
public:
	enum class EFortQuestRewardType              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetRewards_BP
struct UFortQuestItemDefinition_GetRewards_BP_Params
{
public:
	TArray<struct FFortItemQuantityPair>         ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetRewardInfo_BP
struct UFortQuestItemDefinition_GetRewardInfo_BP_Params
{
public:
	struct FFortRewardInfo                       ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetRewardHeaderText
struct UFortQuestItemDefinition_GetRewardHeaderText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetRewardDescription
struct UFortQuestItemDefinition_GetRewardDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetQuestType
struct UFortQuestItemDefinition_GetQuestType_Params
{
public:
	enum class EFortQuestType                    ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetPrerequisiteQuest
struct UFortQuestItemDefinition_GetPrerequisiteQuest_Params
{
public:
	class UFortQuestItemDefinition*              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetPrerequisiteObjective
struct UFortQuestItemDefinition_GetPrerequisiteObjective_Params
{
public:
	struct FDataTableRowHandle                   ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetPartialObjectiveCompletionCount
struct UFortQuestItemDefinition_GetPartialObjectiveCompletionCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetObjectives_BP
struct UFortQuestItemDefinition_GetObjectives_BP_Params
{
public:
	TArray<struct FFortMcpQuestObjectiveInfo>    ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetObjectiveNeededToComplete
struct UFortQuestItemDefinition_GetObjectiveNeededToComplete_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetIntroConversation
struct UFortQuestItemDefinition_GetIntroConversation_Params
{
public:
	class UFortConversation*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetHiddenRewards_BP
struct UFortQuestItemDefinition_GetHiddenRewards_BP_Params
{
public:
	TArray<struct FFortHiddenRewardQuantityPair> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetCompletionText
struct UFortQuestItemDefinition_GetCompletionText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetClaimConversation
struct UFortQuestItemDefinition_GetClaimConversation_Params
{
public:
	class UFortConversation*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetChallengeChainRewardInfo
struct UFortQuestItemDefinition_GetChallengeChainRewardInfo_Params
{
public:
	bool                                         bGetAllQuestRewards;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortRewardInfo                       ReturnValue;                                       // 0x8(0x30)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetCategory
struct UFortQuestItemDefinition_GetCategory_Params
{
public:
	struct FDataTableRowHandle                   ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetAthenaUpdateObjectiveOncePerMatch
struct UFortQuestItemDefinition_GetAthenaUpdateObjectiveOncePerMatch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.GetAthenaObjectiveMustBeCompletedInASingleMatch
struct UFortQuestItemDefinition_GetAthenaObjectiveMustBeCompletedInASingleMatch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.ExpandsStormShield
struct UFortQuestItemDefinition_ExpandsStormShield_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.CanPartyAssist
struct UFortQuestItemDefinition_CanPartyAssist_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.AllowsTileMatching
struct UFortQuestItemDefinition_AllowsTileMatching_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuestItemDefinition.AllowsPlayNowNavigation
struct UFortQuestItemDefinition_AllowsPlayNowNavigation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x360 (0x360 - 0x0)
// Function FortniteGame.FortItem.TryGetCategory
struct UFortItem_TryGetCategory_Params
{
public:
	enum class EFortItemCategoryOrdinal          Ordinal;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OutCategoryDisplayName;                            // 0x8(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         OutHasIcon;                                        // 0x20(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortMultiSizeBrush                   OutCategoryIconBrush;                              // 0x28(0x330)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x358(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.SetOwningControllerForTemporaryItem
struct UFortItem_SetOwningControllerForTemporaryItem_Params
{
public:
	class AFortPlayerController*                 InController;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsTemporaryItem
struct UFortItem_IsTemporaryItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSlotted
struct UFortItem_IsSlotted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSchematicOrCraftedWeapon
struct UFortItem_IsSchematicOrCraftedWeapon_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSchematic
struct UFortItem_IsSchematic_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsInventoryOverflowItem
struct UFortItem_IsInventoryOverflowItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsInStorageVault
struct UFortItem_IsInStorageVault_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsEquipped
struct UFortItem_IsEquipped_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.IsEquipable
struct UFortItem_IsEquipable_Params
{
public:
	class AFortPlayerController*                 EquippingPC;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGamepadSwitchingForHeroAbilities;                 // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FA[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsDroppedItem
struct UFortItem_IsDroppedItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItem.IsActivatable
struct UFortItem_IsActivatable_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 FailureReason;                                     // 0x8(0x20)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.HasRarityUpgrade
struct UFortItem_HasRarityUpgrade_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.HasEvolutions
struct UFortItem_HasEvolutions_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.HasDurability
struct UFortItem_HasDurability_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeRestrictionReasonText
struct UFortItem_GetUpgradeRestrictionReasonText_Params
{
public:
	enum class EItemUpgradeRestrictionReason     Reason;                                            // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeResourceItemDefinition
struct UFortItem_GetUpgradeResourceItemDefinition_Params
{
public:
	class UFortPersistentResourceItemDefinition* ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeCost
struct UFortItem_GetUpgradeCost_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetType
struct UFortItem_GetType_Params
{
public:
	enum class EFortItemType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetTier
struct UFortItem_GetTier_Params
{
public:
	enum class EFortItemTier                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.FortItem.GetTertiaryCategory
struct UFortItem_GetTertiaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                           ItemCategoryBrush;                                 // 0x18(0x88)(Parm, OutParm, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    BrushSize;                                         // 0xA0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xA1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FD[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItem.GetSmallPreviewImage
struct UFortItem_GetSmallPreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.FortItem.GetSecondaryCategory
struct UFortItem_GetSecondaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                           ItemCategoryBrush;                                 // 0x18(0x88)(Parm, OutParm, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    BrushSize;                                         // 0xA0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xA1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FE[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetSearchTags
struct UFortItem_GetSearchTags_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetSchematicResultType
struct UFortItem_GetSchematicResultType_Params
{
public:
	enum class EFortItemType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetSchematicCraftingResultOrCraftedWeaponBP
struct UFortItem_GetSchematicCraftingResultOrCraftedWeaponBP_Params
{
public:
	class UFortWeaponItemDefinition*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetSchematicCraftingResultBP
struct UFortItem_GetSchematicCraftingResultBP_Params
{
public:
	class UFortItemDefinition*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRemainingAmmo
struct UFortItem_GetRemainingAmmo_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRecycleValue
struct UFortItem_GetRecycleValue_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRating
struct UFortItem_GetRating_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetRaritySecondaryColor
struct UFortItem_GetRaritySecondaryColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetRarityColor
struct UFortItem_GetRarityColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetRarity
struct UFortItem_GetRarity_Params
{
public:
	enum class EFortRarity                       ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetPrimaryCategory
struct UFortItem_GetPrimaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11FF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetPreviewAssets
struct UFortItem_GetPreviewAssets_Params
{
public:
	TArray<TSoftObjectPtr<class UObject>>        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetOwningController
struct UFortItem_GetOwningController_Params
{
public:
	class AFortPlayerController*                 ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetNumInStack
struct UFortItem_GetNumInStack_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetNormalizedDurability
struct UFortItem_GetNormalizedDurability_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetMaxTier
struct UFortItem_GetMaxTier_Params
{
public:
	enum class EFortItemTier                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetMaxLevel
struct UFortItem_GetMaxLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetLoadedAmmo
struct UFortItem_GetLoadedAmmo_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetLevelRelativeCostForRarityUpgrade
struct UFortItem_GetLevelRelativeCostForRarityUpgrade_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetLevel
struct UFortItem_GetLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItem.GetLargePreviewImage
struct UFortItem_GetLargePreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetItemTypeName
struct UFortItem_GetItemTypeName_Params
{
public:
	bool                                         bUsePlural;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1200[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetItemGuid
struct UFortItem_GetItemGuid_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetItemDefinitionBP
struct UFortItem_GetItemDefinitionBP_Params
{
public:
	class UFortItemDefinition*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetFilterCategory
struct UFortItem_GetFilterCategory_Params
{
public:
	enum class EFortInventoryFilter              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetEvolveRestrictionReasonText
struct UFortItem_GetEvolveRestrictionReasonText_Params
{
public:
	enum class EItemEvolutionRestrictionReason   Reason;                                            // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1201[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetDurability
struct UFortItem_GetDurability_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetDisplayNameWithoutPrefix
struct UFortItem_GetDisplayNameWithoutPrefix_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetDisplayName
struct UFortItem_GetDisplayName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetDescription
struct UFortItem_GetDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetCooldownTimeRemaining
struct UFortItem_GetCooldownTimeRemaining_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownDuration;                                  // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetAlterationSlots
struct UFortItem_GetAlterationSlots_Params
{
public:
	TArray<struct FFortAlterationSlotStatus>     ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetActiveAlterations
struct UFortItem_GetActiveAlterations_Params
{
public:
	int32                                        PretendLevel;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1202[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortAlterationItemDefinition*> ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.DoesMatchSearchString
struct UFortItem_DoesMatchSearchString_Params
{
public:
	class FString                                SearchString;                                      // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1203[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.CanUpgradeItemRarity
struct UFortItem_CanUpgradeItemRarity_Params
{
public:
	TArray<enum class EItemEvolutionRestrictionReason> OutRestrictionReasons;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1204[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.CanEvolve
struct UFortItem_CanEvolve_Params
{
public:
	TArray<enum class EItemEvolutionRestrictionReason> OutRestrictionReasons;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1205[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.CanBeUpgraded
struct UFortItem_CanBeUpgraded_Params
{
public:
	TArray<enum class EItemUpgradeRestrictionReason> OutRestrictionReasons;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1206[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.CanBeUnslotted
struct UFortItem_CanBeUnslotted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.CanBeDropped
struct UFortItem_CanBeDropped_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.AllowedToBeLockedInInventory
struct UFortItem_AllowedToBeLockedInInventory_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortAccountItem.MarkItemAsSeenBP
struct UFortAccountItem_MarkItemAsSeenBP_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAccountItem.IsRefundable
struct UFortAccountItem_IsRefundable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAccountItem.IsFavorite
struct UFortAccountItem_IsFavorite_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortAccountItem.HasBeenSeenLocally
struct UFortAccountItem_HasBeenSeenLocally_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAccountItem.GetRefundResults
struct UFortAccountItem_GetRefundResults_Params
{
public:
	TArray<struct FFortItemQuantityPair>         ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAccountItem.GetRecyclingRefunds
struct UFortAccountItem_GetRecyclingRefunds_Params
{
public:
	TArray<struct FFortItemQuantityPair>         ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCosmeticAccountItem.HasMultipleVariants
struct UAthenaCosmeticAccountItem_HasMultipleVariants_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaCosmeticAccountItem.HasCosmeticVariance
struct UAthenaCosmeticAccountItem_HasCosmeticVariance_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortMontageItemDefinitionBase.ShouldPlayRandomSectionByName
struct UFortMontageItemDefinitionBase_ShouldPlayRandomSectionByName_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortMontageItemDefinitionBase.PreviewInPIE
struct UFortMontageItemDefinitionBase_PreviewInPIE_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortMontageItemDefinitionBase.PickRandomSectionByName
struct UFortMontageItemDefinitionBase_PickRandomSectionByName_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortMontageItemDefinitionBase.GetAnimationHardReference
struct UFortMontageItemDefinitionBase_GetAnimationHardReference_Params
{
public:
	enum class EFortCustomBodyType               BodyType;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortCustomGender                 Gender;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_120F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortMontageItemDefinitionBase.GetAnimation
struct UFortMontageItemDefinitionBase_GetAnimation_Params
{
public:
	enum class EFortCustomBodyType               BodyType;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortCustomGender                 Gender;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1210[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UAnimMontage>           ReturnValue;                                       // 0x8(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingRift.OnStartedEncounterSpawn
struct ABuildingRift_OnStartedEncounterSpawn_Params
{
public:
	class AFortAIPawn*                           SpawnedAI;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnSpawnAI
struct ABuildingRift_OnSpawnAI_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRep_RiftIsVisible
struct ABuildingRift_OnRep_RiftIsVisible_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRep_RiftIsActive
struct ABuildingRift_OnRep_RiftIsActive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRep_CosmeticState
struct ABuildingRift_OnRep_CosmeticState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRemoved
struct ABuildingRift_OnRemoved_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnPlaced
struct ABuildingRift_OnPlaced_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnGameDifficultyChanged
struct ABuildingRift_OnGameDifficultyChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingRift.OnFinishedEncounterSpawn
struct ABuildingRift_OnFinishedEncounterSpawn_Params
{
public:
	class AFortAIPawn*                           SpawnedAI;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnDeactivated
struct ABuildingRift_OnDeactivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnActivated
struct ABuildingRift_OnActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BroadcastRiftSpawningAI
struct ABuildingRift_BroadcastRiftSpawningAI_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BP_Cosmetic_ShouldDie
struct ABuildingRift_BP_Cosmetic_ShouldDie_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BP_Cosmetic_RampUp
struct ABuildingRift_BP_Cosmetic_RampUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BP_Cosmetic_Intro
struct ABuildingRift_BP_Cosmetic_Intro_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BP_Cosmetic_Idle
struct ABuildingRift_BP_Cosmetic_Idle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BlueprintHideVFX
struct ABuildingRift_BlueprintHideVFX_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BlueprintHideRift
struct ABuildingRift_BlueprintHideRift_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AthenaCreativeRift.NotifyActorDespawnEndOverlap
struct AAthenaCreativeRift_NotifyActorDespawnEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_121D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.AthenaCreativeRift.NotifyActorDespawnBeginOverlap
struct AAthenaCreativeRift_NotifyActorDespawnBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_121E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AthenaDanceItemDefinition.GetChatTriggerCommandName
struct UAthenaDanceItemDefinition_GetChatTriggerCommandName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.AthenaEmojiItemDefinition.ConfigureParticleSystem
struct UAthenaEmojiItemDefinition_ConfigureParticleSystem_Params
{
public:
	class UParticleSystemComponent*              ParticleSystem;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             OverrideImage;                                     // 0x8(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8C (0x8C - 0x0)
// Function FortniteGame.AthenaFillFloor.StopMovement
struct AAthenaFillFloor_StopMovement_Params
{
public:
	struct FHitResult                            ImpactResult;                                      // 0x0(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        Time;                                              // 0x88(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnStopMoving
struct AAthenaFillFloor_OnStopMoving_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnStartMoving
struct AAthenaFillFloor_OnStartMoving_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnRep_StepIndex
struct AAthenaFillFloor_OnRep_StepIndex_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnRep_IsMoving
struct AAthenaFillFloor_OnRep_IsMoving_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnRep_FloorZ
struct AAthenaFillFloor_OnRep_FloorZ_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnLavaOverlap
struct AAthenaFillFloor_OnLavaOverlap_Params
{
public:
	class AFortPlayerPawnAthena*                 Pawn;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaFillFloor.OnHeightEvent
struct AAthenaFillFloor_OnHeightEvent_Params
{
public:
	float                                        Height;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HeightEventIndex;                                  // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetMaxDurability
struct UFortWorldItemDefinition_GetMaxDurability_Params
{
public:
	int32                                        ItemLevel;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetFabricationValue
struct UFortWorldItemDefinition_GetFabricationValue_Params
{
public:
	bool                                         bUseDisintegrationOverride;                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1227[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetDPSAtLevel
struct UFortWorldItemDefinition_GetDPSAtLevel_Params
{
public:
	int32                                        ItemLevel;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetDamageAtLevel
struct UFortWorldItemDefinition_GetDamageAtLevel_Params
{
public:
	int32                                        ItemLevel;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetAmmoWorldItemDefinition_BP
struct UFortWorldItemDefinition_GetAmmoWorldItemDefinition_BP_Params
{
public:
	class UFortWorldItemDefinition*              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.CanBeDisassembled
struct UFortWorldItemDefinition_CanBeDisassembled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortGadgetItemDefinition.HasTrackedAttributes
struct UFortGadgetItemDefinition_HasTrackedAttributes_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortGadgetItemDefinition.HasChargeUp
struct UFortGadgetItemDefinition_HasChargeUp_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGadgetItemDefinition.GetWeaponItemDefinition
struct UFortGadgetItemDefinition_GetWeaponItemDefinition_Params
{
public:
	class UFortWeaponItemDefinition*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortGadgetItemDefinition.GetLevelAttribute
struct UFortGadgetItemDefinition_GetLevelAttribute_Params
{
public:
	struct FGameplayAttribute                    ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGadgetItemDefinition.GetGameplayAbility
struct UFortGadgetItemDefinition_GetGameplayAbility_Params
{
public:
	TSubclassOf<class UFortGameplayAbility>      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationText
struct UFortTooltip_SetLocalizationText_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Value;                                             // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationInt
struct UFortTooltip_SetLocalizationInt_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_122E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationFloat
struct UFortTooltip_SetLocalizationFloat_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_122F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortTooltip.GetValueData
struct UFortTooltip_GetValueData_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTooltipValueData                 OutData;                                           // 0x18(0x70)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x88(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1230[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortTooltip.GetTokenizedDescriptionText
struct UFortTooltip_GetTokenizedDescriptionText_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                          OutDescription;                                    // 0x18(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1231[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortTooltip.GetTextForToken
struct UFortTooltip_GetTextForToken_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  OutText;                                           // 0x20(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1232[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.GetNumericValue
struct UFortTooltip_GetNumericValue_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutVal;                                            // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1233[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetValueData
struct UFortTooltip_BP_GetValueData_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTooltipValueData                 OutData;                                           // 0x18(0x70)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x88(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1234[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetTokenizedDescriptionText
struct UFortTooltip_BP_GetTokenizedDescriptionText_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                          OutDescription;                                    // 0x18(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1235[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetTextForToken
struct UFortTooltip_BP_GetTextForToken_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  OutText;                                           // 0x20(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1236[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetNumericValue
struct UFortTooltip_BP_GetNumericValue_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutVal;                                            // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1237[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaGliderItemDefinition.GetParachutePrefabClass
struct UAthenaGliderItemDefinition_GetParachutePrefabClass_Params
{
public:
	TSubclassOf<class AFortPlayerParachute>      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaGliderItemDefinition.GetOverrideSkelMeshPtr
struct UAthenaGliderItemDefinition_GetOverrideSkelMeshPtr_Params
{
public:
	TSoftObjectPtr<class USkeletalMesh>          ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaGliderItemDefinition.GetOverrideAnimSetPtr
struct UAthenaGliderItemDefinition_GetOverrideAnimSetPtr_Params
{
public:
	TSoftClassPtr<class UAnimInstance>           ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AthenaGoosePickup.SetStaticMesh
struct AAthenaGoosePickup_SetStaticMesh_Params
{
public:
	class UStaticMesh*                           NewStaticMesh;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>            MaterialsToSwap;                                   // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        InDisplayIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_123A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnStartDespawnWarning_Client
struct AAthenaGoosePickup_OnStartDespawnWarning_Client_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnRep_PickupState
struct AAthenaGoosePickup_OnRep_PickupState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnRep_DisplayIndex
struct AAthenaGoosePickup_OnRep_DisplayIndex_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnRep_bIsDespawning
struct AAthenaGoosePickup_OnRep_bIsDespawning_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnImpactedByPlane_Server
struct AAthenaGoosePickup_OnImpactedByPlane_Server_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnImpactedByPlane_Client
struct AAthenaGoosePickup_OnImpactedByPlane_Client_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnFalling_Server
struct AAthenaGoosePickup_OnFalling_Server_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnFalling_Client
struct AAthenaGoosePickup_OnFalling_Client_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnDeployed_Server
struct AAthenaGoosePickup_OnDeployed_Server_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnDeployed_Client
struct AAthenaGoosePickup_OnDeployed_Client_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaGoosePickup.OnCollide
struct AAthenaGoosePickup_OnCollide_Params
{
public:
	class AActor*                                CollidingActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.DeployTimerUp_Server
struct AAthenaGoosePickup_DeployTimerUp_Server_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaGoosePickup.DeployTimerUp_Client
struct AAthenaGoosePickup_DeployTimerUp_Client_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AthenaLayoutRequirementData.SpawnMatchingLayoutRequirement
struct UAthenaLayoutRequirementData_SpawnMatchingLayoutRequirement_Params
{
public:
	class ABuildingSMActor*                      SourceActor;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMatchResourceType;                                // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1240[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABuildingLayoutRequirement*            ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AthenaLayoutRequirementData.FindMatchingLayoutRequirementClass
struct UAthenaLayoutRequirementData_FindMatchingLayoutRequirementClass_Params
{
public:
	class ABuildingSMActor*                      BuildingActor;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ABuildingSMActor>          MatchingClass;                                     // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1241[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.SetMarkerWidgetClass
struct UAthenaMarkerComponent_SetMarkerWidgetClass_Params
{
public:
	TSubclassOf<class UUserWidget>               InMarkerClass;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.SetMarkerActorClass
struct UAthenaMarkerComponent_SetMarkerActorClass_Params
{
public:
	TSubclassOf<class AFortPlayerMarkerBase>     InMarkerActorClass;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AthenaMarkerComponent.ServerRemoveMapMarker
struct UAthenaMarkerComponent_ServerRemoveMapMarker_Params
{
public:
	struct FMarkerID                             MarkerID;                                          // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECancelMarkerReason               CancelReason;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.ServerAddMapMarker
struct UAthenaMarkerComponent_ServerAddMapMarker_Params
{
public:
	struct FFortClientMarkerRequest              MarkerRequest;                                     // 0x0(0x38)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.OnRep_ReplayMarkers
struct UAthenaMarkerComponent_OnRep_ReplayMarkers_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.ClientCancelMarker
struct UAthenaMarkerComponent_ClientCancelMarker_Params
{
public:
	struct FMarkerID                             MarkerID;                                          // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// Function FortniteGame.AthenaMarkerComponent.ClientAddMarker
struct UAthenaMarkerComponent_ClientAddMarker_Params
{
public:
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x0(0x100)(Parm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaMusicPackItemDefinition.GetCoverArt
struct UAthenaMusicPackItemDefinition_GetCoverArt_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaNavInvokerBox.SetInvokerEnabled
struct AAthenaNavInvokerBox_SetInvokerEnabled_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortNavSystem.OnNavDataRegistered
struct UFortNavSystem_OnNavDataRegistered_Params
{
public:
	class ANavigationData*                       NavData;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortNavSystem.IsNavmeshInRadiusInitialized
struct UFortNavSystem_IsNavmeshInRadiusInitialized_Params
{
public:
	class UObject*                               WorldContext;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TestLocation;                                      // 0x8(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TestRadius;                                        // 0x14(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_124A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaNavSystem.UnregisterNavGenerationObserver
struct UAthenaNavSystem_UnregisterNavGenerationObserver_Params
{
public:
	class USceneComponent*                       Component;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AthenaNavSystem.RegisterNavGenerationObserver
struct UAthenaNavSystem_RegisterNavGenerationObserver_Params
{
public:
	class USceneComponent*                       Component;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UDelegateProperty_                           Event;                                             // 0x8(0x10)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaNavSystemConfigOverride.LoadPreviewLevels
struct AAthenaNavSystemConfigOverride_LoadPreviewLevels_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaPetItemDefinition.GetPetPrefabClass
struct UAthenaPetItemDefinition_GetPetPrefabClass_Params
{
public:
	TSubclassOf<class AFortPlayerPet>            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaSeasonStats.GetSeasonDefintion
struct UAthenaSeasonStats_GetSeasonDefintion_Params
{
public:
	class UAthenaSeasonItemDefinition*           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaPlayerMatchReport.GetXpRewards
struct UAthenaPlayerMatchReport_GetXpRewards_Params
{
public:
	TArray<struct FAthenaMatchXpReward>          XpRewards;                                         // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaPlayerMatchReport.GetTotalSeasonalXpEarned
struct UAthenaPlayerMatchReport_GetTotalSeasonalXpEarned_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaPlayerMatchReport.GetTotalScoreEarned
struct UAthenaPlayerMatchReport_GetTotalScoreEarned_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AthenaPlayerMatchReport.GetTotalBookXpEarned
struct UAthenaPlayerMatchReport_GetTotalBookXpEarned_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaPlayerMatchReport.GetLootRewards
struct UAthenaPlayerMatchReport_GetLootRewards_Params
{
public:
	TArray<struct FAthenaMatchLootReward>        LootRewards;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteGame.AthenaPlayerMatchReport.DataAvailableEvent__DelegateSignature
struct UAthenaPlayerMatchReport_DataAvailableEvent__DelegateSignature_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaResurrectionComponent.ServerOnInterruptResurrectionInteraction
struct UAthenaResurrectionComponent_ServerOnInterruptResurrectionInteraction_Params
{
public:
	class ABuildingGameplayActorSpawnMachine*    SpawnMachine;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaResurrectionComponent.ServerOnBeginResurrectionInteraction
struct UAthenaResurrectionComponent_ServerOnBeginResurrectionInteraction_Params
{
public:
	class ABuildingGameplayActorSpawnMachine*    SpawnMachine;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaResurrectionComponent.OnRep_PlayerIdsForResurrection
struct UAthenaResurrectionComponent_OnRep_PlayerIdsForResurrection_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortEventItemDefinitionBase.CreateCalendarPayload
struct UFortEventItemDefinitionBase_CreateCalendarPayload_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AthenaSpectatorPlayerListRowData.SetKills
struct UAthenaSpectatorPlayerListRowData_SetKills_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKills;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AthenaSpectatorPlayerListRowData.GetPlayerState
struct UAthenaSpectatorPlayerListRowData_GetPlayerState_Params
{
public:
	class AFortPlayerStateAthena*                ReturnValue;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AthenaSprayItemDefinition.ShouldUseBannerAsTexture
struct UAthenaSprayItemDefinition_ShouldUseBannerAsTexture_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaSprayItemDefinition.GetDecalTexture
struct UAthenaSprayItemDefinition_GetDecalTexture_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaSprayItemDefinition.GetDecalMaterial
struct UAthenaSprayItemDefinition_GetDecalMaterial_Params
{
public:
	TSoftObjectPtr<class UMaterialInterface>     ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.AthenaToyItemDefinition.GetToyActorClass
struct UAthenaToyItemDefinition_GetToyActorClass_Params
{
public:
	TSoftClassPtr<class AActor>                  ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AthenaToyItemDefinition.BakeLaunchPositions
struct UAthenaToyItemDefinition_BakeLaunchPositions_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.TimeOfDayController_BlueprintBase.SetSunOrMoonScale
struct ATimeOfDayController_BlueprintBase_SetSunOrMoonScale_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.TimeOfDayController_BlueprintBase.SetPostProcessSettings
struct ATimeOfDayController_BlueprintBase_SetPostProcessSettings_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.HoverDronePawn.IsMaintainingConstantAltitude
struct AHoverDronePawn_IsMaintainingConstantAltitude_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.HoverDronePawn.GetAltitude
struct AHoverDronePawn_GetAltitude_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.StopRecordingFTestPerf
struct UAutomationPerfMonitorManager_StopRecordingFTestPerf_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.StartRecordingFTestPerf
struct UAutomationPerfMonitorManager_StartRecordingFTestPerf_Params
{
public:
	TArray<class FString>                        StatsToRecord;                                     // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.IsRecordingFTestPerf
struct UAutomationPerfMonitorManager_IsRecordingFTestPerf_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.GetStatAverage
struct UAutomationPerfMonitorManager_GetStatAverage_Params
{
public:
	class FString                                StatName;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_127A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.GetPerfMonitorInstance
struct UAutomationPerfMonitorManager_GetPerfMonitorInstance_Params
{
public:
	class UAutomationPerfMonitorManager*         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.WillRegisterWithStructuralGrid
struct ABuildingSMActor_WillRegisterWithStructuralGrid_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateRepairMaterialAnim
struct ABuildingSMActor_UpdateRepairMaterialAnim_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateLODOverrideEffect
struct ABuildingSMActor_UpdateLODOverrideEffect_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateDynamicShrinkAndDestroyEffect
struct ABuildingSMActor_UpdateDynamicShrinkAndDestroyEffect_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateComponentCollisionModes
struct ABuildingSMActor_UpdateComponentCollisionModes_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.BuildingSMActor.TransferFromDuplicationData
struct ABuildingSMActor_TransferFromDuplicationData_Params
{
public:
	struct FBuildingDuplicationData              SourceData;                                        // 0x0(0x28)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.TransferBuildingData
struct ABuildingSMActor_TransferBuildingData_Params
{
public:
	class ABuildingSMActor*                      SourceDataActor;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x24 (0x24 - 0x0)
// Function FortniteGame.BuildingSMActor.StartBounceAnimation
struct ABuildingSMActor_StartBounceAnimation_Params
{
public:
	float                                        StartTime;                                         // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Normal;                                            // 0x8(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Center;                                            // 0x14(0xC)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBounceType                   InBounceType;                                      // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLocalInstigator;                                  // 0x21(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1285[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.SetTextureData
struct ABuildingSMActor_SetTextureData_Params
{
public:
	TArray<class UTexture2D*>                    InTextures;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.SetMirrored
struct ABuildingSMActor_SetMirrored_Params
{
public:
	bool                                         bIsMirrored;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.RepairBuilding
struct ABuildingSMActor_RepairBuilding_Params
{
public:
	class AFortPlayerController*                 RepairingController;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourcesSpent;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1286[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.ReadTextureData
struct ABuildingSMActor_ReadTextureData_Params
{
public:
	TArray<class UTexture2D*>                    ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.PreForceMove
struct ABuildingSMActor_PreForceMove_Params
{
public:
	class AController*                           EventInstigator;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.PostForceMove
struct ABuildingSMActor_PostForceMove_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRepairStarted
struct ABuildingSMActor_OnRepairStarted_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ResourceType
struct ABuildingSMActor_OnRep_ResourceType_Params
{
public:
	enum class EFortResourceType                 OldType;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ReplicationProxy
struct ABuildingSMActor_OnRep_ReplicationProxy_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ReplicatedDrawScale3D
struct ABuildingSMActor_OnRep_ReplicatedDrawScale3D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_RelevantBASE
struct ABuildingSMActor_OnRep_RelevantBASE_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ProxyGameplayCueDamagePhysical
struct ABuildingSMActor_OnRep_ProxyGameplayCueDamagePhysical_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_NoCollision
struct ABuildingSMActor_OnRep_NoCollision_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_NoCameraCollision
struct ABuildingSMActor_OnRep_NoCameraCollision_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_MetaData
struct ABuildingSMActor_OnRep_MetaData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_HiddenDueToTrapPlacement
struct ABuildingSMActor_OnRep_HiddenDueToTrapPlacement_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_EditingPlayer
struct ABuildingSMActor_OnRep_EditingPlayer_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_bUnderRepair
struct ABuildingSMActor_OnRep_bUnderRepair_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_bUnderConstruction
struct ABuildingSMActor_OnRep_bUnderConstruction_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_BuildingAnimation
struct ABuildingSMActor_OnRep_BuildingAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnLODOverrideEffectFinished
struct ABuildingSMActor_OnLODOverrideEffectFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnDynamicShrinkAndDestroyEffectFinished
struct ABuildingSMActor_OnDynamicShrinkAndDestroyEffectFinished_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.OnDetachFromBuilding
struct ABuildingSMActor_OnDetachFromBuilding_Params
{
public:
	class ABuildingSMActor*                      AttachedToBuilding;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBeingDestroyed;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1287[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingSMActor.OnBounceAnimationUpdate
struct ABuildingSMActor_OnBounceAnimationUpdate_Params
{
public:
	struct FFortBounceData                       Data;                                              // 0x0(0x30)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.OnAttachToBuilding
struct ABuildingSMActor_OnAttachToBuilding_Params
{
public:
	class ABuildingSMActor*                      AttachedToBuilding;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCuesExecuted_WithParams
struct ABuildingSMActor_NetMulticast_InvokeGameplayCuesExecuted_WithParams_Params
{
public:
	struct FGameplayTagContainer                 GameplayCueTags;                                   // 0x0(0x20)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x20(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x38(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCuesExecuted
struct ABuildingSMActor_NetMulticast_InvokeGameplayCuesExecuted_Params
{
public:
	struct FGameplayTagContainer                 GameplayCueTags;                                   // 0x0(0x20)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x20(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0x38(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCuesAddedAndWhileActive_WithParams
struct ABuildingSMActor_NetMulticast_InvokeGameplayCuesAddedAndWhileActive_WithParams_Params
{
public:
	struct FGameplayTagContainer                 GameplayCueTags;                                   // 0x0(0x20)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x20(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x38(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueExecuted_WithParams
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueExecuted_WithParams_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x8(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x20(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueExecuted_FromSpec
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueExecuted_FromSpec_Params
{
public:
	struct FGameplayEffectSpecForRPC             Spec;                                              // 0x0(0x78)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x78(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueExecuted
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueExecuted_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x8(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0x20(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueAddedAndWhileActive_WithParams
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueAddedAndWhileActive_WithParams_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x8(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x20(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueAddedAndWhileActive_FromSpec_Params
{
public:
	struct FGameplayEffectSpecForRPC             Spec;                                              // 0x0(0x78)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x78(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueAdded_WithParams
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueAdded_WithParams_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x8(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                Parameters;                                        // 0x20(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteGame.BuildingSMActor.NetMulticast_InvokeGameplayCueAdded
struct ABuildingSMActor_NetMulticast_InvokeGameplayCueAdded_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                        PredictionKey;                                     // 0x8(0x18)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0x20(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.MulticastPlayFullHealthEffects
struct ABuildingSMActor_MulticastPlayFullHealthEffects_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.MarkConnectedBuildingsForStructuralIntegrityCheck
struct ABuildingSMActor_MarkConnectedBuildingsForStructuralIntegrityCheck_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.IsUnderConstruction
struct ABuildingSMActor_IsUnderConstruction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.IsSupportedByWorld
struct ABuildingSMActor_IsSupportedByWorld_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.IsStructurallySupported
struct ABuildingSMActor_IsStructurallySupported_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.HasDestructionLoot
struct ABuildingSMActor_HasDestructionLoot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetWindSpeedCurveForPreview
struct ABuildingSMActor_GetWindSpeedCurveForPreview_Params
{
public:
	class UCurveLinearColor*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetWindPannerSpeedCurveForPreview
struct ABuildingSMActor_GetWindPannerSpeedCurveForPreview_Params
{
public:
	class UCurveLinearColor*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.GetReplacementDestructionReason
struct ABuildingSMActor_GetReplacementDestructionReason_Params
{
public:
	enum class EBuildingReplacementType          ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingSMActor.GetOverrideMeshMaterial
struct ABuildingSMActor_GetOverrideMeshMaterial_Params
{
public:
	class UStaticMeshComponent*                  MeshComp;                                          // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MatIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1288[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.GetLogicalBuildingIndex
struct ABuildingSMActor_GetLogicalBuildingIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingSMActor.GetIntenseWindMaterialsForPreview
struct ABuildingSMActor_GetIntenseWindMaterialsForPreview_Params
{
public:
	TArray<class UMaterialInterface*>            Materials;                                         // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1289[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.BuildingSMActor.GetDuplicationData
struct ABuildingSMActor_GetDuplicationData_Params
{
public:
	struct FBuildingDuplicationData              ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.GetBuildingTextureData
struct ABuildingSMActor_GetBuildingTextureData_Params
{
public:
	TArray<class UBuildingTextureData*>          OutTextureDataArray;                               // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetBuildingMeshComponent
struct ABuildingSMActor_GetBuildingMeshComponent_Params
{
public:
	class UStaticMeshComponent*                  ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.GetAttachedBuildingActors
struct ABuildingSMActor_GetAttachedBuildingActors_Params
{
public:
	TArray<class ABuildingSMActor*>              ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.GetAnimatingMID
struct ABuildingSMActor_GetAnimatingMID_Params
{
public:
	int32                                        ElementIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingSMActor.GameplayCue_Abilities_Activation_Generic_BannerWallBuff2
struct ABuildingSMActor_GameplayCue_Abilities_Activation_Generic_BannerWallBuff2_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingSMActor.GameplayCue_Abilities_Activation_Generic_BannerWallBuff1
struct ABuildingSMActor_GameplayCue_Abilities_Activation_Generic_BannerWallBuff1_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.ForceIntoStructuralGridDuringRuntime
struct ABuildingSMActor_ForceIntoStructuralGridDuringRuntime_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialVectorParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialVectorParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          Value;                                             // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialTextureParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialTextureParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              Value;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialScalarParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialScalarParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialVectorParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialVectorParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialTextureParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialTextureParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialScalarParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialScalarParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.DetachBuildingActorFromMe
struct ABuildingSMActor_DetachBuildingActorFromMe_Params
{
public:
	class ABuildingSMActor*                      ActorToAttach;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBeingDestroyed;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.ClearRequestedBuildingAnimation
struct ABuildingSMActor_ClearRequestedBuildingAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.BlueprintOnStructurallyUnstable
struct ABuildingSMActor_BlueprintOnStructurallyUnstable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.BlueprintOnStructurallyStable
struct ABuildingSMActor_BlueprintOnStructurallyStable_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.AttachBuildingActorToMe
struct ABuildingSMActor_AttachBuildingActorToMe_Params
{
public:
	class ABuildingSMActor*                      ActorToAttach;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceAttachment;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.AddToGrid
struct ABuildingSMActor_AddToGrid_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.SetActivatedState
struct ABuildingCapturePointActor_SetActivatedState_Params
{
public:
	bool                                         bInActivated;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_ReplicatedCapturePercentage
struct ABuildingCapturePointActor_OnRep_ReplicatedCapturePercentage_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_CaptureState
struct ABuildingCapturePointActor_OnRep_CaptureState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_bLocked
struct ABuildingCapturePointActor_OnRep_bLocked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_bActivated
struct ABuildingCapturePointActor_OnRep_bActivated_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnLeaveCapturePoint
struct ABuildingCapturePointActor_OnLeaveCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnEnterCapturePoint
struct ABuildingCapturePointActor_OnEnterCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointStateChange
struct ABuildingCapturePointActor_OnCapturePointStateChange_Params
{
public:
	enum class ECaptureState                     InState;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InTeam;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointLockStateChange
struct ABuildingCapturePointActor_OnCapturePointLockStateChange_Params
{
public:
	bool                                         bInLocked;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointActiveStateChange
struct ABuildingCapturePointActor_OnCapturePointActiveStateChange_Params
{
public:
	bool                                         bInActive;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.GetCaptureState
struct ABuildingCapturePointActor_GetCaptureState_Params
{
public:
	enum class ECaptureState                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.OnRep_Connections
struct UBuildingConnectivityComponent_OnRep_Connections_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.OnRep_bIsProvidingPower
struct UBuildingConnectivityComponent_OnRep_bIsProvidingPower_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.OnRep_bIsPowered
struct UBuildingConnectivityComponent_OnRep_bIsPowered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.OnPlaced
struct UBuildingConnectivityComponent_OnPlaced_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.K2_IsPowered
struct UBuildingConnectivityComponent_K2_IsPowered_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.IsConnectedTo
struct UBuildingConnectivityComponent_IsConnectedTo_Params
{
public:
	class ABuildingSMActor*                      TestActor;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12AA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.DrawDebugData
struct UBuildingConnectivityComponent_DrawDebugData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.DisconnectAll
struct UBuildingConnectivityComponent_DisconnectAll_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingConnectivityComponent.CanConnectTo
struct UBuildingConnectivityComponent_CanConnectTo_Params
{
public:
	class ABuildingSMActor*                      TestActor;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12AB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingConnectivityEffect.OnDisconnect
struct ABuildingConnectivityEffect_OnDisconnect_Params
{
public:
};

// 0x60 (0x60 - 0x0)
// Function FortniteGame.BuildingConnectivityEffect.OnConnect
struct ABuildingConnectivityEffect_OnConnect_Params
{
public:
	struct FTransform                            T1;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            T2;                                                // 0x30(0x30)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingTimeOfDayLights.GetTimeOfDayBlueprintDefaultVariables
struct ABuildingTimeOfDayLights_GetTimeOfDayBlueprintDefaultVariables_Params
{
public:
	struct FTimeOfDayBlueprintDefaultVariables   OutVariables;                                      // 0x0(0x10)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.RaiseTreasure
struct ABuildingContainer_RaiseTreasure_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnSetSearched
struct ABuildingContainer_OnSetSearched_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnSearchInterrupted
struct ABuildingContainer_OnSearchInterrupted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnRep_bAlreadySearched
struct ABuildingContainer_OnRep_bAlreadySearched_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnRaiseTreasure
struct ABuildingContainer_OnRaiseTreasure_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLootReset
struct ABuildingContainer_OnLootReset_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLootRepeat
struct ABuildingContainer_OnLootRepeat_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLoot
struct ABuildingContainer_OnLoot_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnBeginSearch
struct ABuildingContainer_OnBeginSearch_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingContainer.GetLootTier
struct ABuildingContainer_GetLootTier_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.EnableBacchusHighlight
struct ABuildingContainer_EnableBacchusHighlight_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.DisableBacchusHighlight
struct ABuildingContainer_DisableBacchusHighlight_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.BounceContainer
struct ABuildingContainer_BounceContainer_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingEditModeSupport.OnSuccessfulMatchInteractParamUpdate
struct UBuildingEditModeSupport_OnSuccessfulMatchInteractParamUpdate_Params
{
public:
	float                                        NewInteractParamVal;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingEditModeSupport.OnSuccessfulMatchInteractComplete
struct UBuildingEditModeSupport_OnSuccessfulMatchInteractComplete_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.SpawnCarriedObject
struct ABuildingFlagSpawn_SpawnCarriedObject_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.OnCarriedObjectDetachedEvent
struct ABuildingFlagSpawn_OnCarriedObjectDetachedEvent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.OnCarriedObjectAttachedEvent
struct ABuildingFlagSpawn_OnCarriedObjectAttachedEvent_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.IsSpawnedObjectAwayFromBase
struct ABuildingFlagSpawn_IsSpawnedObjectAwayFromBase_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFloor.IsBalcony
struct ABuildingFloor_IsBalcony_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.ReloadFOB
struct ABuildingFOBConfigActor_ReloadFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnRep_FOBMode
struct ABuildingFOBConfigActor_OnRep_FOBMode_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnRep_bFinalized
struct ABuildingFOBConfigActor_OnRep_bFinalized_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnIOOperationCompleteMulticast
struct ABuildingFOBConfigActor_OnIOOperationCompleteMulticast_Params
{
public:
	enum class EFOBIOStatus                      IOOperation;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuccess;                                          // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C1[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortFOBCoreDecoItemDefinition*        SelectedCoreDef;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFOBModeSet
struct ABuildingFOBConfigActor_OnFOBModeSet_Params
{
public:
	enum class EFOBMode                          ModeThatWasSet;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalized
struct ABuildingFOBConfigActor_OnFinalized_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalizationPlayFX
struct ABuildingFOBConfigActor_OnFinalizationPlayFX_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalizationFXMulticast
struct ABuildingFOBConfigActor_OnFinalizationFXMulticast_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnCoreInitialized
struct ABuildingFOBConfigActor_OnCoreInitialized_Params
{
public:
	class ABuildingFOBCoreActor*                 InitializedCore;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsPlayerControllerFOBOwner
struct ABuildingFOBConfigActor_IsPlayerControllerFOBOwner_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsInitialized
struct ABuildingFOBConfigActor_IsInitialized_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsFinalized
struct ABuildingFOBConfigActor_IsFinalized_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsBuildingActorWithinFOB
struct ABuildingFOBConfigActor_IsBuildingActorWithinFOB_Params
{
public:
	class ABuildingActor*                        ActorToCheck;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetSelectedFOBCoreItemDefinition
struct ABuildingFOBConfigActor_GetSelectedFOBCoreItemDefinition_Params
{
public:
	class UFortFOBCoreDecoItemDefinition*        ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetFOBMode
struct ABuildingFOBConfigActor_GetFOBMode_Params
{
public:
	enum class EFOBMode                          ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetAllCoreChoices
struct ABuildingFOBConfigActor_GetAllCoreChoices_Params
{
public:
	TArray<struct FFOBCoreChoice>                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanSaveFOB
struct ABuildingFOBConfigActor_CanSaveFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanReloadFOB
struct ABuildingFOBConfigActor_CanReloadFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanPerformIOOperation
struct ABuildingFOBConfigActor_CanPerformIOOperation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.AttemptSelectFOBCore
struct ABuildingFOBConfigActor_AttemptSelectFOBCore_Params
{
public:
	class UFortFOBCoreDecoItemDefinition*        DefToSelect;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnVulnerableStatusChanged
struct ABuildingFOBCoreActor_OnVulnerableStatusChanged_Params
{
public:
	bool                                         bNewTargetableStatus;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnTargetableStatusChanged
struct ABuildingFOBCoreActor_OnTargetableStatusChanged_Params
{
public:
	bool                                         bNewTargetableStatus;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bVulnerable
struct ABuildingFOBCoreActor_OnRep_bVulnerable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bTargetable
struct ABuildingFOBCoreActor_OnRep_bTargetable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bActive
struct ABuildingFOBCoreActor_OnRep_bActive_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnActiveStatusChanged
struct ABuildingFOBCoreActor_OnActiveStatusChanged_Params
{
public:
	bool                                         bNewActiveStatus;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.MarkVulnerable
struct ABuildingFOBCoreActor_MarkVulnerable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.MarkTargetable
struct ABuildingFOBCoreActor_MarkTargetable_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.IsActorWithinFOBBounds
struct ABuildingFOBCoreActor_IsActorWithinFOBBounds_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.IsActive
struct ABuildingFOBCoreActor_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.GetSimpleDeathFXTransform
struct ABuildingFOBCoreActor_GetSimpleDeathFXTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.GetFOBBoundsCenterAndExtents
struct ABuildingFOBCoreActor_GetFOBBoundsCenterAndExtents_Params
{
public:
	struct FVector                               OutCenter;                                         // 0x0(0xC)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               OutExtents;                                        // 0xC(0xC)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
