#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
struct UFortHUDElementWidget_OnVisibilitySetEvent_Params
{
public:
	enum class ESlateVisibility                  InVisibility;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleOnHUDResetToDefaults
struct UFortHUDElementWidget_HandleOnHUDResetToDefaults_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
struct UFortHUDElementWidget_HandleOnHUDElementVisibilityChanged_Params
{
public:
	struct FGameplayTagContainer                 HiddenHUDElementTags;                              // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged
struct ULTMWidgetBase_OnHandleSpectatingChanged_Params
{
public:
	class AFortPlayerStateZone*                  SpectatingTarget;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AshtonWidgetBase.UpdateAllUI
struct UAshtonWidgetBase_UpdateAllUI_Params
{
public:
	bool                                         bFirstUpdate;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnsRemainingChanged
struct UAshtonWidgetBase_OnVillainRespawnsRemainingChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged
struct UAshtonWidgetBase_OnVillainRespawnCountChanged_Params
{
public:
	int32                                        NumRespawnsLeft;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RespawnPercentLeft;                                // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnStoneListChanged
struct UAshtonWidgetBase_OnStoneListChanged_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnStoneChanged
struct UAshtonWidgetBase_OnStoneChanged_Params
{
public:
	enum class EAshtonStoneType                  StoneType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAshtonStoneStateType             StoneState;                                        // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnOpenWidget
struct UAshtonWidgetBase_OnOpenWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnCloseWidget
struct UAshtonWidgetBase_OnCloseWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.OnAllSurveysFinishedDelegate__DelegateSignature
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_OnAllSurveysFinishedDelegate__DelegateSignature_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.HandleAllSurveysFinished
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished_Params
{
public:
	class UObject*                               Source;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.DisplaySurveys
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys_Params
{
public:
	class UFortPlayerSurveyDispatcher*           Dispatcher;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurveyCount;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F80[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
struct UAthenaAccountContext_SimulateBattleBookPurchase_Params
{
public:
	int32                                        NumLevelsToPurchase;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusLevelsGranted;                                // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverLimit;                                        // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F82[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
struct UAthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
struct UAthenaAccountContext_IsAtMaxBattlePassTier_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
struct UAthenaAccountContext_GetCurrentSeasonNumber_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
struct UAthenaAccountContext_GetCurrentSeasonName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
struct UAthenaAccountContext_GetCurrentSeasonDefinition_Params
{
public:
	class UAthenaSeasonItemDefinition*           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
struct UAthenaAccountContext_GetBattleBookPurchaseLimit_Params
{
public:
	int32                                        MaxNumLevelsPossibleToPurchase;                    // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusLevelsGranted;                                // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
struct UAthenaAIKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
struct UAthenaAIKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class AFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
struct UAthenaAwardAlertBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
struct UAthenaAwardAlertBase_OnAwardGranted_Params
{
public:
	class UFortAwardItemDefinition*              AwardDefinition;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
struct UFortActivatablePanel_RestoreScrollWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
struct UFortActivatablePanel_RestoreCenterWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventScreenBase.OnSquadDataAdded
struct UAthenaEventScreenBase_OnSquadDataAdded_Params
{
public:
	class UAthenaRemoteSquadViewData*            InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventScreenBase.OnPlayerDataAdded
struct UAthenaEventScreenBase_OnPlayerDataAdded_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastAllPlayersGridBase.OnPlayerDataAdded_BP
struct UAthenaBroadcastAllPlayersGridBase_OnPlayerDataAdded_BP_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnVehicleStateChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnVehicleStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    NewVehicle;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    OldVehicle;                                        // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnPipModeChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnPipModeChanged_Params
{
public:
	bool                                         bPipModeEnabled;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnFollowedPlayerDataChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnFollowedPlayerDataChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InFollowedPlayerData;                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnFollowedPlayerChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatingPC;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      FollowedPlayerState;                               // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnEliminatedStateChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnEliminatedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEliminated;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F85[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.SetFrontEndVisibility
struct UFortUIStateWidget_NUI_SetFrontEndVisibility_Params
{
public:
	bool                                         bHideHeader;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideFooter;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideChatWidget;                                   // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.RequestOpenSocialMenu
struct UFortUIStateWidget_NUI_RequestOpenSocialMenu_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetInternal
struct UFortUIStateWidget_NUI_PushContentWidgetInternal_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContentPushState                     State;                                             // 0x8(0x3)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F87[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetAdvanced
struct UFortUIStateWidget_NUI_PushContentWidgetAdvanced_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideHeader;                                       // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideFooter;                                       // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideChatWidget;                                   // 0xA(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F88[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidget
struct UFortUIStateWidget_NUI_PushContentWidget_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidgetInternal
struct UFortUIStateWidget_NUI_PopContentWidgetInternal_Params
{
public:
	struct FContentPushState                     State;                                             // 0x0(0x3)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F89[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidget
struct UFortUIStateWidget_NUI_PopContentWidget_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.PopAllContentWidgets
struct UFortUIStateWidget_NUI_PopAllContentWidgets_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.OnLoadingScreenVisibilityChanged
struct UFortUIStateWidget_NUI_OnLoadingScreenVisibilityChanged_Params
{
public:
	bool                                         IsVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.OnHUDScaleChanged
struct UFortUIStateWidget_NUI_OnHUDScaleChanged_Params
{
public:
	float                                        HUDScale;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.OnFrontEndVisibilityUpdated
struct UFortUIStateWidget_NUI_OnFrontEndVisibilityUpdated_Params
{
public:
	bool                                         bHideHeader;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideFooter;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideChatWidget;                                   // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.OnExitState
struct UFortUIStateWidget_NUI_OnExitState_Params
{
public:
	enum class EFortUIState                      NextUIState;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.OnEnterState
struct UFortUIStateWidget_NUI_OnEnterState_Params
{
public:
	enum class EFortUIState                      PreviousUIState;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortUIStateWidget_NUI.DynamicHandleLoadingScreenVisibilityChanged
struct UFortUIStateWidget_NUI_DynamicHandleLoadingScreenVisibilityChanged_Params
{
public:
	bool                                         IsVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.ViewModelChanged
struct UAthenaHUDBase_ViewModelChanged_Params
{
public:
	class UAthenaPlayerViewModel*                ViewModel;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.UpdateUIExtensions
struct UAthenaHUDBase_UpdateUIExtensions_Params
{
public:
	class AFortPlayerState*                      ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortMinigame*                         Minigame;                                          // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetQuickBarNative
struct UAthenaHUDBase_SetQuickBarNative_Params
{
public:
	bool                                         bShouldDoQuickBarNative;                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetFullScreenMapVisibility
struct UAthenaHUDBase_SetFullScreenMapVisibility_Params
{
public:
	bool                                         bIsVisible;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnPlaylistExtensionWidgetCreated
struct UAthenaHUDBase_OnPlaylistExtensionWidgetCreated_Params
{
public:
	enum class EPlaylistUIExtensionSlot          ExtensionSlot;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           Widget;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnMinigameHideHUD
struct UAthenaHUDBase_OnMinigameHideHUD_Params
{
public:
	bool                                         bLoading;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeUnloaded
struct UAthenaHUDBase_HandleVolumeUnloaded_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeStateChanged
struct UAthenaHUDBase_HandleVolumeStateChanged_Params
{
public:
	enum class EVolumeState                      NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeLoaded
struct UAthenaHUDBase_HandleVolumeLoaded_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions
struct UAthenaHUDBase_HandleUpdateMinigameUIExtensions_Params
{
public:
	class AFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleExitVolume
struct UAthenaHUDBase_HandleExitVolume_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleEnteredVolume
struct UAthenaHUDBase_HandleEnteredVolume_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging
struct UAthenaHUDBase_HandleCursorModeChanging_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.ClearUIExtensions
struct UAthenaHUDBase_ClearUIExtensions_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.BindVolumeEvents
struct UAthenaHUDBase_BindVolumeEvents_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnUnableToPerformAction
struct UAthenaSpectatorHUDBase_OnUnableToPerformAction_Params
{
public:
	struct FGameplayTagContainer                 FailedReason;                                      // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	class FText                                  FailureText;                                       // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnSpectatorViewTargetChanged
struct UAthenaSpectatorHUDBase_OnSpectatorViewTargetChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnPlayerTargetingChanged
struct UAthenaSpectatorHUDBase_OnPlayerTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnNameplatesEnabledChanged
struct UAthenaSpectatorHUDBase_OnNameplatesEnabledChanged_Params
{
public:
	bool                                         bInNameplatesEnabled;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnIndicatorModeChanged
struct UAthenaSpectatorHUDBase_OnIndicatorModeChanged_Params
{
public:
	bool                                         bIndicatorsEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDBase.OnCursorModeChanged
struct UAthenaSpectatorHUDBase_OnCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F90[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           CursorModeContentWidget;                           // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleSquadStatusActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleSquadStatusActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleScoreboardScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleScoreboardScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleRemainingPlayersActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleRemainingPlayersActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnTogglePipModeActionExecuted
struct UAthenaBroadcastHUDBase_OnTogglePipModeActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleMatchStatusScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleMatchStatusActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleKillFeedActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleKillFeedActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleGoToTimeScreen
struct UAthenaBroadcastHUDBase_OnToggleGoToTimeScreen_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleFollowedPlayerInfoActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleFollowedPlayerInfoActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleEliminatedGridScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleEliminatedGridScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleAllPlayersGridActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleAllPlayersGridActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleActiveGridScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleActiveGridScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleActionFeedScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleActionFeedScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnPlaylistDataChanged
struct UAthenaBroadcastHUDBase_OnPlaylistDataChanged_Params
{
public:
	class UFortPlaylistAthena*                   PlaylistData;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnNewGameState
struct UAthenaBroadcastHUDBase_OnNewGameState_Params
{
public:
	class AFortGameState*                        NewGameState;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet
struct UAthenaBroadcastHUDBase_OnGameStateSet_Params
{
public:
	class AFortGameState*                        NewGameState;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnCurrentPlaylistChanged
struct UAthenaBroadcastHUDBase_OnCurrentPlaylistChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.MapActivated
struct UAthenaBroadcastHUDMenuStatusBase_MapActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.InventoryActivated
struct UAthenaBroadcastHUDMenuStatusBase_InventoryActivated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.RemoveHUDMenuStatus
struct UAthenaBroadcastHUDMenuStatusLayerBase_RemoveHUDMenuStatus_Params
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*     HUDMenuStatusWidget;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.DeactivateHudMenuWidget
struct UAthenaBroadcastHUDMenuStatusLayerBase_DeactivateHudMenuWidget_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.AddHUDMenuStatus
struct UAthenaBroadcastHUDMenuStatusLayerBase_AddHUDMenuStatus_Params
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*     HUDMenuStatusWidget;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.OnToggleShowKillFeed
struct UAthenaBroadcastKillFeedBase_OnToggleShowKillFeed_Params
{
public:
	bool                                         bShowKillFeed;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.OnTimelineScrubbed
struct UAthenaBroadcastKillFeedBase_OnTimelineScrubbed_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.AddKillFeedEntry
struct UAthenaBroadcastKillFeedBase_AddKillFeedEntry_Params
{
public:
	struct FAthenaBroadcastKillFeedEntryInfo     KillFeedEntryInfo;                                 // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedItemBase.SetKillFeedInfo
struct UAthenaBroadcastKillFeedItemBase_SetKillFeedInfo_Params
{
public:
	struct FAthenaBroadcastKillFeedEntryInfo     KillFeedEntryInfo;                                 // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastMapPanelBase.OnMapIconAdded
struct UAthenaBroadcastMapPanelBase_OnMapIconAdded_Params
{
public:
	class UFortSpectateClickableMapIcon*         MapIconIn;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBroadcastMatchStatusWidget.OnStormPhaseChanged
struct UAthenaBroadcastMatchStatusWidget_OnStormPhaseChanged_Params
{
public:
	int32                                        StormPhase;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBroadcastPlayerEventScoreWidget.OnRemoteClientEventScoreChanged
struct UAthenaBroadcastPlayerEventScoreWidget_OnRemoteClientEventScoreChanged_Params
{
public:
	int32                                        NewEventScore;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaBroadcastPlayerLocationWidget.OnRemoteClientPoiTagIDChanged
struct UAthenaBroadcastPlayerLocationWidget_OnRemoteClientPoiTagIDChanged_Params
{
public:
	int16                                        RemoteClientPoiTagID;                              // 0x0(0x2)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.SetStormcapDamageVisible
struct UAthenaEventMatchSquadWidgetBase_SetStormcapDamageVisible_Params
{
public:
	bool                                         InVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.SetSquadIdVisible
struct UAthenaEventMatchSquadWidgetBase_SetSquadIdVisible_Params
{
public:
	bool                                         bSquadIdVisible;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadPlaceChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadPlaceChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InSquadPlace;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F98[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadKillscoreChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadKillscoreChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InSquadKills;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F99[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadIdChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadIdChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InSquadId;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F9A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadColorChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadColorChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          InSquadColor;                                      // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnPlayerAdded
struct UAthenaEventMatchSquadWidgetBase_OnPlayerAdded_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnPipModeChanged
struct UAthenaBroadcastSquadStatusWidget_OnPipModeChanged_Params
{
public:
	bool                                         bPipModeEnabled;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnFollowedPlayerChanged
struct UAthenaBroadcastSquadStatusWidget_OnFollowedPlayerChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleFollowedPlayerChanged
struct UAthenaBroadcastSquadStatusWidget_HandleFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorController;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      NewFollowedPlayer;                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.GetChallengeStyleLightAccentColor
struct UAthenaChallengeDisplayLibrary_GetChallengeStyleLightAccentColor_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                          ReturnValue;                                       // 0x80(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToMaterial
struct UAthenaChallengeDisplayLibrary_ApplyChallengeSetStyleColorsToMaterial_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              StyleMaterial;                                     // 0x80(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToImageMaterial
struct UAthenaChallengeDisplayLibrary_ApplyChallengeSetStyleColorsToImageMaterial_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UImage*                                ImageWidget;                                       // 0x80(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.OnLocalPlayerMissingAssistedChallenge
struct UAthenaChallengeInfoPanelEntry_OnLocalPlayerMissingAssistedChallenge_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.OnChallengeInfoSet
struct UAthenaChallengeInfoPanelEntry_OnChallengeInfoSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.HandleQuestsUpdated
struct UAthenaChallengeInfoPanelEntry_HandleQuestsUpdated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanel.HandleQuestsUpdatedInGame
struct UAthenaChallengeInfoPanel_HandleQuestsUpdatedInGame_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanel.HandleCycleQuestsInputAction
struct UAthenaChallengeInfoPanel_HandleCycleQuestsInputAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// Function FortniteUI.AthenaChallengeTreeEntry_ChallengeSet.OnChallengeSetEstablished
struct UAthenaChallengeTreeEntry_ChallengeSet_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Challenge.OnPartyAssistEnabledChanged
struct UAthenaChallengeListEntry_Challenge_OnPartyAssistEnabledChanged_Params
{
public:
	bool                                         bIsPartyAssistEnabled;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Challenge.OnChallengeInfoSet
struct UAthenaChallengeListEntry_Challenge_OnChallengeInfoSet_Params
{
public:
	bool                                         bIsComplete;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleUpperAreaClicked
struct UAthenaChallengeListEntry_DetailedChallenge_HandleUpperAreaClicked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleCloseChallengeOptionsInputAction
struct UAthenaChallengeListEntry_DetailedChallenge_HandleCloseChallengeOptionsInputAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Header.OnSectionTypeSet
struct UAthenaChallengeListEntry_Header_OnSectionTypeSet_Params
{
public:
	enum class EChallengeListSection             SectionType;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_CompletionReward.OnRewardInfoSet
struct UAthenaChallengeListEntry_CompletionReward_OnRewardInfoSet_Params
{
public:
	bool                                         bIsCompleted;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FA8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x8(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.IsPartyAssistedChallengeSet
struct UAthenaChallengeScreen_IsPartyAssistedChallengeSet_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleTabSelectionChanged
struct UAthenaChallengeScreen_HandleTabSelectionChanged_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FAC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleTabClicked
struct UAthenaChallengeScreen_HandleTabClicked_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FAD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandlePrevCategoryAction
struct UAthenaChallengeScreen_HandlePrevCategoryAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleNextCategoryAction
struct UAthenaChallengeScreen_HandleNextCategoryAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleDetailsDeactivated
struct UAthenaChallengeScreen_HandleDetailsDeactivated_Params
{
public:
	class UCommonActivatablePanel*               DetailsPanel;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.ShowItemDetails
struct UFortActivatablePanelWithItemPreview_ShowItemDetails_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed
struct UFortActivatablePanelWithItemPreview_OnVaultItemsViewed_Params
{
public:
	TArray<class UFortItem*>                     Items;                                             // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged
struct UFortActivatablePanelWithItemPreview_OnItemPreviewChanged_Params
{
public:
	class AActor*                                NewPrefab;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             NewItem;                                           // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_7
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_6
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_5
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_4
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_3
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_2
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_1
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_0
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.HideItemDetails
struct UFortActivatablePanelWithItemPreview_HideItemDetails_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem
struct UFortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails.OnChallengeSetEstablished
struct UAthenaChallengeSetDetails_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsComplete;                                       // 0x80(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FB5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreenTileBase.OnContainsPartyAssistedChallengeChanged
struct UAthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged_Params
{
public:
	bool                                         bHasPartyAssistedChallenge;                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// Function FortniteUI.AthenaChallengeScreenTileBase.OnChallengeSetEstablished
struct UAthenaChallengeScreenTileBase_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsComplete;                                       // 0x80(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0x81(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FB8[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMinimalChallengeInfoEntry.OnChallengeInfoSet
struct UAthenaMinimalChallengeInfoEntry_OnChallengeInfoSet_Params
{
public:
	bool                                         bIsInProgress;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeTreeView.HandleQuestsUpdated
struct UAthenaChallengeTreeView_HandleQuestsUpdated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCompassBase.BindToModel
struct UAthenaCompassBase_BindToModel_Params
{
public:
	class UAthenaPlayerViewModel*                ViewModel;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage
struct UAthenaCountdownWidgetBase_OnDisplayWarningMessage_Params
{
public:
	class FText                                  FirstLineText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  SecondLineText;                                    // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate
struct UAthenaCountdownWidgetBase_OnCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FBE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CountdownUpdateText;                               // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted
struct UAthenaCountdownWidgetBase_OnCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FBF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CountdownIntroText;                                // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished
struct UAthenaCountdownWidgetBase_OnCountdownFinished_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged
struct UAthenaCountdownWidgetBase_HandleGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate
struct UAthenaCountdownWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted
struct UAthenaCountdownWidgetBase_HandleCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished
struct UAthenaCountdownWidgetBase_HandleCountdownFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.OnLoadedItem
struct UAthenaCreativeItemTileButton_OnLoadedItem_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.OnEntryClick
struct UAthenaCreativeItemTileButton_OnEntryClick_Params
{
public:
	class UAthenaCreativeItemTileButton*         Entry;                                             // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.MakeFortItemEntryObjectWrapper
struct UAthenaCreativeItemTileButton_MakeFortItemEntryObjectWrapper_Params
{
public:
	class UObject*                               Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortItemEntry                        InItemEntry;                                       // 0x8(0x120)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAthenaCreativeItemEntryObjectWrapper* ReturnValue;                                       // 0x128(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.GetItemTypeCount
struct UAthenaCreativeItemTileButton_GetItemTypeCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x128 (0x128 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.CompareToItemEntry
struct UAthenaCreativeItemTileButton_CompareToItemEntry_Params
{
public:
	struct FFortItemEntry                        InItemEntry;                                       // 0x0(0x120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x120(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FC0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
struct UFortItemPickerBase_TryCommitSelectedItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedItem
struct UFortItemPickerBase_SetSelectedItem_Params
{
public:
	class UFortItem*                             ItemToSelect;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
struct UFortItemPickerBase_SetSelectedIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FC3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionEvent__DelegateSignature
struct UFortItemPickerBase_OnItemSelectionEvent__DelegateSignature_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetSelectedItem
struct UFortItemPickerBase_GetSelectedItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetListViewInterface
struct UFortItemPickerBase_GetListViewInterface_Params
{
public:
	UInterfaceProperty_                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetIndexForItem
struct UFortItemPickerBase_GetIndexForItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FC4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.ClearSelection
struct UFortItemPickerBase_ClearSelection_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget
struct UFortItemPickerBase_CenterSelectedItemTileWidget_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
struct UFortItemPickerBase_CanItemBeComitted_Params
{
public:
	class UFortItem*                             ItemToCommit;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FC5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.SetFilter
struct UAthenaCustomizationPicker_SetFilter_Params
{
public:
	class FName                                  FilterName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.RefreshView
struct UAthenaCustomizationPicker_RefreshView_Params
{
public:
	bool                                         CategoryChanging;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         FilterChanged;                                     // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaCustomizationPicker.OnUpdateSaveButtonVisuals__DelegateSignature
struct UAthenaCustomizationPicker_OnUpdateSaveButtonVisuals__DelegateSignature_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnNoItemsAvailableInFilter_Params
{
public:
	class FText                                  EmptyDisplayText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnItemsAvailableInFilter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature
struct UAthenaCustomizationPicker_OnCosmeticChangeSaveEvent__DelegateSignature_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged
struct UAthenaCustomizationPicker_HandleSelectedItemHasChanged_Params
{
public:
	bool                                         ItemChanged;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AmmoChanged;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IngredientsChanged;                                // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabSelected
struct UAthenaCustomizationPicker_HandleFilterTabSelected_Params
{
public:
	class FName                                  TabNameID;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabButtonCreated
struct UAthenaCustomizationPicker_HandleFilterTabButtonCreated_Params
{
public:
	class FName                                  TabNameID;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                         TabButton;                                         // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleDifferentFilterSetBP
struct UAthenaCustomizationPicker_HandleDifferentFilterSetBP_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName
struct UAthenaCustomizationPicker_GetQualifiedFilterDisplayName_Params
{
public:
	enum class EAthenaFilterDisplayType          InTopFilterDisplaySetting;                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FC9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory
struct UAthenaCustomizationPicker_EndCustomizationCategory_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory
struct UAthenaCustomizationPicker_BeginCustomizationCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      Category;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FCA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotToEdit;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.FortItemTileButton.OnTileSizeOverrideCheck
struct UFortItemTileButton_OnTileSizeOverrideCheck_Params
{
public:
	enum class EFortItemType                     TypeIn;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortItemCardSize                 SizeIn;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortItemCardSize                 SizeOut;                                           // 0x2(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShiftItemsVariantOption
struct UAthenaCustomizationScreenBase_ShiftItemsVariantOption_Params
{
public:
	class UAthenaCosmeticAccountItem*            Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VariantChannelIndex;                               // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FD0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ProcessLoadoutChanged
struct UAthenaCustomizationScreenBase_ProcessLoadoutChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.HandleLoadoutChanged
struct UAthenaCustomizationScreenBase_HandleLoadoutChanged_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated
struct UAthenaCustomizationScreenBase_HandleInventoryUpdated_Params
{
public:
	TSet<class FString>                          ItemChangeFlags;                                   // 0x0(0x50)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                        ProfileRevision;                                   // 0x50(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames
struct UAthenaCustomizationScreenBase_GetItemTypeDisplayNames_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FD1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory
struct UAthenaCustomizationScreenBase_GetFavoriteItemForCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FD2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName
struct UAthenaCustomizationScreenBase_GetCategoryDisplayName_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FD3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType
struct UAthenaCustomizationSlotSelectorButton_SetCustomizationType_Params
{
public:
	enum class EAthenaCustomizationCategory      NewType;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FD5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        InSubslotIndex;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate
struct UBacchusHUDElement_OnHUDStateUpdate_Params
{
public:
	struct FFortHUDState                         NewState;                                          // 0x0(0x14)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged
struct UBacchusHUDElement_HandleInputMethodChanged_Params
{
public:
	enum class ECommonInputType                  CurrentInputType;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.BacchusHUDElement.BP_GetMobileVisualType
struct UBacchusHUDElement_BP_GetMobileVisualType_Params
{
public:
	struct FGameplayTag                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponTypeChanged
struct UAthenaEquippedItemBase_WeaponTypeChanged_Params
{
public:
	enum class EEquippedWeaponDisplay            Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.UtilityItemTypeChanged
struct UAthenaEquippedItemBase_UtilityItemTypeChanged_Params
{
public:
	class AFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponItemDefinition*             Item;                                              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.UtilityItemCountChanged
struct UAthenaEquippedItemBase_UtilityItemCountChanged_Params
{
public:
	int32                                        Remaining;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.SetViewModel
struct UAthenaEquippedItemBase_SetViewModel_Params
{
public:
	class UAthenaPlayerViewModel*                ViewModel;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.ResourceTypeChanged
struct UAthenaEquippedItemBase_ResourceTypeChanged_Params
{
public:
	class UFortResourceItemDefinition*           Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourceCount;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FDC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.ResourceCountChanged
struct UAthenaEquippedItemBase_ResourceCountChanged_Params
{
public:
	int32                                        ResourceCount;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWorldItemsChanged
struct UAthenaEquippedItemBase_OnWorldItemsChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponChanged
struct UAthenaEquippedItemBase_OnWeaponChanged_Params
{
public:
	class AFortWeapon*                           NewWeapon;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                           PrevWeapon;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnViewTargetChanged
struct UAthenaEquippedItemBase_OnViewTargetChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnLocalAmmoChanged
struct UAthenaEquippedItemBase_OnLocalAmmoChanged_Params
{
public:
	int32                                        LocalCount;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LocalRemaining;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnBuildingMaterialChanged
struct UAthenaEquippedItemBase_OnBuildingMaterialChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HasAmmoChanged
struct UAthenaEquippedItemBase_HasAmmoChanged_Params
{
public:
	bool                                         bHasAmmo;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.AmmoTypeChanged
struct UAthenaEquippedItemBase_AmmoTypeChanged_Params
{
public:
	class AFortWeaponRanged*                     RangedWeapon;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*              Item;                                              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.AmmoChanged
struct UAthenaEquippedItemBase_AmmoChanged_Params
{
public:
	int32                                        MagazineAmmoCount;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BackupAmmoCount;                                   // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalRemaining;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated_BP
struct UAthenaEventMatchActiveGridScreenBase_OnTeamEliminated_BP_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated
struct UAthenaEventMatchActiveGridScreenBase_OnTeamEliminated_Params
{
public:
	int32                                        InSquadId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamChanged_BP
struct UAthenaEventMatchActiveGridScreenBase_OnTeamChanged_BP_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnTeamEliminated_BP
struct UAthenaEventMatchEliminatedGridScreenBase_OnTeamEliminated_BP_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnPlayerEliminatedStateChanged
struct UAthenaEventMatchEliminatedGridScreenBase_OnPlayerEliminatedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsEliminated;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.SetPlayerData
struct UAthenaEventMatchPlayerWidgetBase_SetPlayerData_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnTeamColorChanged
struct UAthenaEventMatchPlayerWidgetBase_OnTeamColorChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          InTeamColor;                                       // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnStormcapScoreChanged
struct UAthenaEventMatchPlayerWidgetBase_OnStormcapScoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InScore;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnSquadIdChanged
struct UAthenaEventMatchPlayerWidgetBase_OnSquadIdChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InSquadId;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldHealed
struct UAthenaEventMatchPlayerWidgetBase_OnShieldHealed_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShieldPercent;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldDamaged
struct UAthenaEventMatchPlayerWidgetBase_OnShieldDamaged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShieldPercent;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerPawnChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerPawnChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                       InPlayerPawn;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerNameChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerNameChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InPlayerName;                                      // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerDataChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerDataChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlaceChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlaceChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InPlace;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnMaterialCountChanged
struct UAthenaEventMatchPlayerWidgetBase_OnMaterialCountChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InCount;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE7[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnLocationChanged
struct UAthenaEventMatchPlayerWidgetBase_OnLocationChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InLocation;                                        // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnKillScoreChanged
struct UAthenaEventMatchPlayerWidgetBase_OnKillScoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsReplayRelevancyPlayerChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsReplayRelevancyPlayerChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsReplayRelevancyPlayer;                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsInRelevancyChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsInRelevancyChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsInRelevancy;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FEA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsFollowedPlayerChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsFollowedPlayerChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsFollowedPlayer;                               // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FEB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthHealed
struct UAthenaEventMatchPlayerWidgetBase_OnHealthHealed_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealthPercent;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FEC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthDamaged
struct UAthenaEventMatchPlayerWidgetBase_OnHealthDamaged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealthPercent;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FED[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDisconnectedChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDisconnectedChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisconnected;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FEE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDeadStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDead;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FEF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDBNOStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDBNOStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDBNO;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnBeingRevivedStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnBeingRevivedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsBeingRevived;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase.SetSquadIdVisible
struct UAthenaEventMatchScoreboardPlayerWidgetBase_SetSquadIdVisible_Params
{
public:
	bool                                         InVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetStormcapDamageVisible
struct UAthenaEventMatchScoreboardScreenBase_SetStormcapDamageVisible_Params
{
public:
	bool                                         InVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetSquadIdsVisible_BP
struct UAthenaEventMatchScoreboardScreenBase_SetSquadIdsVisible_BP_Params
{
public:
	bool                                         bSquadIdsVisible;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetSquadIdsVisible
struct UAthenaEventMatchScoreboardScreenBase_SetSquadIdsVisible_Params
{
public:
	bool                                         bSquadIdsVisible;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.OnToggleStormcapDamageActionExecuted
struct UAthenaEventMatchScoreboardScreenBase_OnToggleStormcapDamageActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.OnSquadKillscoreChanged
struct UAthenaEventMatchScoreboardScreenBase_OnSquadKillscoreChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.OnSquadEliminated
struct UAthenaEventMatchScoreboardScreenBase_OnSquadEliminated_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.OnSortByPlaceActionExecuted
struct UAthenaEventMatchScoreboardScreenBase_OnSortByPlaceActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.OnSortByEliminationsActionExecuted
struct UAthenaEventMatchScoreboardScreenBase_OnSortByEliminationsActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateTimeSinceLastKillText
struct UAthenaEventMatchStatusScreenBase_UpdateTimeSinceLastKillText_Params
{
public:
	class FText                                  TimeSinceLastKillText;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateSupplyDropsLootedText
struct UAthenaEventMatchStatusScreenBase_UpdateSupplyDropsLootedText_Params
{
public:
	class FText                                  SupplyDropsLootedText;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateShotsFiredText
struct UAthenaEventMatchStatusScreenBase_UpdateShotsFiredText_Params
{
public:
	class FText                                  ShotsFiredText;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePlayersRemainingText
struct UAthenaEventMatchStatusScreenBase_UpdatePlayersRemainingText_Params
{
public:
	class FText                                  PlayersRemainingText;                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesDestroyedText
struct UAthenaEventMatchStatusScreenBase_UpdatePiecesDestroyedText_Params
{
public:
	class FText                                  PiecesDestroyedText;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesBuiltText
struct UAthenaEventMatchStatusScreenBase_UpdatePiecesBuiltText_Params
{
public:
	class FText                                  PiecesBuiltText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsText
struct UAthenaEventMatchStatusScreenBase_UpdateMostKillsText_Params
{
public:
	class FText                                  MostKillsText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsScore
struct UAthenaEventMatchStatusScreenBase_UpdateMostKillsScore_Params
{
public:
	class FText                                  MostKillsScore;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMatchTimeText
struct UAthenaEventMatchStatusScreenBase_UpdateMatchTimeText_Params
{
public:
	class FText                                  MatchTimeText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationText
struct UAthenaEventMatchStatusScreenBase_UpdateLongestEliminationText_Params
{
public:
	class FText                                  LongestEliminationText;                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationScore
struct UAthenaEventMatchStatusScreenBase_UpdateLongestEliminationScore_Params
{
public:
	class FText                                  LongestEliminationScore;                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeTitleText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseTimeTitleText_Params
{
public:
	class FText                                  GamePhaseTimeTitleText;                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseTimeText_Params
{
public:
	class FText                                  GamePhaseTimeText;                                 // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseText_Params
{
public:
	class FText                                  GamePhaseText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateFastestKillText
struct UAthenaEventMatchStatusScreenBase_UpdateFastestKillText_Params
{
public:
	class FText                                  FastestKillText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  FastestKillTime;                                   // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageTakenText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageTakenText_Params
{
public:
	class FText                                  DamageTakenText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageInflictedText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageInflictedText_Params
{
public:
	class FText                                  DamageInflictedText;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageHealedText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageHealedText_Params
{
public:
	class FText                                  DamageHealedText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateCircleRadiusText
struct UAthenaEventMatchStatusScreenBase_UpdateCircleRadiusText_Params
{
public:
	class FText                                  CircleRadiusText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateChestsLootedText
struct UAthenaEventMatchStatusScreenBase_UpdateChestsLootedText_Params
{
public:
	class FText                                  ChestsLootedText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerKillScoreChanged
struct UAthenaEventMatchStatusScreenBase_OnPlayerKillScoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged_BP
struct UAthenaEventMatchStatusScreenBase_OnPlayerDeadStateChanged_BP_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged
struct UAthenaEventMatchStatusScreenBase_OnPlayerDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FF8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerWidgetAdded
struct UAthenaEventMatchTeamWidgetBase_OnPlayerWidgetAdded_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDisconnectedChanged
struct UAthenaEventMatchTeamWidgetBase_OnPlayerDisconnectedChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDisconnected;                                 // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FFA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDeadStateChanged
struct UAthenaEventMatchTeamWidgetBase_OnPlayerDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FFB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.IsTeamDead
struct UAthenaEventMatchTeamWidgetBase_IsTeamDead_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.GetTeamKills
struct UAthenaEventMatchTeamWidgetBase_GetTeamKills_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaGadgetFuelWidget.SetItem
struct UAthenaGadgetFuelWidget_SetItem_Params
{
public:
	class UFortWorldItem*                        Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGameOverScreenBase.RequestRefreshInput
struct UAthenaGameOverScreenBase_RequestRefreshInput_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGameOverScreenBase.GoToBoss
struct UAthenaGameOverScreenBase_GoToBoss_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGameOverScreenBase.CanShowGoToBoss
struct UAthenaGameOverScreenBase_CanShowGoToBoss_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.OnGameStateSet
struct UAthenaGamePhaseWidgetBase_OnGameStateSet_Params
{
public:
	class AFortGameState*                        InGameState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged
struct UAthenaGamePhaseWidgetBase_OnGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged
struct UAthenaGamePhaseWidgetBase_HandleGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate
struct UAthenaGamePhaseWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseTapToShoot
struct UAthenaHUDContext_UseTapToShoot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStop
struct UAthenaHUDContext_UseOrRleoadFromHUDStop_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStart
struct UAthenaHUDContext_UseOrRleoadFromHUDStart_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.UpdateSelectedWidgetMoveOffsetVector
struct UAthenaHUDContext_UpdateSelectedWidgetMoveOffsetVector_Params
{
public:
	struct FVector2D                             VectorOffset;                                      // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FMoveScale;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeMovementInputFromHUD
struct UAthenaHUDContext_TakeMovementInputFromHUD_Params
{
public:
	struct FVector2D                             MoveVector;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeLookStickInputFromHUD
struct UAthenaHUDContext_TakeLookStickInputFromHUD_Params
{
public:
	struct FVector2D                             LookStickPosition;                                 // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeLookInputFromHUD
struct UAthenaHUDContext_TakeLookInputFromHUD_Params
{
public:
	struct FRotator                              LookRotator;                                       // 0x0(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeItemSelectionInputFromHUD
struct UAthenaHUDContext_TakeItemSelectionInputFromHUD_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIdx;                                           // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUsing;                                          // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    InQuickBar;                                        // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReloadOrUseIfAlreadySelected;                     // 0xA(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopUseImmediately;                               // 0xB(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SwapQuickBarFocusFromHUD
struct UAthenaHUDContext_SwapQuickBarFocusFromHUD_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3005[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotOverride;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.StopTargettingFromHUD
struct UAthenaHUDContext_StopTargettingFromHUD_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.StopItemSelectionInputFromHUD
struct UAthenaHUDContext_StopItemSelectionInputFromHUD_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIdx;                                           // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    InQuickBar;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3006[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.StartOrFinishSwap
struct UAthenaHUDContext_StartOrFinishSwap_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.ShowMobilePicker__DelegateSignature
struct UAthenaHUDContext_ShowMobilePicker__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShowMobilePicker
struct UAthenaHUDContext_ShowMobilePicker_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShowGameModeMessage
struct UAthenaHUDContext_ShowGameModeMessage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldVictoryUIPushEmoteInput
struct UAthenaHUDContext_ShouldVictoryUIPushEmoteInput_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldDisplayScoreUI
struct UAthenaHUDContext_ShouldDisplayScoreUI_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldDisplayPlacement
struct UAthenaHUDContext_ShouldDisplayPlacement_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetTargetingToggleable
struct UAthenaHUDContext_SetTargetingToggleable_Params
{
public:
	bool                                         bNewValue;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetSelectWidgetToMoveMode
struct UAthenaHUDContext_SetSelectWidgetToMoveMode_Params
{
public:
	bool                                         bSet;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetSelectedInventoryItem
struct UAthenaHUDContext_SetSelectedInventoryItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetResourceMaterial
struct UAthenaHUDContext_SetResourceMaterial_Params
{
public:
	enum class EFortResourceType                 NewMaterial;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetPTTState
struct UAthenaHUDContext_SetPTTState_Params
{
public:
	enum class EPTTState                         NewPushToTalkState;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetLockOnStickCoords
struct UAthenaHUDContext_SetLockOnStickCoords_Params
{
public:
	struct FVector2D                             LockOnCoords;                                      // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetLocalPlayerWonMatch
struct UAthenaHUDContext_SetLocalPlayerWonMatch_Params
{
public:
	bool                                         bLocalPlayerWon;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SelectWidgetToMove
struct UAthenaHUDContext_SelectWidgetToMove_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ReloadFromHUD
struct UAthenaHUDContext_ReloadFromHUD_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.PushGameOverEmoteInput
struct UAthenaHUDContext_PushGameOverEmoteInput_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.PTTStateChange__DelegateSignature
struct UAthenaHUDContext_PTTStateChange__DelegateSignature_Params
{
public:
	enum class EPTTState                         NewPushToTalkState;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.PlaylistUIExtensionChanged__DelegateSignature
struct UAthenaHUDContext_PlaylistUIExtensionChanged__DelegateSignature_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.OwnerOrWeaponHasTag
struct UAthenaHUDContext_OwnerOrWeaponHasTag_Params
{
public:
	struct FGameplayTag                          InTag;                                             // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3007[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnSpecialActorListChanged__DelegateSignature
struct UAthenaHUDContext_OnSpecialActorListChanged__DelegateSignature_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnSignalQualityChange__DelegateSignature
struct UAthenaHUDContext_OnSignalQualityChange__DelegateSignature_Params
{
public:
	float                                        NewQuality;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnResurrectingNow__DelegateSignature
struct UAthenaHUDContext_OnResurrectingNow__DelegateSignature_Params
{
public:
	bool                                         bResurrectingNow;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerNameChange__DelegateSignature
struct UAthenaHUDContext_OnPlayerNameChange__DelegateSignature_Params
{
public:
	class FString                                NewName;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerFiredWeapon__DelegateSignature
struct UAthenaHUDContext_OnPlayerFiredWeapon__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLowPerformanceMode__DelegateSignature
struct UAthenaHUDContext_OnLowPerformanceMode__DelegateSignature_Params
{
public:
	bool                                         bInLowPerformanceMode;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamWon__DelegateSignature
struct UAthenaHUDContext_OnLocalTeamWon__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamLost__DelegateSignature
struct UAthenaHUDContext_OnLocalTeamLost__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerWon__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerWon__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerLost__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerLost__DelegateSignature_Params
{
public:
	enum class EEndOfMatchReason                 LostReason;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerKilledPlayer__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerKilledPlayer__DelegateSignature_Params
{
public:
	class AFortPlayerStateAthena*                Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDeathOnWin__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerDeathOnWin__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDBNOStateChanged__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerDBNOStateChanged__DelegateSignature_Params
{
public:
	bool                                         bIsDBNO;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerBeginSkydiving__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerBeginSkydiving__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnForwardStartedFalling__DelegateSignature
struct UAthenaHUDContext_OnForwardStartedFalling__DelegateSignature_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnFireStopped__DelegateSignature
struct UAthenaHUDContext_OnFireStopped__DelegateSignature_Params
{
public:
	int32                                        StopFireIndex;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.OnClientSettingUpdatedShowViewers
struct UAthenaHUDContext_OnClientSettingUpdatedShowViewers_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnCanPTTChange__DelegateSignature
struct UAthenaHUDContext_OnCanPTTChange__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaSettingsApplied__DelegateSignature
struct UAthenaHUDContext_OnAthenaSettingsApplied__DelegateSignature_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaInventorySwapStarted__DelegateSignature
struct UAthenaHUDContext_OnAthenaInventorySwapStarted__DelegateSignature_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaInventorySwapComplete__DelegateSignature
struct UAthenaHUDContext_OnAthenaInventorySwapComplete__DelegateSignature_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaInventoryItemSelected__DelegateSignature
struct UAthenaHUDContext_OnAthenaInventoryItemSelected__DelegateSignature_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaHUDAllWinnersAnnounced__DelegateSignature
struct UAthenaHUDContext_OnAthenaHUDAllWinnersAnnounced__DelegateSignature_Params
{
public:
	struct FAthenaWinnerInfo                     WinnerInfo;                                        // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaGamePhaseChanged__DelegateSignature
struct UAthenaHUDContext_OnAthenaGamePhaseChanged__DelegateSignature_Params
{
public:
	enum class EAthenaGamePhaseStep              NewPhase;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaAutoFireChanged__DelegateSignature
struct UAthenaHUDContext_OnAthenaAutoFireChanged__DelegateSignature_Params
{
public:
	bool                                         bEntering;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.OnAllWinnersAnnounced
struct UAthenaHUDContext_OnAllWinnersAnnounced_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.JumpFromHudStart
struct UAthenaHUDContext_JumpFromHudStart_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.JumpFromHudEnd
struct UAthenaHUDContext_JumpFromHudEnd_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsVictoryUICinematic
struct UAthenaHUDContext_IsVictoryUICinematic_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsUsingScope
struct UAthenaHUDContext_IsUsingScope_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsTargeting
struct UAthenaHUDContext_IsTargeting_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsSwapping
struct UAthenaHUDContext_IsSwapping_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsShowViewerCountEnabled
struct UAthenaHUDContext_IsShowViewerCountEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsRunningOnBattery
struct UAthenaHUDContext_IsRunningOnBattery_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsOperatingTurret
struct UAthenaHUDContext_IsOperatingTurret_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsMovingSelectedWidget
struct UAthenaHUDContext_IsMovingSelectedWidget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsInSelectWidgetToMoveMode
struct UAthenaHUDContext_IsInSelectWidgetToMoveMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsInBuildMode
struct UAthenaHUDContext_IsInBuildMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsFiringFromTouch
struct UAthenaHUDContext_IsFiringFromTouch_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3008[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCurrentWeaponFiring
struct UAthenaHUDContext_IsCurrentWeaponFiring_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCurrentWeaponChargeable
struct UAthenaHUDContext_IsCurrentWeaponChargeable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCrouching
struct UAthenaHUDContext_IsCrouching_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsAutoRunEnabled
struct UAthenaHUDContext_IsAutoRunEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.IsActionBound
struct UAthenaHUDContext_IsActionBound_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3009[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HideGameModeMessage
struct UAthenaHUDContext_HideGameModeMessage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasWifi
struct UAthenaHUDContext_HasWifi_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasLockOnTarget
struct UAthenaHUDContext_HasLockOnTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasFiringTouch
struct UAthenaHUDContext_HasFiringTouch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasAutofireTarget
struct UAthenaHUDContext_HasAutofireTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleUIGameplayCue
struct UAthenaHUDContext_HandleUIGameplayCue_Params
{
public:
	class FName                                  CueName;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGameplayCueEvent                 EventType;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x10(0xB8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleSpectatorViewTargetChanged
struct UAthenaHUDContext_HandleSpectatorViewTargetChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleLocalPlayerDBNOStateChanged
struct UAthenaHUDContext_HandleLocalPlayerDBNOStateChanged_Params
{
public:
	class AFortPawn*                             FortPawn;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDBNO;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleLocalPlayerBeginSkydiving
struct UAthenaHUDContext_HandleLocalPlayerBeginSkydiving_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleGamePhaseChange
struct UAthenaHUDContext_HandleGamePhaseChange_Params
{
public:
	enum class EAthenaGamePhaseStep              NewGamePhase;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetWinnerText
struct UAthenaHUDContext_GetWinnerText_Params
{
public:
	class FText                                  ReturnText;                                        // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                  WinnerName;                                        // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetVictoryUIWidgetClass
struct UAthenaHUDContext_GetVictoryUIWidgetClass_Params
{
public:
	TSubclassOf<class UUserWidget>               ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetVictoryText
struct UAthenaHUDContext_GetVictoryText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetVictoryStinger
struct UAthenaHUDContext_GetVictoryStinger_Params
{
public:
	class USoundCue*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetSquadConnectedCount
struct UAthenaHUDContext_GetSquadConnectedCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetSelectedInventoryItem
struct UAthenaHUDContext_GetSelectedInventoryItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPTTState
struct UAthenaHUDContext_GetPTTState_Params
{
public:
	enum class EPTTState                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPlaylistUIExtender
struct UAthenaHUDContext_GetPlaylistUIExtender_Params
{
public:
	class UFortGameUIExtenderAthena*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPlayerName
struct UAthenaHUDContext_GetPlayerName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPlayerColor
struct UAthenaHUDContext_GetPlayerColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetLocalTime
struct UAthenaHUDContext_GetLocalTime_Params
{
public:
	int32                                        Hours;                                             // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Minutes;                                           // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetJumpPressedTouchIndex
struct UAthenaHUDContext_GetJumpPressedTouchIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetInteractPressedTouchIndex
struct UAthenaHUDContext_GetInteractPressedTouchIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetInLowPerformanceMode
struct UAthenaHUDContext_GetInLowPerformanceMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetGameOverDelayTime
struct UAthenaHUDContext_GetGameOverDelayTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetCurrentViewModel
struct UAthenaHUDContext_GetCurrentViewModel_Params
{
public:
	class UAthenaPlayerViewModel*                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetCanPTT
struct UAthenaHUDContext_GetCanPTT_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetBoundActions
struct UAthenaHUDContext_GetBoundActions_Params
{
public:
	TArray<class FName>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetBatteryLevel
struct UAthenaHUDContext_GetBatteryLevel_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x208 (0x208 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForwardOnSpecialActorListChanged
struct UAthenaHUDContext_ForwardOnSpecialActorListChanged_Params
{
public:
	struct FSpecialActorRepData                  SpecialActorData;                                  // 0x0(0x208)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForceFireFromHUDStop
struct UAthenaHUDContext_ForceFireFromHUDStop_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.FireFromHUDStop
struct UAthenaHUDContext_FireFromHUDStop_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               DebugWidget;                                       // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.FireFromHUDStart
struct UAthenaHUDContext_FireFromHUDStart_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               DebugWidget;                                       // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUDWithEventType
struct UAthenaHUDContext_ExecuteActionNameFromHUDWithEventType_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputEvent                       KeyEvent;                                          // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUD
struct UAthenaHUDContext_ExecuteActionNameFromHUD_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.EndUseFromHUD
struct UAthenaHUDContext_EndUseFromHUD_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.EnableAutoRunFromHUD
struct UAthenaHUDContext_EnableAutoRunFromHUD_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.DisplayPlayerWonTime
struct UAthenaHUDContext_DisplayPlayerWonTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.CycleQuickbar
struct UAthenaHUDContext_CycleQuickbar_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanShootInVehicle
struct UAthenaHUDContext_CanShootInVehicle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanCurrentWeaponAutoFireFromReticle
struct UAthenaHUDContext_CanCurrentWeaponAutoFireFromReticle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.CancelSwap
struct UAthenaHUDContext_CancelSwap_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanAutoRun
struct UAthenaHUDContext_CanAutoRun_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.BeginUseFromHUD
struct UAthenaHUDContext_BeginUseFromHUD_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.UpdateMessaging
struct UAthenaHUDGamePhaseChangingBase_UpdateMessaging_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3015[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  MESSAGE;                                           // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  TimeText;                                          // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.HandleGamePhaseStepChanged
struct UAthenaHUDGamePhaseChangingBase_HandleGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.GamePhaseStepChanged
struct UAthenaHUDGamePhaseChangingBase_GamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.RequestNextAlert
struct UAthenaHUDPlayerActionAlertBase_RequestNextAlert_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.AlertPlayer
struct UAthenaHUDPlayerActionAlertBase_AlertPlayer_Params
{
public:
	enum class EAthenaPlayerActionAlert          Alert;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3017[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  DetailText;                                        // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.SetDataSource
struct UAthenaIndicatorLayerBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.PlayersWithNameIndicatorsChanged
struct UAthenaIndicatorLayerBase_PlayersWithNameIndicatorsChanged_Params
{
public:
	TArray<class AFortPlayerStateAthena*>        PlayerStates;                                      // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.OnTargetingChanged
struct UAthenaIndicatorLayerBase_OnTargetingChanged_Params
{
public:
	bool                                         bTargeting;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.GetPlayerViewModel
struct UAthenaIndicatorLayerBase_GetPlayerViewModel_Params
{
public:
	class UAthenaPlayerViewModel*                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.GetNameIndicatedPlayers
struct UAthenaIndicatorLayerBase_GetNameIndicatedPlayers_Params
{
public:
	TArray<class AFortPlayerStateAthena*>        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.SetBypassNotifications
struct UAthenaInventoryPanelBase_SetBypassNotifications_Params
{
public:
	bool                                         bBypass;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.RequestEquip
struct UAthenaInventoryPanelBase_RequestEquip_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.HandleQuickBarChangedBP
struct UAthenaInventoryPanelBase_HandleQuickBarChangedBP_Params
{
public:
	enum class EFortQuickBars                    QuickBarType;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.HandleInventoryItemSelected
struct UAthenaInventoryPanelBase_HandleInventoryItemSelected_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.HandleCursorModeChangedBP
struct UAthenaInventoryPanelBase_HandleCursorModeChangedBP_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_301B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_301C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           CursorModeContentWidget;                           // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.HandleCursorModeChanged
struct UAthenaInventoryPanelBase_HandleCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_301D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_301E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           CursorModeContentWidget;                           // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.GetTileViewForItem
struct UAthenaInventoryPanelBase_GetTileViewForItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.FocusTileView
struct UAthenaInventoryPanelBase_FocusTileView_Params
{
public:
	class UFortItemTileView*                     TileView;                                          // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.AttemptToUpdateFocus
struct UAthenaInventoryPanelBase_AttemptToUpdateFocus_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.AdvanceSelection
struct UAthenaInventoryPanelBase_AdvanceSelection_Params
{
public:
	class UFortItemTileView*                     TileView;                                          // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization
struct UAthenaItemSelectorScreenBase_StartItemCustomization_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3020[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        InSubslotIndex;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CategoryDisplayName;                               // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ItemDisplayTypeName;                               // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit_ApplyToAllSlots
struct UAthenaItemSelectorScreenBase_SaveAndExit_ApplyToAllSlots_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit
struct UAthenaItemSelectorScreenBase_SaveAndExit_Params
{
public:
	bool                                         bApplyToAllSlots;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnVariantSelectionChanged
struct UAthenaItemSelectorScreenBase_OnVariantSelectionChanged_Params
{
public:
	struct FMcpVariantChannelInfo                InVariant;                                         // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged
struct UAthenaItemSelectorScreenBase_OnTabSelectionChanged_Params
{
public:
	bool                                         bShowingVariants;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnSavingItemStarted
struct UAthenaItemSelectorScreenBase_OnSavingItemStarted_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited
struct UAthenaItemSelectorScreenBase_OnItemSelectionCommited_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged
struct UAthenaItemSelectorScreenBase_OnItemSelectedChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinsihedItemSetup
struct UAthenaItemSelectorScreenBase_OnFinsihedItemSetup_Params
{
public:
	class FText                                  CategoryDisplayName;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ItemDisplayTypeName;                               // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EAthenaCustomizationCategory      SelectedCategory;                                  // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3021[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinsihedItemSave
struct UAthenaItemSelectorScreenBase_OnFinsihedItemSave_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged
struct UAthenaItemSelectorScreenBase_OnCurrentItemChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleSelectedTabChanged
struct UAthenaItemSelectorScreenBase_HandleSelectedTabChanged_Params
{
public:
	class FName                                  SelectedTabID;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem
struct UAthenaItemSelectorScreenBase_GetCurrentItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.ExitEditStyle
struct UAthenaItemSelectorScreenBase_ExitEditStyle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.EnterEditStyle
struct UAthenaItemSelectorScreenBase_EnterEditStyle_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText
struct UAthenaLeaderboardScreenBase_OnUpdateTabButtonText_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x8(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader
struct UAthenaLeaderboardScreenBase_OnUpdateListHeader_Params
{
public:
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI
struct UAthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI_Params
{
public:
	bool                                         bWasSuccessful;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3024[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortLeaderboardRowProxyInstance*      LocalUserRow;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  QueryErrorStr;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryStarted
struct UAthenaLeaderboardScreenBase_OnQueryStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryFinished
struct UAthenaLeaderboardScreenBase_OnQueryFinished_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged
struct UAthenaLeaderboardScreenBase_OnPlaylistChanged_Params
{
public:
	class FName                                  NewPlaylistName;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECommonInputType                  NewInputType;                                      // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3025[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged
struct UAthenaLeaderboardScreenBase_OnMatchTypeChanged_Params
{
public:
	int32                                        MatchTypeIndex;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged
struct UAthenaLeaderboardScreenBase_OnFriendsFilterChanged_Params
{
public:
	int32                                        FriendsFilterIndex;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged
struct UAthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged_Params
{
public:
	int32                                        ActiveWidgetIndex;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard
struct UAthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaLobbyBase.UpdateGenericLinkText
struct UAthenaLobbyBase_UpdateGenericLinkText_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.ShowMobileAutoFireScreen
struct UAthenaLobbyBase_ShowMobileAutoFireScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.ShowHighlightSummary
struct UAthenaLobbyBase_ShowHighlightSummary_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.ShowDailyNews
struct UAthenaLobbyBase_ShowDailyNews_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnUpdateSocialImportButtonText
struct UAthenaLobbyBase_OnUpdateSocialImportButtonText_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnPlaylistChanged
struct UAthenaLobbyBase_OnPlaylistChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3028[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortPlaylistAthena*                   PlaylistData;                                      // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnPlayerClicked
struct UAthenaLobbyBase_OnPlayerClicked_Params
{
public:
	int32                                        PlayerIndex;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnNavigationUp
struct UAthenaLobbyBase_OnNavigationUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnNavigationRight
struct UAthenaLobbyBase_OnNavigationRight_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnNavigationLeft
struct UAthenaLobbyBase_OnNavigationLeft_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnLobbyChanged
struct UAthenaLobbyBase_OnLobbyChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnEndCursorOverPlayer
struct UAthenaLobbyBase_OnEndCursorOverPlayer_Params
{
public:
	int32                                        PlayerIndex;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnBeginCursorOverPlayer
struct UAthenaLobbyBase_OnBeginCursorOverPlayer_Params
{
public:
	int32                                        PlayerIndex;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.LoadLobbyBackground
struct UAthenaLobbyBase_LoadLobbyBackground_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandlePlaylistDataChanged
struct UAthenaLobbyBase_HandlePlaylistDataChanged_Params
{
public:
	struct FPlaylistData                         NewPlaylistData;                                   // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleGenericLinkButtonClicked
struct UAthenaLobbyBase_HandleGenericLinkButtonClicked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DynamicHandleLoadingScreenVisibilityChanged
struct UAthenaLobbyBase_DynamicHandleLoadingScreenVisibilityChanged_Params
{
public:
	bool                                         IsVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DisplayStoreUpdated
struct UAthenaLobbyBase_DisplayStoreUpdated_Params
{
public:
	class UStoreToastRequest*                    StoreUpdatedRequest;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMapLayer.SetLocalPlayer
struct UAthenaMapLayer_SetLocalPlayer_Params
{
public:
	class ULocalPlayer*                          LocalPlayer;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.FlashPlayerIcon
struct UAthenaMapLayer_FlashPlayerIcon_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.ClearTouches
struct UAthenaMapLayer_ClearTouches_Params
{
public:
};

// 0x100 (0x100 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerData
struct UAthenaMarkerDetails_UpdateMarkerData_Params
{
public:
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x0(0x100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerAction
struct UAthenaMarkerDetails_UpdateMarkerAction_Params
{
public:
	enum class EFortMarkerActions                MarkerAction;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetTargetScreenPosition
struct UAthenaMarkerPointer_SetTargetScreenPosition_Params
{
public:
	struct FVector2D                             InTargetScreenPosition;                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetLineMeshMaterial
struct UAthenaMarkerPointer_SetLineMeshMaterial_Params
{
public:
	class UMaterialInterface*                    Material;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchReadyDesktopPopup.UserDismissedDialog
struct UAthenaMatchReadyDesktopPopup_UserDismissedDialog_Params
{
public:
	bool                                         bBringToFront;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortVoiceChannelToggleButton.OnVoiceChannelSelected
struct UFortVoiceChannelToggleButton_OnVoiceChannelSelected_Params
{
public:
	bool                                         bIsPartyChat;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.SetDataSource
struct UAthenaPlayerHitPointBarBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnValueChangedWithReason
struct UAthenaPlayerHitPointBarBase_OnValueChangedWithReason_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortHitPointModificationReason   Reason;                                            // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3033[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnMaxValueChanged
struct UAthenaPlayerHitPointBarBase_OnMaxValueChanged_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDeltaChanged
struct UAthenaPlayerHitPointBarBase_OnDeltaChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDBNOStateChanged
struct UAthenaPlayerHitPointBarBase_OnDBNOStateChanged_Params
{
public:
	bool                                         IsDBNO;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetLastValuePercentage
struct UAthenaPlayerHitPointBarBase_GetLastValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetCurrentValuePercentage
struct UAthenaPlayerHitPointBarBase_GetCurrentValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.TalkingStateChanged
struct UAthenaPlayerIndicatorBase_TalkingStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTalking;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3036[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.ShowCallout
struct UAthenaPlayerIndicatorBase_ShowCallout_Params
{
public:
	enum class ETeamMemberState                  Callout;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.SetViewModel
struct UAthenaPlayerIndicatorBase_SetViewModel_Params
{
public:
	class UAthenaPlayerViewModel*                InPlayerVM;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.RefreshCurrentPawn
struct UAthenaPlayerIndicatorBase_RefreshCurrentPawn_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.PlayerNameChanged
struct UAthenaPlayerIndicatorBase_PlayerNameChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.DBNOStateChanged
struct UAthenaPlayerIndicatorBase_DBNOStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDBNO;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3037[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BeingRevivedStateChanged
struct UAthenaPlayerIndicatorBase_BeingRevivedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReviving;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3038[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.UpdateResurrectionExpirationWidget
struct UAthenaPlayerInfoBase_UpdateResurrectionExpirationWidget_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.TalkingStateChanged
struct UAthenaPlayerInfoBase_TalkingStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTalking;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3039[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.SetPlayerState
struct UAthenaPlayerInfoBase_SetPlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.SendEpicFriendInvite
struct UAthenaPlayerInfoBase_SendEpicFriendInvite_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.OnResurrectionStateChanged
struct UAthenaPlayerInfoBase_OnResurrectionStateChanged_Params
{
public:
	struct FFortResurrectionUIData               ResurrectionStateData;                             // 0x0(0x3)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.OnGameModeIconChange
struct UAthenaPlayerInfoBase_OnGameModeIconChange_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            NewGameModeIcon;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.OnDisplayAddFriend
struct UAthenaPlayerInfoBase_OnDisplayAddFriend_Params
{
public:
	bool                                         bShowAnimation;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.MutedStateChanged
struct UAthenaPlayerInfoBase_MutedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Muted;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_303A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.HandleSpectatingChanged
struct UAthenaPlayerInfoBase_HandleSpectatingChanged_Params
{
public:
	class AFortPlayerStateZone*                  NewSpectatingTarget;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.DBNOStateChanged
struct UAthenaPlayerInfoBase_DBNOStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDBNO;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_303B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.BeingRevivedStateChanged
struct UAthenaPlayerInfoBase_BeingRevivedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReviving;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_303C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerState
struct UAthenaPlayerKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerKillsBase.SetKillsSourcePlayerController
struct UAthenaPlayerKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class AFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayersLeftBase.SetPlayersLeftText
struct UAthenaPlayersLeftBase_SetPlayersLeftText_Params
{
public:
	class FText                                  PlayersText;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerTeamKillsBase.SetKillsSourcePlayerState
struct UAthenaPlayerTeamKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerTeamKillsBase.SetKillsSourcePlayerController
struct UAthenaPlayerTeamKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class AFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerVitalityBarBase.SetDataSource
struct UAthenaPlayerVitalityBarBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaProfileStatBox.SetStatView
struct UAthenaProfileStatBox_SetStatView_Params
{
public:
	class UAthenaBaseStatView*                   InStatView;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RespectParentStatView;                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3041[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaProfileStatBox.OnStatViewChanged__DelegateSignature
struct UAthenaProfileStatBox_OnStatViewChanged__DelegateSignature_Params
{
public:
	class UAthenaBaseStatView*                   StatView;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function FortniteUI.AthenaProfileStatBox.GetStatStyle
struct UAthenaProfileStatBox_GetStatStyle_Params
{
public:
	struct FGameplayTag                          InStat;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortUIStatStyle                      ReturnValue;                                       // 0x8(0xC0)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatBox.GetBaseStatView
struct UAthenaProfileStatBox_GetBaseStatView_Params
{
public:
	class UAthenaBaseStatView*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaBaseStatView.GetStat
struct UAthenaBaseStatView_GetStat_Params
{
public:
	struct FGameplayTag                          InStat;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaWeaponStatView.GetWeaponDefinition
struct UAthenaWeaponStatView_GetWeaponDefinition_Params
{
public:
	class UFortWeaponItemDefinition*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMatchStatView.GetWeaponViews
struct UAthenaMatchStatView_GetWeaponViews_Params
{
public:
	TArray<class UAthenaWeaponStatView*>         ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMatchStatView.GetWeaponViewHighestStat
struct UAthenaMatchStatView_GetWeaponViewHighestStat_Params
{
public:
	struct FGameplayTag                          InStat;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaWeaponStatView*                 ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaMatchStatView.GetSortedWeaponViews
struct UAthenaMatchStatView_GetSortedWeaponViews_Params
{
public:
	struct FGameplayTag                          InStat;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAthenaWeaponStatView*>         ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMatchStatView.GetMatchID
struct UAthenaMatchStatView_GetMatchID_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMatchStatView.GetMatchEndTime
struct UAthenaMatchStatView_GetMatchEndTime_Params
{
public:
	struct FDateTime                             ReturnValue;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMatchSetStatView.GetOwningSeason
struct UAthenaMatchSetStatView_GetOwningSeason_Params
{
public:
	class UAthenaSeasonStats*                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMatchSetStatView.GetBestMatchViews
struct UAthenaMatchSetStatView_GetBestMatchViews_Params
{
public:
	TArray<class UAthenaMatchStatView*>          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaProfileStatContext.OnAthenaStatsProfileLoaded__DelegateSignature
struct UAthenaProfileStatContext_OnAthenaStatsProfileLoaded__DelegateSignature_Params
{
public:
	class UFortMcpProfileAthenaStats*            StatProfile;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaProfileStatContext.CreateMatchViews
struct UAthenaProfileStatContext_CreateMatchViews_Params
{
public:
	TArray<struct FAthenaMatchStats>             InRecentMatches;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAthenaMatchStatView*>          ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaProfileStatContext.CreateMatchStatView
struct UAthenaProfileStatContext_CreateMatchStatView_Params
{
public:
	class UAthenaSeasonStats*                    StatSet;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Bucket;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaMatchSetStatView*               ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatContext.CreateCurrentMatchStatView
struct UAthenaProfileStatContext_CreateCurrentMatchStatView_Params
{
public:
	class UAthenaMatchStatView*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatListWidgetBase.OnStatChanged
struct UAthenaProfileStatListWidgetBase_OnStatChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatListWidgetBase.HandleStatViewChanged
struct UAthenaProfileStatListWidgetBase_HandleStatViewChanged_Params
{
public:
	class UAthenaBaseStatView*                   StatView;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.Setup
struct UAthenaProfileStatsBase_Setup_Params
{
public:
	struct FUniqueNetIdRepl                      InUniqueId;                                        // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.PrevStatSet
struct UAthenaProfileStatsBase_PrevStatSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.OnStatSetChanged
struct UAthenaProfileStatsBase_OnStatSetChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.OnStartFetchingData
struct UAthenaProfileStatsBase_OnStartFetchingData_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.OnProfileLoaded
struct UAthenaProfileStatsBase_OnProfileLoaded_Params
{
public:
	class UFortMcpProfileAthenaStats*            ProfileAthenaStats;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.OnNoData
struct UAthenaProfileStatsBase_OnNoData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.OnDataRecieved
struct UAthenaProfileStatsBase_OnDataRecieved_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.NumStatSets
struct UAthenaProfileStatsBase_NumStatSets_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.NextStatSet
struct UAthenaProfileStatsBase_NextStatSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.NextPlaylist
struct UAthenaProfileStatsBase_NextPlaylist_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.GetUniqueID
struct UAthenaProfileStatsBase_GetUniqueID_Params
{
public:
	struct FUniqueNetIdRepl                      ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.GetCurrentStatSet
struct UAthenaProfileStatsBase_GetCurrentStatSet_Params
{
public:
	class UAthenaSeasonStats*                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaProfileStatsBase.GetCurrentPlaylistName
struct UAthenaProfileStatsBase_GetCurrentPlaylistName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.Setup
struct UAthenaProfileStatsRecentMatchesBase_Setup_Params
{
public:
	struct FUniqueNetIdRepl                      InUniqueId;                                        // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.OnStartFetchingData
struct UAthenaProfileStatsRecentMatchesBase_OnStartFetchingData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.OnRecentMatcheChanged
struct UAthenaProfileStatsRecentMatchesBase_OnRecentMatcheChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.OnProfileLoaded
struct UAthenaProfileStatsRecentMatchesBase_OnProfileLoaded_Params
{
public:
	class UFortMcpProfileAthenaStats*            ProfileAthenaStats;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.OnNoData
struct UAthenaProfileStatsRecentMatchesBase_OnNoData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.OnDataRecieved
struct UAthenaProfileStatsRecentMatchesBase_OnDataRecieved_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.GetUniqueID
struct UAthenaProfileStatsRecentMatchesBase_GetUniqueID_Params
{
public:
	struct FUniqueNetIdRepl                      ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaProfileStatsRecentMatchesBase.GetRecentMatches
struct UAthenaProfileStatsRecentMatchesBase_GetRecentMatches_Params
{
public:
	TArray<class UAthenaMatchStatView*>          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaProfileStatWidgetBase.SetStatView
struct UAthenaProfileStatWidgetBase_SetStatView_Params
{
public:
	class UAthenaBaseStatView*                   InStatView;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RespectParentStatView;                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_304A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatWidgetBase.SetAsStat
struct UAthenaProfileStatWidgetBase_SetAsStat_Params
{
public:
	struct FGameplayTag                          InStat;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaProfileStatWidgetBase.OnStatChanged
struct UAthenaProfileStatWidgetBase_OnStatChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaProfileStatWidgetBase.HandleStatViewChanged
struct UAthenaProfileStatWidgetBase_HandleStatViewChanged_Params
{
public:
	class UAthenaBaseStatView*                   StatView;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaProfileStatWidgetBase.CreateWeaponGroupData
struct UAthenaProfileStatWidgetBase_CreateWeaponGroupData_Params
{
public:
	int32                                        MaxToReturn;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIncludeOtherCategory;                             // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPercentages;                                      // 0x5(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_304B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStatGroupData>                ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaQuickBarNativeCell.SetItemToRepresent
struct UAthenaQuickBarNativeCell_SetItemToRepresent_Params
{
public:
	class UFortItem*                             InItemToRepresent;                                 // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaQuickBarNativeCell.SetIsSelected
struct UAthenaQuickBarNativeCell_SetIsSelected_Params
{
public:
	bool                                         bInSelected;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaQuickBarNativeCell.DesiredSizeOverride
struct UAthenaQuickBarNativeCell_DesiredSizeOverride_Params
{
public:
	float                                        WidthOverride;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeightOverride;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRebootCardIndicator.SetupCountdown
struct UAthenaRebootCardIndicator_SetupCountdown_Params
{
public:
	float                                        StartTimeLocalWorld;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EndTimeLocalWorld;                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRebootCardIndicator.HandleDisplayForSelf
struct UAthenaRebootCardIndicator_HandleDisplayForSelf_Params
{
public:
	bool                                         bSelf;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRebootChipDirective.UpdateSquadListDisplay
struct UAthenaRebootChipDirective_UpdateSquadListDisplay_Params
{
public:
	enum class EAthenaSquadListUpdateType        UpdateType;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3050[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerStateAthena*                PS;                                                // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRebootChipDirective.SetViewModel
struct UAthenaRebootChipDirective_SetViewModel_Params
{
public:
	class UAthenaPlayerViewModel*                InPlayerVM;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRebootVanIndicator.OnSpawnMachineStateChanged
struct UAthenaRebootVanIndicator_OnSpawnMachineStateChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.WeaponDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_WeaponDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                           WeaponParam;                                       // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.VehicleDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_VehicleDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    VehicleParam1;                                     // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    VehicleParam2;                                     // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.UpdatePlayerPawn
struct UAthenaRemotePlayerViewData_UpdatePlayerPawn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.UpdateDistanceToStorm
struct UAthenaRemotePlayerViewData_UpdateDistanceToStorm_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.UInt8Delegate__DelegateSignature
struct UAthenaRemotePlayerViewData_UInt8Delegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        IntParam;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3052[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.StringDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_StringDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StringParam;                                       // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.SetPlayerState
struct UAthenaRemotePlayerViewData_SetPlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.PlayerStateDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_PlayerStateDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.PawnDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_PawnDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                       PawnParam;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.LinearColorDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_LinearColorDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          ColorParam;                                        // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.IntDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_IntDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IntParam;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3053[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetVehicleMaxHealth
struct UAthenaRemotePlayerViewData_GetVehicleMaxHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetVehicleHealthPercent
struct UAthenaRemotePlayerViewData_GetVehicleHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetVehicleHealth
struct UAthenaRemotePlayerViewData_GetVehicleHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetVehicle
struct UAthenaRemotePlayerViewData_GetVehicle_Params
{
public:
	class AFortAthenaVehicle*                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetTeamColor
struct UAthenaRemotePlayerViewData_GetTeamColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetStormcapScore
struct UAthenaRemotePlayerViewData_GetStormcapScore_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetSquadId
struct UAthenaRemotePlayerViewData_GetSquadId_Params
{
public:
	uint8                                        ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetShieldPercent
struct UAthenaRemotePlayerViewData_GetShieldPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetPlayerUID
struct UAthenaRemotePlayerViewData_GetPlayerUID_Params
{
public:
	struct FUniqueNetIdRepl                      ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetPlayerState
struct UAthenaRemotePlayerViewData_GetPlayerState_Params
{
public:
	class AFortPlayerStateAthena*                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetPlayerPawn
struct UAthenaRemotePlayerViewData_GetPlayerPawn_Params
{
public:
	class AFortPlayerPawn*                       ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetPlayerName
struct UAthenaRemotePlayerViewData_GetPlayerName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetPlace
struct UAthenaRemotePlayerViewData_GetPlace_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetMaterialCount
struct UAthenaRemotePlayerViewData_GetMaterialCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetLocation
struct UAthenaRemotePlayerViewData_GetLocation_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetKillScore
struct UAthenaRemotePlayerViewData_GetKillScore_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsReplayRelevancyPlayer
struct UAthenaRemotePlayerViewData_GetIsReplayRelevancyPlayer_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsInRelevancy
struct UAthenaRemotePlayerViewData_GetIsInRelevancy_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsFollowedPlayer
struct UAthenaRemotePlayerViewData_GetIsFollowedPlayer_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsEliminated
struct UAthenaRemotePlayerViewData_GetIsEliminated_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsDrivingVehicle
struct UAthenaRemotePlayerViewData_GetIsDrivingVehicle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsDisconnected
struct UAthenaRemotePlayerViewData_GetIsDisconnected_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsDead
struct UAthenaRemotePlayerViewData_GetIsDead_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsDBNO
struct UAthenaRemotePlayerViewData_GetIsDBNO_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetIsBeingRevived
struct UAthenaRemotePlayerViewData_GetIsBeingRevived_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetInAircraft
struct UAthenaRemotePlayerViewData_GetInAircraft_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetHealthPercent
struct UAthenaRemotePlayerViewData_GetHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetDistanceToStorm
struct UAthenaRemotePlayerViewData_GetDistanceToStorm_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.GetCurrentWeapon
struct UAthenaRemotePlayerViewData_GetCurrentWeapon_Params
{
public:
	class AFortWeapon*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnWeaponChanged
struct UAthenaRemotePlayerViewData_ForwardOnWeaponChanged_Params
{
public:
	class AFortWeapon*                           InNewWeapon;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                           InPrevWeapon;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnVehicleStateChanged
struct UAthenaRemotePlayerViewData_ForwardOnVehicleStateChanged_Params
{
public:
	class AFortPlayerPawn*                       InPawn;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    InNewVehicle;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                    InOldVehicle;                                      // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnVehicleHealthChanged
struct UAthenaRemotePlayerViewData_ForwardOnVehicleHealthChanged_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnStormcapScoreChanged
struct UAthenaRemotePlayerViewData_ForwardOnStormcapScoreChanged_Params
{
public:
	float                                        InScore;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnSquadIdChanged
struct UAthenaRemotePlayerViewData_ForwardOnSquadIdChanged_Params
{
public:
	uint8                                        InSquadId;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnPlayerNameChanged
struct UAthenaRemotePlayerViewData_ForwardOnPlayerNameChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InPlayerName;                                      // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnPlaceChanged
struct UAthenaRemotePlayerViewData_ForwardOnPlaceChanged_Params
{
public:
	int32                                        InPlace;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnLocationChanged
struct UAthenaRemotePlayerViewData_ForwardOnLocationChanged_Params
{
public:
	class FString                                InLocation;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnKillScoreChanged
struct UAthenaRemotePlayerViewData_ForwardOnKillScoreChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3054[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnHitPointsStateChanged
struct UAthenaRemotePlayerViewData_ForwardOnHitPointsStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealthPercent;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShieldPercent;                                   // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnDisconnectedChanged
struct UAthenaRemotePlayerViewData_ForwardOnDisconnectedChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDisconnected;                                 // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3055[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnDeadStateChanged
struct UAthenaRemotePlayerViewData_ForwardOnDeadStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3056[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnDBNOStateChanged
struct UAthenaRemotePlayerViewData_ForwardOnDBNOStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDBNO;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3057[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewData.ForwardOnBeingRevivedStateChanged
struct UAthenaRemotePlayerViewData_ForwardOnBeingRevivedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsBeingRevived;                                 // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3058[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.FloatDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_FloatDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FloatParam;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3059[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemotePlayerViewData.BoolDelegate__DelegateSignature
struct UAthenaRemotePlayerViewData_BoolDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         BoolParam;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_305A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemotePlayerViewModel.OnFollowedPlayerChanged
struct UAthenaRemotePlayerViewModel_OnFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      NewFollowedPlayer;                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemoteSquadViewData.UInt8Delegate__DelegateSignature
struct UAthenaRemoteSquadViewData_UInt8Delegate__DelegateSignature_Params
{
public:
	class UAthenaRemoteSquadViewData*            SquadData;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        IntParam;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_305C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemoteSquadViewData.PlayerDelegate__DelegateSignature
struct UAthenaRemoteSquadViewData_PlayerDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemoteSquadViewData*            SquadData;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction FortniteUI.AthenaRemoteSquadViewData.LinearColorDelegate__DelegateSignature
struct UAthenaRemoteSquadViewData_LinearColorDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemoteSquadViewData*            SquadData;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          ColorParam;                                        // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaRemoteSquadViewData.IntDelegate__DelegateSignature
struct UAthenaRemoteSquadViewData_IntDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemoteSquadViewData*            SquadData;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IntParam;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_305D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.HandlePlayerPlaceChanged
struct UAthenaRemoteSquadViewData_HandlePlayerPlaceChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InPlace;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_305E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.HandlePlayerKillscoreChanged
struct UAthenaRemoteSquadViewData_HandlePlayerKillscoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_305F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.HandlePlayerDeadStateChanged
struct UAthenaRemoteSquadViewData_HandlePlayerDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InEliminated;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3060[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetSquadId
struct UAthenaRemoteSquadViewData_GetSquadId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetSquadColor
struct UAthenaRemoteSquadViewData_GetSquadColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetPlayerDatas
struct UAthenaRemoteSquadViewData_GetPlayerDatas_Params
{
public:
	TArray<class UAthenaRemotePlayerViewData*>   ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetPlace
struct UAthenaRemoteSquadViewData_GetPlace_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetKillScore
struct UAthenaRemoteSquadViewData_GetKillScore_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRemoteSquadViewData.GetIsEliminated
struct UAthenaRemoteSquadViewData_GetIsEliminated_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaRemoteSquadViewData.EventDelegate__DelegateSignature
struct UAthenaRemoteSquadViewData_EventDelegate__DelegateSignature_Params
{
public:
	class UAthenaRemoteSquadViewData*            SquadData;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaReplayActionFeedRowBase.OnRowDataSet
struct UAthenaReplayActionFeedRowBase_OnRowDataSet_Params
{
public:
	struct FAthenaReplayActionFeedRowData        RowData;                                           // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaReplayActionFeedScreenBase.OnRowProxiesUpdated
struct UAthenaReplayActionFeedScreenBase_OnRowProxiesUpdated_Params
{
public:
	TArray<class UAthenaReplayActionFeedRowProxyInstance*> RowProxies;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaReplayActionFeedScreenBase.OnReplayEventsUpdated
struct UAthenaReplayActionFeedScreenBase_OnReplayEventsUpdated_Params
{
public:
	TArray<struct FReplayEventInfo>              InReplayEvents;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserEntryWidget.OnReplayBrowserEntryDataSet
struct UAthenaReplayBrowserEntryWidget_OnReplayBrowserEntryDataSet_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaReplayBrowserEntryWidget.GetDateTimeText
struct UAthenaReplayBrowserEntryWidget_GetDateTimeText_Params
{
public:
	struct FDateTime                             DateTime;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.ShowDeleteInvalidDialog
struct UAthenaReplayBrowserScreenBase_ShowDeleteInvalidDialog_Params
{
public:
	class FText                                  Title;                                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  MESSAGE;                                           // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.SaveAndRenameReplay
struct UAthenaReplayBrowserScreenBase_SaveAndRenameReplay_Params
{
public:
	class UAthenaReplayBrowserRowProxyInstance*  RowProxy;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NewReplayName;                                     // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.RenameReplay
struct UAthenaReplayBrowserScreenBase_RenameReplay_Params
{
public:
	class UAthenaReplayBrowserRowProxyInstance*  RowProxy;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NewReplayName;                                     // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.PlayReplay
struct UAthenaReplayBrowserScreenBase_PlayReplay_Params
{
public:
	class UAthenaReplayBrowserRowProxyInstance*  RowProxy;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnSaveFailed
struct UAthenaReplayBrowserScreenBase_OnSaveFailed_Params
{
public:
	class FText                                  Reason;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnRowsUpdated
struct UAthenaReplayBrowserScreenBase_OnRowsUpdated_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnRenameFailed
struct UAthenaReplayBrowserScreenBase_OnRenameFailed_Params
{
public:
	class FText                                  Reason;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnRenameActionExecuted
struct UAthenaReplayBrowserScreenBase_OnRenameActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnRefreshActionExecuted
struct UAthenaReplayBrowserScreenBase_OnRefreshActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnPlayFailed
struct UAthenaReplayBrowserScreenBase_OnPlayFailed_Params
{
public:
	class FText                                  Reason;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnPlayActionExecuted
struct UAthenaReplayBrowserScreenBase_OnPlayActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnDeleteFailed
struct UAthenaReplayBrowserScreenBase_OnDeleteFailed_Params
{
public:
	class FText                                  Reason;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnDeleteActionExecuted
struct UAthenaReplayBrowserScreenBase_OnDeleteActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnBackActionExecuted
struct UAthenaReplayBrowserScreenBase_OnBackActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnActionStarted
struct UAthenaReplayBrowserScreenBase_OnActionStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.OnActionFinished
struct UAthenaReplayBrowserScreenBase_OnActionFinished_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.IsStreamingReplayViewEnabled
struct UAthenaReplayBrowserScreenBase_IsStreamingReplayViewEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.IsHandlingAction
struct UAthenaReplayBrowserScreenBase_IsHandlingAction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.DoesReplayFolderExist
struct UAthenaReplayBrowserScreenBase_DoesReplayFolderExist_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.DeleteReplay
struct UAthenaReplayBrowserScreenBase_DeleteReplay_Params
{
public:
	class UAthenaReplayBrowserRowProxyInstance*  RowProxy;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.DeleteInvalidReplays
struct UAthenaReplayBrowserScreenBase_DeleteInvalidReplays_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.BrowseToReplayFolder
struct UAthenaReplayBrowserScreenBase_BrowseToReplayFolder_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.AreExternalActionsOutstanding
struct UAthenaReplayBrowserScreenBase_AreExternalActionsOutstanding_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaReplayBrowserScreenBase.AreAnyActionsOutstanding
struct UAthenaReplayBrowserScreenBase_AreAnyActionsOutstanding_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaRespawnBase.UpdateAllUI
struct UAthenaRespawnBase_UpdateAllUI_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRespawnBase.OnUpdateRespawnState
struct UAthenaRespawnBase_OnUpdateRespawnState_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaRespawnBase.OnGamePhaseChanged
struct UAthenaRespawnBase_OnGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaScorePopWidgetBase.OnNewScoreEarned
struct UAthenaScorePopWidgetBase_OnNewScoreEarned_Params
{
public:
	int32                                        NewScoreValue;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3067[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  NewScoreTypeText;                                  // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        BigScoreThreshold;                                 // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3068[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaScorePopWidgetBase.HandleNewScoreEarned
struct UAthenaScorePopWidgetBase_HandleNewScoreEarned_Params
{
public:
	int32                                        NewPoints;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaScoringEvent               ScoreType;                                         // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3069[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectateMatchModalBase.JoinGameSession
struct UAthenaSpectateMatchModalBase_JoinGameSession_Params
{
public:
	class FString                                GameSessionIdStr;                                  // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectateMatchModalBase.JoinFriendSession
struct UAthenaSpectateMatchModalBase_JoinFriendSession_Params
{
public:
	class FString                                FriendName;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaSpectateMatchModalBase.IsGameSessionString
struct UAthenaSpectateMatchModalBase_IsGameSessionString_Params
{
public:
	class FString                                String;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_306A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectateMatchModalBase.GetFriendNames
struct UAthenaSpectateMatchModalBase_GetFriendNames_Params
{
public:
	TArray<class FString>                        FriendNames;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSpectateMatchModalBase.BuildFriendNameIdMap
struct UAthenaSpectateMatchModalBase_BuildFriendNameIdMap_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSpectatorBuildCountBase.UpdateBuildCount
struct UAthenaSpectatorBuildCountBase_UpdateBuildCount_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaSpectatorBuildCountBase.OnWorldItemListChanged
struct UAthenaSpectatorBuildCountBase_OnWorldItemListChanged_Params
{
public:
	TArray<class UFortWorldItem*>                ItemsAdded;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UFortWorldItem*>                ItemsRemoved;                                      // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorBuildCountBase.OnFollowedPlayerChanged
struct UAthenaSpectatorBuildCountBase_OnFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      NewFollowedPlayer;                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSpectatorBuildCountBase.OnBuildCountChanged
struct UAthenaSpectatorBuildCountBase_OnBuildCountChanged_Params
{
public:
	int32                                        NewBuildCount;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInChangedPlayer;                                  // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_306C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.SetPlayerData
struct UAthenaSpectatorHitPointBarBase_SetPlayerData_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnValueHealed
struct UAthenaSpectatorHitPointBarBase_OnValueHealed_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InValuePercent;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_306E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnValueDamaged
struct UAthenaSpectatorHitPointBarBase_OnValueDamaged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InValuePercent;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_306F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnEliminatedStateChanged
struct UAthenaSpectatorHitPointBarBase_OnEliminatedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsEliminated;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3070[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnDeltaValueChanged
struct UAthenaSpectatorHitPointBarBase_OnDeltaValueChanged_Params
{
public:
	float                                        InDeltaValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnDBNOStateChanged
struct UAthenaSpectatorHitPointBarBase_OnDBNOStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDBNO;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3071[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnDBNOChanged
struct UAthenaSpectatorHitPointBarBase_OnDBNOChanged_Params
{
public:
	bool                                         bInIsDBNO;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaSpectatorHitPointBarBase.OnCurrentValueChanged
struct UAthenaSpectatorHitPointBarBase_OnCurrentValueChanged_Params
{
public:
	float                                        InCurrentValue;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDControlsBase.OnFollowedPlayerChanged
struct UAthenaSpectatorHUDControlsBase_OnFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      NewFollowedPlayer;                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDControlsBase.OnCameraTypeChanged
struct UAthenaSpectatorHUDControlsBase_OnCameraTypeChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpectatorCameraType              NewCameraType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3075[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaSpectatorHUDControlsBase.CenterControls
struct UAthenaSpectatorHUDControlsBase_CenterControls_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSpectatorInventorySlotBase.SetItem
struct UAthenaSpectatorInventorySlotBase_SetItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorInventorySlotBase.SetIsSelected
struct UAthenaSpectatorInventorySlotBase_SetIsSelected_Params
{
public:
	bool                                         bIsSelected;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSpectatorInventorySlotBase.GetItem
struct UAthenaSpectatorInventorySlotBase_GetItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaSpectatorPlayerListBase.SortMethodDelegate__DelegateSignature
struct UAthenaSpectatorPlayerListBase_SortMethodDelegate__DelegateSignature_Params
{
public:
	enum class ESpectatorPlayerListSortMethod    SortMethodParam;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorPlayerListBase.SetSortMethod
struct UAthenaSpectatorPlayerListBase_SetSortMethod_Params
{
public:
	enum class ESpectatorPlayerListSortMethod    InNewSortMethod;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaSpectatorPlayerListBase.FocusListView
struct UAthenaSpectatorPlayerListBase_FocusListView_Params
{
public:
	class UAthenaRemotePlayerViewData*           ItemToFocus;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.SetSquadIdsVisible_BP
struct UAthenaSpectatorMapPlayerListBase_SetSquadIdsVisible_BP_Params
{
public:
	bool                                         bSquadIdsVisible;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.SetSquadIdsVisible
struct UAthenaSpectatorMapPlayerListBase_SetSquadIdsVisible_Params
{
public:
	bool                                         bSquadIdsVisible;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.OnToggleOnlyShowMapPlayersActionExecuted
struct UAthenaSpectatorMapPlayerListBase_OnToggleOnlyShowMapPlayersActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.OnSortByStateActionExecuted
struct UAthenaSpectatorMapPlayerListBase_OnSortByStateActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.OnSortBySquadIdActionExecuted
struct UAthenaSpectatorMapPlayerListBase_OnSortBySquadIdActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.OnSortByPlayerNameActionExecuted
struct UAthenaSpectatorMapPlayerListBase_OnSortByPlayerNameActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaSpectatorMapPlayerListBase.OnSortByEliminationsActionExecuted
