#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EBuildingReplacementType : uint8
{
	BRT_None                       = 0,
	BRT_Edited                     = 1,
	BRT_Upgrade                    = 2,
	BRT_MAX                        = 3,
};

enum class EFortAIDirectorEvent : uint8
{
	PlayerAIEnemies                = 0,
	PlayerTakeDamage               = 1,
	PlayerHealth                   = 2,
	PlayerDeath                    = 3,
	PlayerLookAtAIEnemy            = 4,
	PlayerDamageAIEnemy            = 5,
	PlayerKillAIEnemy              = 6,
	PlayerHealingPotential         = 7,
	PlayerAmmoLight                = 8,
	PlayerAmmoMedium               = 9,
	PlayerAmmoHeavy                = 10,
	PlayerAmmoShells               = 11,
	PlayerAmmoEnergy               = 12,
	PlayerAINear                   = 13,
	PlayerMovement                 = 14,
	ObjectiveTakeDamage            = 15,
	ObjectiveHealth                = 16,
	ObjectiveDestroyed             = 17,
	TrapFired                      = 18,
	TrapDamagedAIEnemy             = 19,
	ObjectivePathCost              = 20,
	PlayerPathCost                 = 21,
	ObjectiveNearbyBuildingDamaged = 22,
	Max_None                       = 23,
	EFortAIDirectorEvent_MAX       = 24,
};

enum class EFortCustomPartType : uint8
{
	Head                           = 0,
	Body                           = 1,
	Hat                            = 2,
	Backpack                       = 3,
	Charm                          = 4,
	Face                           = 5,
	NumTypes                       = 6,
	EFortCustomPartType_MAX        = 7,
};

enum class EFortDayPhase : uint8
{
	Morning                        = 0,
	Day                            = 1,
	Evening                        = 2,
	Night                          = 3,
	NumPhases                      = 4,
	EFortDayPhase_MAX              = 5,
};

enum class EFortInventoryType : uint8
{
	World                          = 0,
	Account                        = 1,
	Outpost                        = 2,
	MAX                            = 3,
};

enum class EOfferPurchaseError : uint8
{
	NoError                        = 0,
	PendingServerConfirmation      = 1,
	CannotAffordItem               = 2,
	InvalidOfferID                 = 3,
	InvalidPriceIndex              = 4,
	NoneLeft                       = 5,
	PurchaseAlreadyPending         = 6,
	NoConnection                   = 7,
	AccountNotEligible             = 8,
	CannotGiftItem                 = 9,
	MFANotEnabled                  = 10,
	EOfferPurchaseError_MAX        = 11,
};

enum class EFortAlteration : uint8
{
	AttributeSlot                  = 0,
	GameplaySlot                   = 1,
	ComplexCosmeticSlot            = 2,
	UserPickedCosmeticSlot         = 3,
	ColorSlot                      = 4,
	HeroSpecializationTier1Slot    = 5,
	HeroSpecializationTier2Slot    = 6,
	HeroSpecializationTier3Slot    = 7,
	HeroSpecializationTier4Slot    = 8,
	HeroSpecializationTier5Slot    = 9,
	EFortAlteration_MAX            = 10,
};

enum class EPlayerCompetitiveBanReasons : uint8
{
	None                           = 0,
	Cheating                       = 1,
	Collusion                      = 2,
	Toxicity                       = 3,
	Harassment                     = 4,
	Ringing                        = 5,
	Gambling                       = 6,
	Exploiting                     = 7,
	IntentionalDisconnect          = 8,
	Other                          = 9,
	AccountSharing                 = 10,
	CircumventingRegionLock        = 11,
	CircumventingBan               = 12,
	EPlayerCompetitiveBanReasons_MAX = 13,
};

enum class EPlayerBanReasons : uint8
{
	Teaming                        = 0,
	Afk_Leeching                   = 1,
	Harassment                     = 2,
	TradeScamming                  = 3,
	Exploiting                     = 4,
	Competitive                    = 5,
	EPlayerBanReasons_MAX          = 6,
};

enum class EFortItemType : uint8
{
	WorldItem                      = 0,
	Ammo                           = 1,
	Badge                          = 2,
	BackpackPickup                 = 3,
	BuildingPiece                  = 4,
	CharacterPart                  = 5,
	Consumable                     = 6,
	Deco                           = 7,
	EditTool                       = 8,
	Ingredient                     = 9,
	ItemCache                      = 10,
	Food                           = 11,
	Gadget                         = 12,
	AthenaGadget                   = 13,
	HomebaseGadget                 = 14,
	HeroAbility                    = 15,
	MissionItem                    = 16,
	Trap                           = 17,
	Weapon                         = 18,
	WeaponMelee                    = 19,
	WeaponRanged                   = 20,
	WeaponHarvest                  = 21,
	WeaponCreativePhone            = 22,
	WorldResource                  = 23,
	AccountItem                    = 24,
	AccountResource                = 25,
	CollectedResource              = 26,
	Alteration                     = 27,
	CardPack                       = 28,
	Currency                       = 29,
	Hero                           = 30,
	Schematic                      = 31,
	Worker                         = 32,
	TeamPerk                       = 33,
	Token                          = 34,
	DailyRewardScheduleToken       = 35,
	CodeToken                      = 36,
	Stat                           = 37,
	Buff                           = 38,
	BuffCredit                     = 39,
	Quest                          = 40,
	ChallengeBundle                = 41,
	ChallengeBundleSchedule        = 42,
	GameplayModifier               = 43,
	Outpost                        = 44,
	HomebaseNode                   = 45,
	Defender                       = 46,
	ConversionControl              = 47,
	DeployableBaseCloudSave        = 48,
	ConsumableAccountItem          = 49,
	Quota                          = 50,
	Expedition                     = 51,
	HomebaseBannerIcon             = 52,
	HomebaseBannerColor            = 53,
	AthenaSkyDiveContrail          = 54,
	PersonalVehicle                = 55,
	AthenaGlider                   = 56,
	AthenaPickaxe                  = 57,
	AthenaHat                      = 58,
	AthenaBackpack                 = 59,
	AthenaCharacter                = 60,
	AthenaDance                    = 61,
	AthenaConsumableEmote          = 62,
	AthenaLoadingScreen            = 63,
	AthenaBattleBus                = 64,
	AthenaVehicleCosmetic          = 65,
	AthenaItemWrap                 = 66,
	AthenaCallingCard              = 67,
	AthenaMapMarker                = 68,
	AthenaMusicPack                = 69,
	AthenaPetCosmetic              = 70,
	AthenaVictoryPose              = 71,
	AthenaSeasonTreasure           = 72,
	AthenaSeason                   = 73,
	EventDescription               = 74,
	MatchAward                     = 75,
	AthenaEventToken               = 76,
	EventPurchaseTracker           = 77,
	CosmeticVariantToken           = 78,
	Stamp                          = 79,
	CampaignHeroLoadout            = 80,
	Playset                        = 81,
	PrerollData                    = 82,
	CreativePlot                   = 83,
	PlayerSurveyToken              = 84,
	SpecialItem                    = 85,
	Emote                          = 86,
	Stack                          = 87,
	CollectionBookPage             = 88,
	BGAConsumableWrapper           = 89,
	GiftBox                        = 90,
	Profile                        = 91,
	Max_None                       = 92,
	EFortItemType_MAX              = 93,
};

enum class EAthenaTravelLogPlayerType : uint8
{
	Self                           = 0,
	Ally                           = 1,
	Enemy                          = 2,
	Invalid                        = 3,
	EAthenaTravelLogPlayerType_MAX = 4,
};

enum class EAthenaTravelEventType : uint8
{
	GroundMove                     = 0,
	AirMove                        = 1,
	BattleBusJump                  = 2,
	LaunchJump                     = 3,
	Landed                         = 4,
	OpenChest                      = 5,
	OpenAmmo                       = 6,
	GotAssist                      = 7,
	GotKnockdown                   = 8,
	GotKill                        = 9,
	PlayerDowned                   = 10,
	PlayerDied                     = 11,
	Won                            = 12,
	DealtDamage                    = 13,
	HealthChange                   = 14,
	GotItem                        = 15,
	DroppedItem                    = 16,
	ShieldChange                   = 17,
	WeaponExecuted                 = 18,
	EnteredVehicle                 = 19,
	ExitedVehicle                  = 20,
	TrapBuilt                      = 21,
	UsedItem                       = 22,
	ZoneUpdate                     = 23,
	PlacedBuilding                 = 24,
	Count                          = 25,
	EAthenaTravelEventType_MAX     = 26,
};

enum class ERewardSource : uint8
{
	Invalid                        = 0,
	MinutesPlayed                  = 1,
	FirstKill                      = 2,
	TeamKills                      = 3,
	FirstRevive                    = 4,
	AdditionalRevives              = 5,
	Placement                      = 6,
	Medals                         = 7,
	FirstWin                       = 8,
	SeasonLevelUp                  = 9,
	BookLevelUp                    = 10,
	MAX_COUNT                      = 11,
	ERewardSource_MAX              = 12,
};

enum class EAthenaMatchXpMultiplierSource : uint8
{
	Invalid                        = 0,
	BattlePassSelf                 = 1,
	BattlePassFriends              = 2,
	CosmeticSet                    = 3,
	AntiAddictionPenalty           = 4,
	BonusXpEvent                   = 5,
	MAX_COUNT                      = 6,
	EAthenaMatchXpMultiplierSource_MAX = 7,
};

enum class EKeepDefenseState : uint8
{
	Inactive                       = 0,
	Warmup                         = 1,
	Defense                        = 2,
	LastAlive                      = 3,
	Max                            = 4,
};

enum class ECampaignCustomizationCategory : uint8
{
	None                           = 0,
	PersonalVehicle                = 1,
	ECampaignCustomizationCategory_MAX = 2,
};

enum class EVolumeState : uint8
{
	Uninitialized                  = 0,
	ReadOnly                       = 1,
	Initializing                   = 2,
	Ready                          = 3,
	EVolumeState_MAX               = 4,
};

enum class EAthenaScoringEvent : uint8
{
	None                           = 0,
	Elimination                    = 1,
	ChestOpened                    = 2,
	AmmoCanOpened                  = 3,
	SupplyDropOpened               = 4,
	SupplyLlamaOpened              = 5,
	ForagedItemConsumed            = 6,
	SurvivalInMinutes              = 7,
	CollectedCoinBronze            = 8,
	CollectedCoinSilver            = 9,
	CollectedCoinGold              = 10,
	AIKilled                       = 11,
	EAthenaScoringEvent_MAX        = 12,
};

enum class EFortVoteStatus : uint8
{
	Begin                          = 0,
	Update                         = 1,
	End                            = 2,
	BeginLockout                   = 3,
	EndLockout                     = 4,
	EFortVoteStatus_MAX            = 5,
};

enum class EFortVoteType : uint8
{
	SurvivalVote                   = 0,
	DifficultyIncrease             = 1,
	MissionActivation              = 2,
	ContinueOrExtract              = 3,
	EFortVoteType_MAX              = 4,
};

enum class EFortQuickBars : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Creative                       = 2,
	Max_None                       = 3,
	EFortQuickBars_MAX             = 4,
};

enum class EAthenaCustomizationCategory : uint8
{
	None                           = 0,
	Glider                         = 1,
	Pickaxe                        = 2,
	Hat                            = 3,
	Backpack                       = 4,
	Character                      = 5,
	LoadingScreen                  = 6,
	BattleBus                      = 7,
	VehicleDecoration              = 8,
	CallingCard                    = 9,
	MapMarker                      = 10,
	Dance                          = 11,
	ConsumableEmote                = 12,
	VictoryPose                    = 13,
	SkyDiveContrail                = 14,
	MusicPack                      = 15,
	ItemWrap                       = 16,
	PetSkin                        = 17,
	MAX                            = 18,
};

enum class EStatCategory : uint8
{
	Combat                         = 0,
	Building                       = 1,
	Utility                        = 2,
	Max_None                       = 3,
	EStatCategory_MAX              = 4,
};

enum class EFortResourceType : uint8
{
	Wood                           = 0,
	Stone                          = 1,
	Metal                          = 2,
	Permanite                      = 3,
	None                           = 4,
	EFortResourceType_MAX          = 5,
};

enum class ERichPresenceStateChange : uint8
{
	AutoUpdate                     = 0,
	Idle                           = 1,
	Active                         = 2,
	Busy                           = 3,
	NotBusy                        = 4,
	ERichPresenceStateChange_MAX   = 5,
};

enum class ESubGame : uint8
{
	Campaign                       = 0,
	Athena                         = 1,
	Invalid                        = 2,
	Count                          = 2,
	ESubGame_MAX                   = 3,
};

enum class ELockOnState : uint8
{
	NoTarget                       = 0,
	TargetAcquired                 = 1,
	LockingOnToTarget              = 2,
	TargetLockedOn                 = 3,
	Cooldown                       = 4,
	COUNT                          = 5,
	ELockOnState_MAX               = 6,
};

enum class EStatMod : uint8
{
	Delta                          = 0,
	Set                            = 1,
	Maximum                        = 2,
	EStatMod_MAX                   = 3,
};

enum class EFortDamageZone : uint8
{
	Light                          = 0,
	Normal                         = 1,
	Critical                       = 2,
	Vulnerability                  = 3,
	Max                            = 4,
};

enum class EFortItemTier : uint8
{
	No_Tier                        = 0,
	I                              = 1,
	II                             = 2,
	III                            = 3,
	IV                             = 4,
	V                              = 5,
	VI                             = 6,
	VII                            = 7,
	VIII                           = 8,
	IX                             = 9,
	X                              = 10,
	NumItemTierValues              = 11,
	EFortItemTier_MAX              = 12,
};

enum class EFortResourceLevel : uint8
{
	First                          = 0,
	Second                         = 1,
	Third                          = 2,
	Fourth                         = 3,
	Fifth                          = 4,
	Sixth                          = 5,
	NumLevels                      = 6,
	Invalid                        = 7,
	EFortResourceLevel_MAX         = 8,
};

enum class EFortItemEntryState : uint8
{
	NoneState                      = 0,
	NewItemCount                   = 1,
	ShouldShowItemToast            = 2,
	DurabilityInitialized          = 3,
	DoNotShowSpawnParticles        = 4,
	FromRecoveredBackpack          = 5,
	FromGift                       = 6,
	PendingUpgradeCriteriaProgress = 7,
	OwnerBuildingHandle            = 8,
	FromDroppedPickup              = 9,
	JustCrafted                    = 10,
	CraftAndSlotTarget             = 11,
	GenericAttributeValueSet       = 12,
	EFortItemEntryState_MAX        = 13,
};

enum class EFortRequestedGameplayAction : uint8
{
	ContinuePlaying                = 0,
	StartPlaying                   = 1,
	StopPlaying                    = 2,
	EnterZone                      = 3,
	LeaveZone                      = 4,
	ReturnToMainMenu               = 5,
	QuitGame                       = 6,
	Invalid                        = 7,
	EFortRequestedGameplayAction_MAX = 8,
};

enum class EFortGameplayState : uint8
{
	NormalGameplay                 = 0,
	WaitingToStart                 = 1,
	EndOfZone                      = 2,
	EnteringZone                   = 3,
	LeavingZone                    = 4,
	Invalid                        = 5,
	EFortGameplayState_MAX         = 6,
};

enum class EFortCombatEvents : uint8
{
	HuskFollowing                  = 0,
	SmasherFollowing               = 1,
	TrollFollowing                 = 2,
	FlingerFollowing               = 3,
	TakerFollowing                 = 4,
	HuskCombatNearby               = 5,
	SmasherCombatNearby            = 6,
	TrollCombatNearby              = 7,
	FlingerCombatNearby            = 8,
	TakerCombatNearby              = 9,
	PlayerTakeDamage               = 10,
	PlayerHealth                   = 11,
	PlayerLookAtEnemy              = 12,
	PlayerDamageEnemy              = 13,
	PlayerKilledEnemy              = 14,
	AtlasTakeDamage                = 15,
	AtlasHealth                    = 16,
	AtlasDestroyed                 = 17,
	TrapFiring                     = 18,
	BuildingTakeDamage             = 19,
	FoodHealingPotential           = 20,
	PlayerAmmo                     = 21,
	EnemiesNear                    = 22,
	PlayerMovement                 = 23,
	BuildingDamagedNearObjective   = 24,
	TrapDamageEnemy                = 25,
	ObjectivePathCost              = 26,
	PlayerPathCost                 = 27,
	Max_None                       = 28,
	EFortCombatEvents_MAX          = 29,
};

enum class EBuildingHighlightType : uint8
{
	Primary                        = 0,
	Interact                       = 1,
	WillBeDestroyed                = 2,
	Quest                          = 3,
	MAX_None                       = 4,
	EBuildingHighlightType_MAX     = 5,
};

enum class EFortJumpStaminaCost : uint8
{
	None                           = 0,
	Trigger                        = 1,
	SprintTrigger                  = 2,
	SprintAir                      = 3,
	EFortJumpStaminaCost_MAX       = 4,
};

enum class EFortPCTutorialCompletedState : uint8
{
	Unknown                        = 0,
	Incomplete                     = 1,
	Complete                       = 2,
	EFortPCTutorialCompletedState_MAX = 3,
};

enum class EFortCompletionResult : uint8
{
	Win                            = 0,
	Loss                           = 1,
	Draw                           = 2,
	Undefined                      = 3,
	EFortCompletionResult_MAX      = 4,
};

enum class EFortRewardActivityType : uint8
{
	General                        = 0,
	MissionPrimary                 = 1,
	MissionSecondary               = 2,
	AccountLevelUp                 = 3,
	Max_None                       = 4,
	EFortRewardActivityType_MAX    = 5,
};

enum class EFortDelayedQuickBarAction : uint8
{
	Add                            = 0,
	Remove                         = 1,
	Replace                        = 2,
	Invalid                        = 3,
	EFortDelayedQuickBarAction_MAX = 4,
};

enum class EFortElementalDamageType : uint8
{
	None                           = 0,
	Fire                           = 1,
	Ice                            = 2,
	Lightning                      = 3,
	Energy                         = 4,
	MAX                            = 5,
};

enum class EFortDamageNumberType : uint8
{
	None                           = 0,
	Pawn                           = 1,
	Building                       = 2,
	Player                         = 3,
	Shield                         = 4,
	Score                          = 5,
	DBNO                           = 6,
	EFortDamageNumberType_MAX      = 7,
};

enum class EFortCostInfoTypes : uint8
{
	Placement                      = 0,
	Repair                         = 1,
	Conversion                     = 2,
	Ability                        = 3,
	None                           = 4,
	EFortCostInfoTypes_MAX         = 5,
};

enum class EFortBuildPreviewMarkerOptionalAdjustment : uint8
{
	None                           = 0,
	FreeWallPieceOnTop             = 1,
	FreeWallPieceOnBottom          = 2,
	EFortBuildPreviewMarkerOptionalAdjustment_MAX = 3,
};

enum class EFortIsFinalXpUpdate : uint8
{
	Uninitialized                  = 0,
	NotFinal                       = 1,
	Final                          = 2,
	EFortIsFinalXpUpdate_MAX       = 3,
};

enum class EFortTeam : uint8
{
	Spectator                      = 0,
	HumanCampaign                  = 1,
	Monster                        = 2,
	HumanPvP_Team1                 = 3,
	HumanPvP_Team2                 = 4,
	MAX                            = 255,
};

enum class EFortVoteArbitratorType : uint8
{
	Invalid                        = 0,
	Majority                       = 1,
	Unanimous                      = 2,
	EFortVoteArbitratorType_MAX    = 3,
};

enum class EAthenaGamePhase : uint8
{
	None                           = 0,
	Setup                          = 1,
	Warmup                         = 2,
	Aircraft                       = 3,
	SafeZones                      = 4,
	EndGame                        = 5,
	Count                          = 6,
	EAthenaGamePhase_MAX           = 7,
};

enum class EAthenaGamePhaseStep : uint8
{
	None                           = 0,
	Setup                          = 1,
	Warmup                         = 2,
	GetReady                       = 3,
	BusLocked                      = 4,
	BusFlying                      = 5,
	StormForming                   = 6,
	StormHolding                   = 7,
	StormShrinking                 = 8,
	Countdown                      = 9,
	FinalCountdown                 = 10,
	EndGame                        = 11,
	Count                          = 12,
	EAthenaGamePhaseStep_MAX       = 13,
};

enum class EAthenaStormCapState : uint8
{
	None                           = 0,
	Clear                          = 1,
	Warning                        = 2,
	Damaging                       = 3,
	EAthenaStormCapState_MAX       = 4,
};

enum class EAthenaGameMsgType : uint8
{
	None                           = 0,
	DefaultIntro                   = 1,
	DefaultMessage                 = 2,
	DefaultCriticalMessage         = 3,
	CommIntro                      = 4,
	CommMessage                    = 5,
	CommCriticalMessage            = 6,
	CornerIntro                    = 7,
	CornerMessage                  = 8,
	CornerCriticalMessage          = 9,
	RespawnTurningOffWarning       = 10,
	RespawnOffWarning              = 11,
	CenterMessage                  = 12,
	CenterImportantMessage         = 13,
	CenterCriticalMessage          = 14,
	EAthenaGameMsgType_MAX         = 15,
};

enum class EWaveRules : uint8
{
	KillAllEnemies                 = 0,
	Timed                          = 1,
	KillPoints                     = 2,
	KillSpecificEnemy              = 3,
	Mission                        = 4,
	EWaveRules_MAX                 = 5,
};

enum class EAthenaAerialPhase : uint8
{
	None                           = 0,
	BusCantExit                    = 1,
	BusCanExit                     = 2,
	BusCanExitEndZebulonDrone      = 3,
	Skydiving                      = 4,
	Parachuting                    = 5,
	EAthenaAerialPhase_MAX         = 6,
};

enum class EFortPlaylistType : uint8
{
	Default                        = 0,
	Playground                     = 1,
	Creative                       = 2,
	Creative_LTM                   = 3,
	EFortPlaylistType_MAX          = 4,
};

enum class ESpawnMachineState : uint8
{
	Default                        = 0,
	WaitingForUse                  = 1,
	Active                         = 2,
	Complete                       = 3,
	OnCooldown                     = 4,
	ESpawnMachineState_MAX         = 5,
};

enum class ESafeZoneStartUp : uint8
{
	UseDefaultGameBehavior         = 0,
	StartsWithWarmUp               = 1,
	StartsWithAirCraft             = 2,
	ESafeZoneStartUp_MAX           = 3,
};

enum class EFriendlyFireType : uint8
{
	Off                            = 0,
	On                             = 1,
	EFriendlyFireType_MAX          = 2,
};

enum class EAirCraftBehavior : uint8
{
	Default                        = 0,
	OpposingAirCraftForEachTeam    = 1,
	FlyTowardFirstCircleCenter     = 2,
	NoAircraft                     = 3,
	EAirCraftBehavior_MAX          = 4,
};

enum class EFortReportDayPhase : uint8
{
	Dawn                           = 0,
	Dusk                           = 1,
	ZoneFinished                   = 2,
	PlayerLogout                   = 3,
	EFortReportDayPhase_MAX        = 4,
};

enum class EFortPvPGameResult : uint8
{
	Win                            = 0,
	Loss                           = 1,
	Draw                           = 2,
	EFortPvPGameResult_MAX         = 3,
};

enum class EEndOfMatchReason : uint8
{
	LastManStanding                = 0,
	ScoreReached                   = 1,
	TimeRanOut                     = 2,
	WinEventOccurred               = 3,
	AllLoggedOut                   = 4,
	AllEliminated                  = 5,
	EEndOfMatchReason_MAX          = 6,
};

enum class EDeathCause : uint8
{
	OutsideSafeZone                = 0,
	FallDamage                     = 1,
	Pistol                         = 2,
	Shotgun                        = 3,
	Rifle                          = 4,
	SMG                            = 5,
	Sniper                         = 6,
	SniperNoScope                  = 7,
	Melee                          = 8,
	InfinityBlade                  = 9,
	Grenade                        = 10,
	C4                             = 11,
	GrenadeLauncher                = 12,
	RocketLauncher                 = 13,
	Minigun                        = 14,
	Bow                            = 15,
	Trap                           = 16,
	DBNOTimeout                    = 17,
	Banhammer                      = 18,
	RemovedFromGame                = 19,
	MassiveMelee                   = 20,
	MassiveDiveBomb                = 21,
	MassiveRanged                  = 22,
	Vehicle                        = 23,
	ShoppingCart                   = 24,
	ATK                            = 25,
	QuadCrasher                    = 26,
	Biplane                        = 27,
	BiplaneGun                     = 28,
	LMG                            = 29,
	GasGrenade                     = 30,
	InstantEnvironmental           = 31,
	Turret                         = 32,
	ShipCannon                     = 33,
	Cube                           = 34,
	Balloon                        = 35,
	StormSurge                     = 36,
	Lava                           = 37,
	BasicFiend                     = 38,
	EliteFiend                     = 39,
	RangedFiend                    = 40,
	BasicBrute                     = 41,
	EliteBrute                     = 42,
	MegaBrute                      = 43,
	SilentSwitchingToSpectate      = 44,
	LoggedOut                      = 45,
	TeamSwitchSuicide              = 46,
	WonMatch                       = 47,
	Unspecified                    = 48,
	EDeathCause_MAX                = 49,
};

enum class EFortBuildingType : uint8
{
	Wall                           = 0,
	Floor                          = 1,
	Corner                         = 2,
	Deco                           = 3,
	Prop                           = 4,
	Stairs                         = 5,
	Roof                           = 6,
	Pillar                         = 7,
	SpawnedItem                    = 8,
	Container                      = 9,
	Trap                           = 10,
	GenericCenterCellActor         = 11,
	None                           = 12,
	EFortBuildingType_MAX          = 13,
};

enum class EForceKickAfterDeathMode : uint8
{
	Disabled                       = 0,
	KickAll                        = 1,
	KickPrivate                    = 2,
	EForceKickAfterDeathMode_MAX   = 3,
};

enum class ECapturePointState : uint8
{
	Idle                           = 0,
	Capturing                      = 1,
	Contested                      = 2,
	Resetting                      = 3,
	Captured                       = 4,
	Reset                          = 5,
	ECapturePointState_MAX         = 6,
};

enum class EBackupSaveState : uint8
{
	Ready                          = 0,
	InProgress                     = 1,
	OnCooldown                     = 2,
	EBackupSaveState_MAX           = 3,
};

enum class EPropertyOverrideTargetType : uint8
{
	None                           = 0,
	Default                        = 1,
	ImmutableTarget                = 2,
	EPropertyOverrideTargetType_MAX = 3,
};

enum class EHudVisibilityState : uint8
{
	FullyVisible                   = 0,
	FullyHidden                    = 1,
	GameOnly                       = 2,
	ReplayOnly                     = 3,
	MAX                            = 4,
};

enum class EFortReplayEventType : uint8
{
	Elimination                    = 0,
	Eliminated                     = 1,
	DBNO                           = 2,
	UserPlaced                     = 3,
	MAX                            = 4,
};

enum class ESpectatorCameraType : uint8
{
	ThirdPerson                    = 0,
	DroneFree                      = 1,
	Gameplay                       = 2,
	ReverseShot                    = 3,
	FollowShot                     = 4,
	DroneFollow                    = 5,
	DroneAttach                    = 6,
	MAX                            = 7,
};

enum class ECaptureState : uint8
{
	CS_Idle                        = 0,
	CS_Capturing                   = 1,
	CS_Contested                   = 2,
	CS_Resetting                   = 3,
	CS_Captured                    = 4,
	CS_Reset                       = 5,
	CS_MAX                         = 6,
};

enum class EFOBIOStatus : uint8
{
	Saving                         = 0,
	Loading                        = 1,
	Free                           = 2,
	EFOBIOStatus_MAX               = 3,
};

enum class EFortMinigameState : uint8
{
	PreGame                        = 0,
	Setup                          = 1,
	Transitioning                  = 2,
	WaitingForCameras              = 3,
	Warmup                         = 4,
	InProgress                     = 5,
	PostRoundEnd                   = 6,
	PostGameEnd                    = 7,
	PostGameAbandon                = 8,
	PostGameReset                  = 9,
	EFortMinigameState_MAX         = 10,
};

enum class ECollectionBookRewardType : uint8
{
	Uninitialized                  = 0,
	Book                           = 1,
	Page                           = 2,
	Section                        = 3,
	ECollectionBookRewardType_MAX  = 4,
};

enum class EFortPrototypingStatus : uint8
{
	Unknown                        = 0,
	Disabled                       = 1,
	Enabled                        = 2,
	EFortPrototypingStatus_MAX     = 3,
};

enum class EFortObjectiveStatus : uint8
{
	Created                        = 0,
	InProgress                     = 1,
	Succeeded                      = 2,
	Failed                         = 3,
	NeutralCompletion              = 4,
	Max_None                       = 5,
	EFortObjectiveStatus_MAX       = 6,
};

enum class EFortMissionVisibilityOverride : uint8
{
	Visible                        = 0,
	Invisible                      = 1,
	Max_None                       = 2,
	EFortMissionVisibilityOverride_MAX = 3,
};

enum class EMatchmakingCompleteResult : uint8
{
	NotStarted                     = 0,
	UpdateNeeded                   = 1,
	OutpostNotFound                = 2,
	Cancelled                      = 3,
	NoResults                      = 4,
	Failure                        = 5,
	CreateFailure                  = 6,
	Success                        = 7,
	EMatchmakingCompleteResult_MAX = 8,
};

enum class EMatchmakingState : uint8
{
	NotMatchmaking                 = 0,
	CancelingMatchmaking           = 1,
	ReleasingLock                  = 2,
	AcquiringLock                  = 3,
	LockAcquistionFailure          = 4,
	FindingEmptyServer             = 5,
	FindingExistingSession         = 6,
	TestingEmptyServers            = 7,
	TestingExistingSessions        = 8,
	JoiningExistingSession         = 9,
	NoMatchesAvailable             = 10,
	CleaningUpExisting             = 11,
	HandlingFailure                = 12,
	JoinSuccess                    = 13,
	EMatchmakingState_MAX          = 14,
};

enum class EAthenaPartyMemberReadyType : uint8
{
	Ready                          = 0,
	NotReady                       = 1,
	Playing                        = 2,
	WatchingReplay                 = 3,
	EAthenaPartyMemberReadyType_MAX = 4,
};

enum class EFortFriendRequestStatus : uint8
{
	None                           = 0,
	Accepted                       = 1,
	PendingReceived                = 2,
	PendingSent                    = 3,
	EFortFriendRequestStatus_MAX   = 4,
};

enum class EFortPartyMemberLocation : uint8
{
	PreLobby                       = 0,
	ConnectingToLobby              = 1,
	Lobby                          = 2,
	JoiningGame                    = 3,
	ProcessingRejoin               = 4,
	InGame                         = 5,
	WatchingReplay                 = 6,
	ReturningToFrontEnd            = 7,
	EFortPartyMemberLocation_MAX   = 8,
};

enum class EFortPartyState : uint8
{
	Undetermined                   = 0,
	WorldView                      = 1,
	TheaterView                    = 2,
	Matchmaking                    = 3,
	PostMatchmaking                = 4,
	ReturningToFrontEnd            = 5,
	BattleRoyaleView               = 6,
	BattleRoyalePreloading         = 7,
	BattleRoyaleMatchmaking        = 8,
	BattleRoyalePostMatchmaking    = 9,
	EFortPartyState_MAX            = 10,
};

enum class EFortPartyMemberDisplayState : uint8
{
	Open                           = 0,
	Connecting                     = 1,
	Connected                      = 2,
	Max                            = 3,
};

enum class EFortRuntimeOptionTabState : uint8
{
	Default                        = 0,
	Disabled                       = 1,
	Hidden                         = 2,
	EFortRuntimeOptionTabState_MAX = 3,
};

enum class ENewsExternalURLMode : uint8
{
	PatchNotes                     = 0,
	UpdateNotes                    = 1,
	MoreInformation                = 2,
	ENewsExternalURLMode_MAX       = 3,
};

enum class EFortSpectatorBlendType : uint8
{
	None                           = 0,
	Orbit                          = 1,
	Default                        = 2,
	EFortSpectatorBlendType_MAX    = 3,
};

enum class EFortPlayerSurveyFinishReason : uint8
{
	Submitted                      = 0,
	Canceled                       = 1,
	Disallowed                     = 2,
	EFortPlayerSurveyFinishReason_MAX = 3,
};

enum class EFortDialogFeedbackType : uint8
{
	FriendRequestSent              = 0,
	FriendRequestReceived          = 1,
	FriendRequestAccepted          = 2,
	Default                        = 3,
	EFortDialogFeedbackType_MAX    = 4,
};

enum class EHitTraceRule : uint8
{
	Visibility                     = 0,
	Terrain                        = 1,
	None                           = 2,
	EHitTraceRule_MAX              = 3,
};

enum class ETransformationType : uint8
{
	Translation                    = 0,
	Rotation                       = 1,
	Scale                          = 2,
	None                           = 3,
	ETransformationType_MAX        = 4,
};

enum class EScaleAxis : uint8
{
	All                            = 0,
	X                              = 1,
	Y                              = 2,
	Z                              = 3,
	EScaleAxis_MAX                 = 4,
};

enum class ESelectionProperty : uint8
{
	SingleObject                   = 0,
	MultipleObjects                = 1,
	MultipleObjectsMoveOnGrid      = 2,
	None                           = 3,
	ESelectionProperty_MAX         = 4,
};

enum class EDualWeaponHand : uint8
{
	LEFT                           = 0,
	RIGHT                          = 1,
	MAX                            = 2,
};

enum class EFortEncounterDirection : uint8
{
	North                          = 0,
	NorthEast                      = 1,
	East                           = 2,
	SouthEast                      = 3,
	South                          = 4,
	SouthWest                      = 5,
	West                           = 6,
	NorthWest                      = 7,
	Max_None                       = 8,
	EFortEncounterDirection_MAX    = 9,
};

enum class EAIHotSpotAssignmentFilter : uint8
{
	All                            = 0,
	WithSlots                      = 1,
	WaitingList                    = 2,
	EAIHotSpotAssignmentFilter_MAX = 3,
};

enum class EAIHotSpotSlotFilter : uint8
{
	All                            = 0,
	AvailableOnly                  = 1,
	UnavailableOnly                = 2,
	EAIHotSpotSlotFilter_MAX       = 3,
};

enum class EAIHotSpotSlot : uint8
{
	Free                           = 0,
	Claimed                        = 1,
	Occupied                       = 2,
	Blocked                        = 3,
	Disabled                       = 4,
	EAIHotSpotSlot_MAX             = 5,
};

enum class EBoundingBoxSlotDirectionCalculation : uint8
{
	Auto                           = 0,
	FaceWall                       = 1,
	FaceAwayFromWall               = 2,
	FaceCenter                     = 3,
	EBoundingBoxSlotDirectionCalculation_MAX = 4,
};

enum class EBarrierFlagState : uint8
{
	FlagUp                         = 0,
	FlagDown                       = 1,
	EBarrierFlagState_MAX          = 2,
};

enum class EBarrierState : uint8
{
	BarrierUp                      = 0,
	BarrierComingDown              = 1,
	BarrierDown                    = 2,
	EBarrierState_MAX              = 3,
};

enum class EAthenaBroadcastKillFeedEntryType : uint8
{
	Elimination                    = 0,
	Storm                          = 1,
	FallDamage                     = 2,
	Explosion                      = 3,
	DBNO                           = 4,
	Revive                         = 5,
	EAthenaBroadcastKillFeedEntryType_MAX = 6,
};

enum class ECapturePointUnlockRules : uint8
{
	Reset                          = 0,
	MaintainState                  = 1,
	ResetDeactivate                = 2,
	ECapturePointUnlockRules_MAX   = 3,
};

enum class EContentionRuleType : uint8
{
	MajorityWins                   = 0,
	OneTeamOnlyWins                = 1,
	EContentionRuleType_MAX        = 2,
};

enum class EEventTokenType : uint8
{
	Invite                         = 0,
	Creation                       = 1,
	EEventTokenType_MAX            = 2,
};

enum class EGoosePickupState : uint8
{
	None                           = 0,
	Falling                        = 1,
	Deployed                       = 2,
	ImpactedByPlane                = 3,
	DeployTimerUp                  = 4,
	EGoosePickupState_MAX          = 5,
};

enum class EItemWrapSectionNames : uint8
{
	Section_0                      = 0,
	Section_1                      = 1,
	Section_2                      = 2,
	Section_3                      = 3,
	Section_4                      = 4,
	Section_5                      = 5,
	Section_6                      = 6,
	Section_7                      = 7,
	Section_8                      = 8,
	Section_9                      = 9,
	Section_10                     = 10,
	Section_11                     = 11,
	Section_12                     = 12,
	Section_13                     = 13,
	Section_14                     = 14,
	Section_15                     = 15,
	Section_16                     = 16,
	Section_17                     = 17,
	Section_18                     = 18,
	Section_19                     = 19,
	Section_20                     = 20,
	Section_21                     = 21,
	Section_22                     = 22,
	Section_23                     = 23,
	Section_24                     = 24,
	Section_25                     = 25,
	Section_26                     = 26,
	Section_27                     = 27,
	Section_28                     = 28,
	Section_29                     = 29,
	Section_30                     = 30,
	Section_31                     = 31,
	Section_MAX                    = 32,
};

enum class EItemWrapMaterialType : uint8
{
	WeaponWrap                     = 0,
	VehicleWrap_Opaque             = 1,
	VehicleWrap_Masked             = 2,
	EItemWrapMaterialType_MAX      = 3,
};

enum class ECancelMarkerReason : int32
{
	Ping                           = 0,
	MapOrDeath                     = 1,
	ECancelMarkerReason_MAX        = 2,
};

enum class EAthenaQuickChatFilteringType : uint8
{
	AlwaysVisible                  = 0,
	ActiveMaterial                 = 1,
	FacingPickup                   = 2,
	ActiveHotbarItem               = 3,
	ActiveHotbarItemAmmo           = 4,
	FacingPickupOrActiveHotbarItem = 5,
	NoWeaponEquippedRequiringAmmo  = 6,
	WeaponEquippedOfAmmoType       = 7,
	EAthenaQuickChatFilteringType_MAX = 8,
};

enum class EAthenaSeasonRewardTrack : uint8
{
	Invalid                        = 0,
	SeasonProgressionTrack         = 1,
	CompendiumFreeTrack            = 2,
	CompendiumPaidTrack            = 3,
	EAthenaSeasonRewardTrack_MAX   = 4,
};

enum class EAthenaRewardItemType : uint8
{
	Normal                         = 0,
	HiddenReward                   = 1,
	NonExportedFakeReward          = 2,
	EAthenaRewardItemType_MAX      = 3,
};

enum class EAthenaChallengeTabVisibility : uint8
{
	Hide                           = 0,
	ShowAlways                     = 1,
	EAthenaChallengeTabVisibility_MAX = 2,
};

enum class EAthenaSeasonShopVisibility : uint8
{
	Hide                           = 0,
	ShowIfOffersAvailable          = 1,
	ShowAlways                     = 2,
	EAthenaSeasonShopVisibility_MAX = 3,
};

enum class EFortVehicleDecoType : uint8
{
	Unknown                        = 0,
	Flag                           = 1,
	HoodOrnament                   = 2,
	Wings                          = 3,
	EFortVehicleDecoType_MAX       = 4,
};

enum class EAutoFrameMode : uint8
{
	Off                            = 0,
	ManualOverride                 = 1,
	AutoFrame                      = 2,
	EAutoFrameMode_MAX             = 3,
};

enum class EBacchusHUDStateType : uint8
{
	DoNothing                      = 0,
	Hide                           = 1,
	Show                           = 2,
	FallbackToDefault              = 3,
	EBacchusHUDStateType_MAX       = 4,
};

enum class EAbilitySystemComponentCreationPolicy : uint8
{
	Never                          = 0,
	Lazy                           = 1,
	Always                         = 2,
	EAbilitySystemComponentCreationPolicy_MAX = 3,
};

enum class EAttributeInitLevelSource : uint8
{
	WorldDifficulty                = 0,
	PlayerBuildingSkill            = 1,
	AthenaPlaylist                 = 2,
	EAttributeInitLevelSource_MAX  = 3,
};

enum class EDynamicBuildingPlacementType : uint8
{
	CountsTowardsBounds            = 0,
	DestroyIfColliding             = 1,
	DestroyAnythingThatCollides    = 2,
	EDynamicBuildingPlacementType_MAX = 3,
};

enum class EUnlockRules : uint8
{
	UR_Reset                       = 0,
	UR_MaintainState               = 1,
	UR_ResetDeactivate             = 2,
	UR_MAX                         = 3,
};

enum class EContentionRules : uint8
{
	CR_MajorityWins                = 0,
	CR_OneTeamOnlyWins             = 1,
	CR_MAX                         = 2,
};

enum class EBinaryToggleValues : uint8
{
	BTV_Active                     = 0,
	BTV_Inactive                   = 1,
	BTV_Either                     = 2,
	BTV_MAX                        = 3,
};

enum class EAuxIndicatorStates : uint8
{
	AIS_GuidingArrow               = 0,
	AIS_ConfirmedArrow             = 1,
	AIS_Inactive                   = 2,
	AIS_Active                     = 3,
	AIS_MAX                        = 4,
};

enum class EFOBFileHeaderStatus : uint8
{
	NoExistingFile                 = 0,
	HasExistingFile                = 1,
	UnableToDetermine              = 2,
	EFOBFileHeaderStatus_MAX       = 3,
};

enum class EFOBInitStatus : uint8
{
	Successful                     = 0,
	Failure_CloudStorageDisabled   = 1,
	Failure_PreviouslyInitialized  = 2,
	Failure_DataOwner              = 3,
	Failure_CloudStorageError      = 4,
	Failure_MissingFileName        = 5,
	Failure_Generic                = 6,
	EFOBInitStatus_MAX             = 7,
};

enum class EFOBMode : uint8
{
	Uninitialized                  = 0,
	Creation                       = 1,
	Deployment                     = 2,
	EFOBMode_MAX                   = 3,
};

enum class EDynamicFoundationEnabledState : uint8
{
	Unknown                        = 0,
	Enabled                        = 1,
	Disabled                       = 2,
	EDynamicFoundationEnabledState_MAX = 3,
};

enum class EDynamicFoundationType : uint8
{
	Static                         = 0,
	StartEnabled_Stationary        = 1,
	StartEnabled_Dynamic           = 2,
	StartDisabled                  = 3,
	EDynamicFoundationType_MAX     = 4,
};

enum class EBuildingFoundationType : uint8
{
	BFT_3x3                        = 0,
	BFT_5x5                        = 1,
	BFT_5x10                       = 2,
	BFT_None                       = 3,
	BFT_MAX                        = 4,
};

enum class ESpawnMachineSubTextState : uint8
{
	NoCards                        = 0,
	VanInUse                       = 1,
	None                           = 2,
	ESpawnMachineSubTextState_MAX  = 3,
};

enum class EFortItemCollectorTrackingType : uint8
{
	Player                         = 0,
	Team                           = 1,
	EFortItemCollectorTrackingType_MAX = 2,
};

enum class EFortItemCollectorBehavior : uint8
{
	FirstToGoal                    = 0,
	FreeForAll                     = 1,
	EFortItemCollectorBehavior_MAX = 2,
};

enum class EFortItemCollectorState : uint8
{
	CanInteract                    = 0,
	Active                         = 1,
	Inactive                       = 2,
	Captured                       = 3,
	Invalid                        = 4,
	EFortItemCollectorState_MAX    = 5,
};

enum class ELayoutRequirementStatus : uint8
{
	Inactive_Invisible             = 0,
	Active_Invisible               = 1,
	Active_Visible                 = 2,
	ELayoutRequirementStatus_MAX   = 3,
};

enum class EMusicTrackPlayback : uint8
{
	Disabled                       = 0,
	Enabled                        = 1,
	EMusicTrackPlayback_MAX        = 2,
};

enum class ERiftCosmeticState : uint8
{
	None                           = 0,
	Intro                          = 1,
	Idle                           = 2,
	RampUp                         = 3,
	ShouldDie                      = 4,
	ERiftCosmeticState_MAX         = 5,
};

enum class EFortRiftSpawnSlotSelectionMode : uint8
{
	Random                         = 0,
	BestScore                      = 1,
	EFortRiftSpawnSlotSelectionMode_MAX = 2,
};

enum class EFortRiftSlotStatus : uint8
{
	Reserved                       = 0,
	Occupied                       = 1,
	Max_None                       = 2,
	EFortRiftSlotStatus_MAX        = 3,
};

enum class EBuildingNavObstacleType : uint8
{
	UnwalkableAll                  = 0,
	UnwalkableHuskOnly             = 1,
	SmashWhenLowHeight             = 2,
	SmashOnlyLowHeight             = 3,
	SmashSmasherOnly               = 4,
	SmashAll                       = 5,
	EBuildingNavObstacleType_MAX   = 6,
};

enum class EFortDamageVisualsState : uint8
{
	UnDamaged                      = 0,
	DamagedAndAnimating            = 1,
	DamagedAndStatic               = 2,
	EFortDamageVisualsState_MAX    = 3,
};

enum class EStructuralSupportCheck : uint8
{
	Stable                         = 0,
	Unstable                       = 1,
	Max_None                       = 2,
	EStructuralSupportCheck_MAX    = 3,
};

enum class ESavedSupportStatus : uint8
{
	UnknownState                   = 0,
	Supported                      = 1,
	UnSupported                    = 2,
	ESavedSupportStatus_MAX        = 3,
};

enum class EPlacementType : uint8
{
	Free                           = 0,
	Grid                           = 1,
	None                           = 2,
	EPlacementType_MAX             = 3,
};

enum class EBuildingAttachmentSide : uint8
{
	Front                          = 0,
	Back                           = 1,
	Any                            = 2,
	EBuildingAttachmentSide_MAX    = 3,
};

enum class EBuildingAttachmentSlot : uint8
{
	SLOT_Floor                     = 0,
	SLOT_Wall                      = 1,
	SLOT_Ceiling                   = 2,
	SLOT_None                      = 3,
	SLOT_MAX                       = 4,
};

enum class EBuildingAnim : uint8
{
	EBA_None                       = 0,
	EBA_Building                   = 1,
	EBA_Breaking                   = 2,
	EBA_Destruction                = 3,
	EBA_Placement                  = 4,
	EBA_DynamicLOD                 = 5,
	EBA_DynamicShrink              = 6,
	EBA_MAX                        = 7,
};

enum class EStructuralFloorPosition : uint8
{
	Top                            = 0,
	Bottom                         = 1,
	EStructuralFloorPosition_MAX   = 2,
};

enum class EStructuralWallPosition : uint8
{
	Left                           = 0,
	Right                          = 1,
	Front                          = 2,
	Back                           = 3,
	EStructuralWallPosition_MAX    = 4,
};

enum class EFortDefenderInteractionError : uint8
{
	None                           = 0,
	Obstructed                     = 1,
	NoEditPermission               = 2,
	UsedByAnotherPlayer            = 3,
	EFortDefenderInteractionError_MAX = 4,
};

enum class EFortBounceType : uint8
{
	Hit                            = 0,
	Interact                       = 1,
	EditPlaced                     = 2,
	EFortBounceType_MAX            = 3,
};

enum class EFortConnectivityCubeFace : uint8
{
	Front                          = 0,
	Left                           = 1,
	Back                           = 2,
	Right                          = 3,
	Upper                          = 4,
	Lower                          = 5,
	MAX                            = 6,
};

enum class EFortDecoPlacementQueryResults : uint8
{
	CanAdd                         = 0,
	ExistingTrap                   = 1,
	ExistingObject                 = 2,
	Obstructed                     = 3,
	NoLocation                     = 4,
	WrongType                      = 5,
	WrongShape                     = 6,
	BeingModified                  = 7,
	WrongTeam                      = 8,
	BlueprintFailure               = 9,
	AbilityFailure                 = 10,
	RequiresPlayerBuildableActor   = 11,
	NoEditPermission               = 12,
	WrongZone                      = 13,
	EFortDecoPlacementQueryResults_MAX = 14,
};

enum class EFortStructuralGridQueryResults : uint8
{
	CanAdd                         = 0,
	ExistingActor                  = 1,
	Obstructed                     = 2,
	NoStructuralSupport            = 3,
	InvalidActor                   = 4,
	ReachedLimit                   = 5,
	NoEditPermission               = 6,
	PatternNotPermittedByLayoutRequirement = 7,
	ResourceTypeNotPermittedByLayoutRequirement = 8,
	BuildingAtRequirementsDisabled = 9,
	BuildingOtherThanRequirementsDisabled = 10,
	EFortStructuralGridQueryResults_MAX = 11,
};

enum class EFortBuildingInitializationReason : uint8
{
	StaticallyPlaced               = 0,
	Spawned                        = 1,
	Replaced                       = 2,
	LoadedFromSave                 = 3,
	DynamicBuilderPlaced           = 4,
	PlacementTool                  = 5,
	TrapTool                       = 6,
	None                           = 7,
	EFortBuildingInitializationReason_MAX = 8,
};

enum class EFortBuildingPersistentState : uint8
{
	Default                        = 0,
	New                            = 1,
	Constructed                    = 2,
	Destroyed                      = 3,
	Searched                       = 4,
	None                           = 5,
	EFortBuildingPersistentState_MAX = 6,
};

enum class EFortBuildingState : uint8
{
	Placement                      = 0,
	EditMode                       = 1,
	None                           = 2,
	EFortBuildingState_MAX         = 3,
};

enum class EFortTextureDataSlot : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	Fourth                         = 3,
	NumSlots                       = 4,
	EFortTextureDataSlot_MAX       = 5,
};

enum class EFortTextureDataType : uint8
{
	Any                            = 0,
	OuterWall                      = 1,
	InnerWall                      = 2,
	Corner                         = 3,
	Floor                          = 4,
	Ceiling                        = 5,
	Trim                           = 6,
	Roof                           = 7,
	Pillar                         = 8,
	Shingle                        = 9,
	None                           = 10,
	EFortTextureDataType_MAX       = 11,
};

enum class EBuildingAttachmentType : uint8
{
	ATTACH_Floor                   = 0,
	ATTACH_Wall                    = 1,
	ATTACH_Ceiling                 = 2,
	ATTACH_Corner                  = 3,
	ATTACH_All                     = 4,
	ATTACH_WallThenFloor           = 5,
	ATTACH_FloorAndStairs          = 6,
	ATTACH_CeilingAndStairs        = 7,
	ATTACH_None                    = 8,
	ATTACH_MAX                     = 9,
};

enum class EAccessoryColorName : uint8
{
	EAccessoryColorName_AccessoryColor1 = 0,
	EAccessoryColorName_AccessoryColor2 = 1,
	EAccessoryColorName_AccessoryColor3 = 2,
	EAccessoryColorName_NumTypes   = 3,
	EAccessoryColorName_MAX        = 4,
};

enum class ECustomHatType : uint8
{
	ECustomHatType_None            = 0,
	ECustomHatType_Cap             = 1,
	ECustomHatType_Helmet          = 2,
	ECustomHatType_Mask            = 3,
	ECustomHatType_Hat             = 4,
	ECustomHatType_HeadReplacement = 5,
	ECustomHatType_MAX             = 6,
};

enum class EClothingColorName : uint8
{
	EClothingColorName_AccessoryColor1 = 0,
	EClothingColorName_AccessoryColor2 = 1,
	EClothingColorName_NumTypes    = 2,
	EClothingColorName_MAX         = 3,
};

enum class EColorSwatchType : uint8
{
	EColorSwatchType_Skin          = 0,
	EColorSwatchType_Hair          = 1,
	EColorSwatchType_BodyAccessory = 2,
	EColorSwatchType_Accessory     = 3,
	EColorSwatchType_NumTypes      = 4,
	EColorSwatchType_MAX           = 5,
};

enum class ECharacterColorSwatchType : uint8
{
	ECharacterColorSwatchType_Skin = 0,
	ECharacterColorSwatchType_Hair = 1,
	ECharacterColorSwatchType_NumTypes = 2,
	ECharacterColorSwatchType_MAX  = 3,
};

enum class EDeployableBaseConstructionStatus : uint8
{
	Constructing                   = 0,
	Destroying                     = 1,
	Finished                       = 2,
	EDeployableBaseConstructionStatus_MAX = 3,
};

enum class EDeployableBaseBuildingState : uint8
{
	Empty                          = 0,
	Built                          = 1,
	Unoccupied                     = 2,
	WaitingToBuild                 = 3,
	Building                       = 4,
	WaitingToDestroy               = 5,
	Destroying                     = 6,
	WaitingToReset                 = 7,
	Resetting                      = 8,
	EDeployableBaseBuildingState_MAX = 9,
};

enum class EDeployableBaseBoxType : uint8
{
	BuildSpace                     = 0,
	SaveSpace                      = 1,
	PlotSpace                      = 2,
	NumSpaceTypes                  = 3,
	EDeployableBaseBoxType_MAX     = 4,
};

enum class EFortSharedAnimationState : uint8
{
	Anim_Walk                      = 0,
	Anim_Run                       = 1,
	Anim_Turn                      = 2,
	Anim_Attack                    = 3,
	Anim_Death                     = 4,
	Anim_Knockback                 = 5,
	Anim_FullBodyHit               = 6,
	Anim_Pushed                    = 7,
	Anim_Dance                     = 8,
	Anim_Idle                      = 9,
	Anim_RangedAttack              = 10,
	Anim_MAX                       = 11,
};

enum class EFortStatDisplayType : uint8
{
	Category                       = 0,
	Buff                           = 1,
	Debuff                         = 2,
	Neutral                        = 3,
	DoNotDisplay                   = 4,
	EFortStatDisplayType_MAX       = 5,
};

enum class EFortAbilityTargetSelectionUsage : uint8
{
	BothTargetingAndCanHit         = 0,
	OnlyTargeting                  = 1,
	OnlyCanHit                     = 2,
	EFortAbilityTargetSelectionUsage_MAX = 3,
};

enum class EFortDirectedMovementSpace : uint8
{
	WorldSpace                     = 0,
	ActorLocRelative               = 1,
	ActorLocRotRelative            = 2,
	CameraRelative                 = 3,
	EFortDirectedMovementSpace_MAX = 4,
};

enum class EFortAbilityTargetDataPolicy : uint8
{
	ReplicateToServer              = 0,
	SimulateOnServer               = 1,
	EFortAbilityTargetDataPolicy_MAX = 2,
};

enum class EFortProximityBasedGEApplicationType : uint8
{
	ApplyOnProximityPulse          = 0,
	ApplyOnProximityTouch          = 1,
	ApplyOnlyDuringProximityTouch  = 2,
	EFortProximityBasedGEApplicationType_MAX = 3,
};

enum class EFortDeliveryInfoBuildingActorSpecification : uint8
{
	All                            = 0,
	PlayerBuildable                = 1,
	NonPlayerBuildable             = 2,
	EFortDeliveryInfoBuildingActorSpecification_MAX = 3,
};

enum class EDespawnAIType : uint8
{
	Relevancy                      = 0,
	Distance                       = 1,
	EDespawnAIType_MAX             = 2,
};

enum class EFortEncounterUtilityDesire : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	VeryHigh                       = 3,
	Max_None                       = 4,
	EFortEncounterUtilityDesire_MAX = 5,
};

enum class EFortAIDirectorFactorContribution : uint8
{
	Direct                         = 0,
	Inverse                        = 1,
	EFortAIDirectorFactorContribution_MAX = 2,
};

enum class EFortAIDirectorEventContribution : uint8
{
	Increment                      = 0,
	Set                            = 1,
	EFortAIDirectorEventContribution_MAX = 2,
};

enum class EFortAIWaveProgressSection : uint8
{
	SectionOne                     = 0,
	SectionTwo                     = 1,
	Max_None                       = 2,
	EFortAIWaveProgressSection_MAX = 3,
};

enum class EFortEncounterState : uint8
{
	Uninitialized                  = 0,
	InitializingProperties         = 1,
	InitializingRiftManager        = 2,
	AwaitingActivation             = 3,
	Active                         = 4,
	ReplacingRifts                 = 5,
	Max_None                       = 6,
	EFortEncounterState_MAX        = 7,
};

enum class EFortEncounterPacingState : uint8
{
	Ramp                           = 0,
	Peak                           = 1,
	Fade                           = 2,
	Rest                           = 3,
	Max_None                       = 4,
	EFortEncounterPacingState_MAX  = 5,
};

enum class EFortEncounterSequenceResult : uint8
{
	Success                        = 0,
	FailedEncounterInProgress      = 1,
	Failed                         = 2,
	EFortEncounterSequenceResult_MAX = 3,
};

enum class EAssignmentCreationResult : uint8
{
	AssignmentNotFoundOrCreated    = 0,
	AssignmentCreated              = 1,
	AssignmentFound                = 2,
	EAssignmentCreationResult_MAX  = 3,
};

enum class ETagGoalScoringCategory : uint8
{
	Ignore                         = 0,
	HighInterest                   = 1,
	NumCategories                  = 2,
	ETagGoalScoringCategory_MAX    = 3,
};

enum class EFortAIPawnGender : uint8
{
	FAPG_Default                   = 0,
	FAPG_Female                    = 1,
	FAPG_Male                      = 2,
	FAPG_MAX                       = 3,
};

enum class EFortAILevelRatingDisplayType : uint8
{
	DisplayRatingBasedOnDifficulty = 0,
	DisplayAIDifficultyAsRating    = 1,
	DontDisplayRating              = 2,
	EFortAILevelRatingDisplayType_MAX = 3,
};

enum class EFortressAIType : uint8
{
	FAT_Dormant                    = 0,
	FAT_Cleaner                    = 1,
	FAT_DayWanderer                = 2,
	FAT_NightWanderer              = 3,
	FAT_DebugOnly                  = 4,
	FAT_Encounter                  = 5,
	FAT_MAX                        = 6,
};

enum class ECorePerceptionTypes : uint8
{
	Sight                          = 0,
	Hearing                        = 1,
	Damage                         = 2,
	Touch                          = 3,
	Team                           = 4,
	Prediction                     = 5,
	MAX                            = 6,
};

enum class ENavigationObstacleOverride : uint8
{
	UseMeshSettings                = 0,
	ForceEnabled                   = 1,
	ForceDisabled                  = 2,
	ENavigationObstacleOverride_MAX = 3,
};

enum class EFortPartialPathUsage : uint8
{
	Always                         = 0,
	OnlyGoalsOnDestructible        = 1,
	Never                          = 2,
	EFortPartialPathUsage_MAX      = 3,
};

enum class EHotspotTypeConfigMode : uint8
{
	AlwaysAdd                      = 0,
	WhenNotDefined                 = 1,
	WhenNotValid                   = 2,
	EHotspotTypeConfigMode_MAX     = 3,
};

enum class EFortHotSpotPreview : uint8
{
	None                           = 0,
	Smashing                       = 1,
	Shooting                       = 2,
	EFortHotSpotPreview_MAX        = 3,
};

enum class EFortHotSpotDirection : uint8
{
	PositiveX                      = 0,
	NegativeX                      = 1,
	PositiveY                      = 2,
	NegativeY                      = 3,
	PositiveZ                      = 4,
	NegativeZ                      = 5,
	Any                            = 6,
	EFortHotSpotDirection_MAX      = 7,
};

enum class EFortHotSpotSlot : uint8
{
	Melee                          = 0,
	MeleeHuge                      = 1,
	Ranged                         = 2,
	None                           = 3,
	EFortHotSpotSlot_MAX           = 4,
};

enum class EBuildingFloorRailing : uint8
{
	None                           = 0,
	Balcony                        = 1,
	EBuildingFloorRailing_MAX      = 2,
};

enum class EBuildingStairsRailing : uint8
{
	None                           = 0,
	Partial                        = 1,
	Full                           = 2,
	EBuildingStairsRailing_MAX     = 3,
};

enum class EBuildingWallArea : uint8
{
	Regular                        = 0,
	Flat                           = 1,
	Special                        = 2,
	EBuildingWallArea_MAX          = 3,
};

enum class EAssignmentType : uint8
{
	Invalid                        = 0,
	Encounter                      = 1,
	World                          = 2,
	Enemy                          = 3,
	NumAssignmentTypes             = 4,
	EAssignmentType_MAX            = 5,
};

enum class EFortAILODLevel : uint8
{
	Invalid                        = 0,
	Lowest                         = 1,
	Lower                          = 2,
	BelowNormal                    = 3,
	Normal                         = 4,
	AboveNormal                    = 5,
	MAX                            = 6,
};

enum class EFortAnalyticsClientEngagementEventType : uint8
{
	None                           = 0,
	DamageReceivedFromPlayerPawn   = 1,
	DamageDealtToPlayerPawn        = 2,
	DamageDealtToOther             = 3,
	EngagementTimeout              = 4,
	PlayerWon                      = 5,
	PlayerDeathOnWin               = 6,
	TeamWon                        = 7,
	TeamLost                       = 8,
	PlayerLost                     = 9,
	PlayerKilledPlayer             = 10,
	PlayerFiredWeapon              = 11,
	ManagerStopped                 = 12,
	Count                          = 13,
	EFortAnalyticsClientEngagementEventType_MAX = 14,
};

enum class ESkydivingDirection : uint8
{
	Center                         = 0,
	Right                          = 1,
	Left                           = 2,
	Forward                        = 3,
	Back                           = 4,
	ESkydivingDirection_MAX        = 5,
};

enum class EAnimRelaxedState : uint8
{
	None                           = 0,
	WeaponRaised                   = 1,
	RelaxedLevel1                  = 2,
	RelaxedLevel2                  = 3,
	EAnimRelaxedState_MAX          = 4,
};

enum class ESourceSelectionMode : uint8
{
	MaxDifference                  = 0,
	ESourceSelectionMode_MAX       = 1,
};

enum class ESpeedWarpingAxisMode : uint8
{
	IKFootRootLocalX               = 0,
	IKFootRootLocalY               = 1,
	IKFootRootLocalZ               = 2,
	WorldSpaceVectorInput          = 3,
	ComponentSpaceVectorInput      = 4,
	ActorSpaceVectorInput          = 5,
	ESpeedWarpingAxisMode_MAX      = 6,
};

enum class EMontageInterrupt : uint8
{
	Any                            = 0,
	RootMotionOnly                 = 1,
	None                           = 2,
	EMontageInterrupt_MAX          = 3,
};

enum class EDeimosAnimState : uint8
{
	Idle                           = 0,
	Running                        = 1,
	Attack                         = 2,
	Dance                          = 3,
	Dying                          = 4,
	Died                           = 5,
	FullBodyHitReact               = 6,
	AdditiveHitReact               = 7,
	ActiveIdle                     = 8,
	Falling                        = 9,
	Frozen                         = 10,
	RangedAttack                   = 11,
	EDeimosAnimState_MAX           = 12,
};

enum class EFortCardinalDirection : uint8
{
	North                          = 0,
	East                           = 1,
	South                          = 2,
	West                           = 3,
	EFortCardinalDirection_MAX     = 4,
};

enum class EPlaneDirection : uint8
{
	Center                         = 0,
	Right                          = 1,
	Left                           = 2,
	Up                             = 3,
	Down                           = 4,
	EPlaneDirection_MAX            = 5,
};

enum class EFortFacialAnimTypes : uint8
{
	Default                        = 0,
	Player                         = 1,
	Provider                       = 2,
	Max                            = 3,
};

enum class EAlertLevel : uint8
{
	Unaware                        = 0,
	Suspicious                     = 1,
	Alerted                        = 2,
	Threatened                     = 3,
	EAlertLevel_MAX                = 4,
};

enum class ELootPathResult : uint8
{
	PendingPathQuery               = 0,
	ValidPath                      = 1,
	InvalidPath                    = 2,
	ELootPathResult_MAX            = 3,
};

enum class EDoghouseControlMode : uint8
{
	GroundControls                 = 0,
	AirControls                    = 1,
	MaxCount                       = 2,
	EDoghouseControlMode_MAX       = 3,
};

enum class EFreelookMode : uint8
{
	None                           = 0,
	Mouse                          = 1,
	Analog                         = 2,
	EFreelookMode_MAX              = 3,
};

enum class EAileronRollDirection : uint8
{
	None                           = 0,
	Right                          = 1,
	Left                           = 2,
	EAileronRollDirection_MAX      = 3,
};

enum class EExitCraftState : uint8
{
	None                           = 0,
	Spawned                        = 1,
	Landed                         = 2,
	SpawnBalloon                   = 3,
	GettingIntoPosition            = 4,
	GettingIntoPosition_Simple     = 5,
	WaitingForPawns                = 6,
	Exiting                        = 7,
	EExitCraftState_MAX            = 8,
};

enum class EFortExitRequirements : uint8
{
	AnyPlayer                      = 0,
	WholeSquad                     = 1,
	EFortExitRequirements_MAX      = 2,
};

enum class EFortMutatorReturnValue : uint8
{
	Ignore                         = 0,
	Override                       = 1,
	OverrideReturn                 = 2,
	EFortMutatorReturnValue_MAX    = 3,
};

enum class EAshtonStoneStateType : uint8
{
	NotSpawned                     = 0,
	Spawned                        = 1,
	Captured                       = 2,
	MAX                            = 3,
};

enum class EAshtonStoneType : uint8
{
	Purple                         = 0,
	Blue                           = 1,
	Red                            = 2,
	Orange                         = 3,
	Green                          = 4,
	Yellow                         = 5,
	MAX                            = 6,
};

enum class EBarrierObjectiveDamageState : uint8
{
	Health_75                      = 0,
	Health_50                      = 1,
	Health_25                      = 2,
	Health_10                      = 3,
	Health_5                       = 4,
	Health_4                       = 5,
	Health_3                       = 6,
	Health_2                       = 7,
	Health_1                       = 8,
	MAX                            = 9,
};

enum class EBarrierFoodTeam : uint8
{
	Burger                         = 0,
	Tomato                         = 1,
	MAX                            = 2,
};

enum class EDBNOMutatorType : uint8
{
	Default                        = 0,
	On                             = 1,
	Off                            = 2,
	EDBNOMutatorType_MAX           = 3,
};

enum class EControlPointState : uint8
{
	None                           = 0,
	Disabled                       = 1,
	Enabled                        = 2,
	EControlPointState_MAX         = 3,
};

enum class EAthenaMutatorEvaluators : uint8
{
	NoOverride                     = 0,
	ForceOverride                  = 1,
	Add                            = 2,
	Multiply                       = 3,
	EAthenaMutatorEvaluators_MAX   = 4,
};

enum class EHeistExitCraftState : uint8
{
	None                           = 0,
	Incoming                       = 1,
	Spawned                        = 2,
	Exited                         = 3,
	EHeistExitCraftState_MAX       = 4,
};

enum class EAthenaInventorySpawnOverride : uint8
{
	NoOverride                     = 0,
	Always                         = 1,
	IntialSpawn                    = 2,
	AircraftPhaseOnly              = 3,
	EAthenaInventorySpawnOverride_MAX = 4,
};

enum class EAthenaLootDropOverride : uint8
{
	NoOverride                     = 0,
	ForceDrop                      = 1,
	ForceKeep                      = 2,
	EAthenaLootDropOverride_MAX    = 3,
};

enum class ERespawnRequirements : uint8
{
	RespawnOnly                    = 0,
	NoRespawnOnly                  = 1,
	Both                           = 2,
	ERespawnRequirements_MAX       = 3,
};

enum class EMashDifficulty : uint8
{
	Easy                           = 0,
	Medium                         = 1,
	Hard                           = 2,
	EMashDifficulty_MAX            = 3,
};

enum class EIndicatorDisplayMode : uint8
{
	Default                        = 0,
	Always                         = 1,
	Never                          = 2,
	EIndicatorDisplayMode_MAX      = 3,
};

enum class EOmahaTeam : uint8
{
	Home                           = 0,
	Away                           = 1,
	MAX                            = 2,
};

enum class ESkyCapState : uint8
{
	Hidden                         = 0,
	StormStarting                  = 1,
	ESkyCapState_MAX               = 2,
};

enum class EAthenaTimeOfDayOverride : uint8
{
	NoOverride                     = 0,
	ForceDay                       = 1,
	ForceNight                     = 2,
	Custom                         = 3,
	Hour0                          = 4,
	Hour1                          = 5,
	Hour2                          = 6,
	Hour3                          = 7,
	Hour4                          = 8,
	Hour5                          = 9,
	Hour6                          = 10,
	Hour7                          = 11,
	Hour8                          = 12,
	Hour9                          = 13,
	Hour10                         = 14,
	Hour11                         = 15,
	Hour12                         = 16,
	Hour13                         = 17,
	Hour14                         = 18,
	Hour15                         = 19,
	Hour16                         = 20,
	Hour17                         = 21,
	Hour18                         = 22,
	Hour19                         = 23,
	Hour20                         = 24,
	Hour21                         = 25,
	Hour22                         = 26,
	Hour23                         = 27,
	Random                         = 28,
	EAthenaTimeOfDayOverride_MAX   = 29,
};

enum class EFortAthenaMutator_VoiceChatChannelType : uint8
{
	Default                        = 0,
	None                           = 1,
	SquadOnly                      = 2,
	TeamOnly                       = 3,
	WholeServer                    = 4,
	ScopeOnly                      = 5,
	ScopeSquadOnly                 = 6,
	ScopeTeamOnly                  = 7,
	EFortAthenaMutator_MAX         = 8,
};

enum class ECoastState : uint8
{
	Idle                           = 0,
	Mount                          = 1,
	Coasting                       = 2,
	Pedaling                       = 3,
	PreDismount                    = 4,
	Dismount                       = 5,
	EndCoast                       = 6,
	ECoastState_MAX                = 7,
};

enum class EVehicleSessionEndReason : uint8
{
	Invalid                        = 0,
	NoPassengers                   = 1,
	EVehicleSessionEndReason_MAX   = 2,
};

enum class EVehicleMovementMode : uint8
{
	OnGround                       = 0,
	InAir                          = 1,
	WipeOut                        = 2,
	MaxCount                       = 3,
	EVehicleMovementMode_MAX       = 4,
};

enum class EAthenaVehicleSeats : uint8
{
	Driver                         = 0,
	Passenger1                     = 1,
	Passenger2                     = 2,
	Passenger3                     = 3,
	Passenger4                     = 4,
	Passenger5                     = 5,
	MaxCount                       = 6,
	EAthenaVehicleSeats_MAX        = 7,
};

enum class EBounceCompressionState : uint8
{
	None                           = 0,
	Crouching                      = 1,
	Crouched                       = 2,
	Jumping                        = 3,
	Recoiling                      = 4,
	EBounceCompressionState_MAX    = 5,
};

enum class ENaturalSlideState : uint8
{
	None                           = 0,
	Entering                       = 1,
	InProgress                     = 2,
	Exiting                        = 3,
	ENaturalSlideState_MAX         = 4,
};

enum class EPowerSlideState : uint8
{
	None                           = 0,
	Entering                       = 1,
	InProgress                     = 2,
	Exiting                        = 3,
	EPowerSlideState_MAX           = 4,
};

enum class EFortFuelGadgetVisualType : uint8
{
	FuelMeter                      = 0,
	ChargeText                     = 1,
	Invalid                        = 2,
	EFortFuelGadgetVisualType_MAX  = 3,
};

enum class EFortAttributeDisplay : uint8
{
	BasicInt                       = 0,
	NegativeImpliesInfiniteInt     = 1,
	BasicFloat                     = 2,
	NegativeImpliesInfiniteFloat   = 3,
	BasicString                    = 4,
	NormalizedPercentage           = 5,
	StringArray                    = 6,
	SlateBrush                     = 7,
	DoNotDisplay                   = 8,
	None_Max                       = 9,
	EFortAttributeDisplay_MAX      = 10,
};

enum class EBannerUsageContext : uint8
{
	Unknown                        = 0,
	BannerIcon                     = 1,
	PhysicalBanner                 = 2,
	Spray                          = 3,
	EBannerUsageContext_MAX        = 4,
};

enum class ETargetDistanceComparisonType : uint8
{
	TwoDimensions                  = 0,
	ThreeDimensions                = 1,
	CollisionHalfHeightMultiplier  = 2,
	ETargetDistanceComparisonType_MAX = 3,
};

enum class EFortBuildingSoundType : uint8
{
	Construction                   = 0,
	GenericDestruction             = 1,
	PlayerBuiltDestruction         = 2,
	None                           = 3,
	EFortBuildingSoundType_MAX     = 4,
};

enum class EFortUICameraFrameTargetBoundingBehavior : uint8
{
	NoBounds                       = 0,
	AllBounds                      = 1,
	TopBoundOnly                   = 2,
	EFortUICameraFrameTargetBoundingBehavior_MAX = 3,
};

enum class ECameraOrigin : uint8
{
	ViewTargetTransform            = 0,
	BoneTransform                  = 1,
	ECameraOrigin_MAX              = 2,
};

enum class EChallengeBundleQuestUnlockType : uint8
{
	GrantWithBundle                = 0,
	RequiresBattlePass             = 1,
	DaysFromEventStart             = 2,
	EChallengeBundleQuestUnlockType_MAX = 3,
};

enum class EChallengeScheduleUnlockType : uint8
{
	Manually                       = 0,
	OnScheduleGranted              = 1,
	DaysSinceEventStart            = 2,
	EChallengeScheduleUnlockType_MAX = 3,
};

enum class EFortCustomMovement : uint8
{
	Default                        = 0,
	Driving                        = 1,
	Passenger                      = 2,
	Parachuting                    = 3,
	Skydiving                      = 4,
	Hover                          = 5,
	RemoteControl_Flying           = 6,
	Ziplining                      = 7,
	Ballooning                     = 8,
	EFortCustomMovement_MAX        = 9,
};

enum class EChatRoomJoinHelperState : uint8
{
	Ready                          = 0,
	AttemptingJoin                 = 1,
	Joined                         = 2,
	AttemptingLeave                = 3,
	EChatRoomJoinHelperState_MAX   = 4,
};

enum class EFortAnnouncementDisplayPreference : uint8
{
	Default_HUD                    = 0,
	QuestIntroduction              = 1,
	QuestJournal                   = 2,
	EFortAnnouncementDisplayPreference_MAX = 3,
};

enum class EFortAnnouncementChannel : uint8
{
	Primary                        = 0,
	Conversation                   = 1,
	Tutorial                       = 2,
	Max_None                       = 3,
	EFortAnnouncementChannel_MAX   = 4,
};

enum class EFortAnnouncementDelivery : uint8
{
	Created                        = 0,
	Received                       = 1,
	Ignored                        = 2,
	Active                         = 3,
	Stopped                        = 4,
	Max_None                       = 5,
	EFortAnnouncementDelivery_MAX  = 6,
};

enum class EQuestMapScreenMode : uint8
{
	MainCampaign                   = 0,
	Event                          = 1,
	EQuestMapScreenMode_MAX        = 2,
};

enum class EFortAllowBackgroundAudioSetting : uint8
{
	Off                            = 0,
	NotificationsOnly              = 1,
	AllSounds                      = 2,
	Num                            = 3,
	EFortAllowBackgroundAudioSetting_MAX = 4,
};

enum class EAndroidAppStoreTypes : uint8
{
	Unset                          = 0,
	Epic                           = 1,
	Samsung                        = 2,
	EAndroidAppStoreTypes_MAX      = 3,
};

enum class EColorBlindMode : uint8
{
	Off                            = 0,
	Deuteranope                    = 1,
	Protanope                      = 2,
	Tritanope                      = 3,
	EColorBlindMode_MAX            = 4,
};

enum class ECloudFileState : uint8
{
	Unitialized                    = 0,
	Saving                         = 1,
	Loading                        = 2,
	Idle                           = 3,
	ECloudFileState_MAX            = 4,
};

enum class ECodeTokenPlatform : uint8
{
	PC                             = 0,
	PS4                            = 1,
	XBOX                           = 2,
	ECodeTokenPlatform_MAX         = 3,
};

enum class EFortCollectionBookState : uint8
{
	Active                         = 0,
	Completed                      = 1,
	Claimed                        = 2,
	EFortCollectionBookState_MAX   = 3,
};

enum class EFortPIDValueGraphElements : uint8
{
	Proportional                   = 0,
	Integral                       = 1,
	Max_None                       = 2,
	EFortPIDValueGraphElements_MAX = 3,
};

enum class EFortIntensityGraphElements : uint8
{
	ActualIntensity                = 0,
	DesiredIntensity               = 1,
	Max_None                       = 2,
	EFortIntensityGraphElements_MAX = 3,
};

enum class EFortContributionGraphElements : uint8
{
	ProportionalLine               = 0,
	IntegralLine                   = 1,
	TotalLine                      = 2,
	PendingLine                    = 3,
	ActionLine                     = 4,
	Max_None                       = 5,
	EFortContributionGraphElements_MAX = 6,
};

enum class EFortFactorContributionType : uint8
{
	CurrentValue_Direct            = 0,
	CurrentValue_Inverse           = 1,
	AverageValue_Direct            = 2,
	AverageValue_Inverse           = 3,
	EFortFactorContributionType_MAX = 4,
};

enum class EFortAIDirectorFactor : uint8
{
	PlayerDamageThreat             = 0,
	ObjectiveDamageThreat          = 1,
	ObjectivePathCost              = 2,
	PlayerPathCost                 = 3,
	PlayerMovement                 = 4,
	TrapsEffective                 = 5,
	PlayerWander                   = 6,
	NearbyEnemyPresence            = 7,
	OffensiveResources             = 8,
	DefensiveResources             = 9,
	Boredom                        = 10,
	ArtilleryVulnerability         = 11,
	Max_None                       = 12,
	EFortAIDirectorFactor_MAX      = 13,
};

enum class EFortCombatFactors : uint8
{
	PlayerDamageThreat             = 0,
	ObjectiveDamageThreat          = 1,
	ObjectivePathCost              = 2,
	PlayerPathCost                 = 3,
	PlayerMovement                 = 4,
	TrapsEffective                 = 5,
	PlayerWander                   = 6,
	NearbyEnemyPresence            = 7,
	OffensiveResources             = 8,
	DefensiveResources             = 9,
	Boredom                        = 10,
	ArtilleryVulnerability         = 11,
	Max_None                       = 12,
	EFortCombatFactors_MAX         = 13,
};

enum class EFortCombatEventContribution : uint8
{
	Linear                         = 0,
	Inverse                        = 1,
	Accumulator                    = 2,
	Max_None                       = 3,
	EFortCombatEventContribution_MAX = 4,
};

enum class EFortAIDirectorEventParticipant : uint8
{
	Target                         = 0,
	Source                         = 1,
	Either                         = 2,
	Max_None                       = 3,
	EFortAIDirectorEventParticipant_MAX = 4,
};

enum class EFortCombatThresholds : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Extreme                        = 3,
	Max_None                       = 4,
	EFortCombatThresholds_MAX      = 5,
};

enum class EFortBaseWeaponDamage : uint8
{
	Combat                         = 0,
	Environmental                  = 1,
	EFortBaseWeaponDamage_MAX      = 2,
};

enum class EFortWeaponCoreAnimation : uint8
{
	Melee                          = 0,
	Pistol                         = 1,
	Shotgun                        = 2,
	PaperBlueprint                 = 3,
	Rifle                          = 4,
	MeleeOneHand                   = 5,
	MachinePistol                  = 6,
	RocketLauncher                 = 7,
	GrenadeLauncher                = 8,
	GoingCommando                  = 9,
	AssaultRifle                   = 10,
	TacticalShotgun                = 11,
	SniperRifle                    = 12,
	TrapPlacement                  = 13,
	ShoulderLauncher               = 14,
	AbilityDecoTool                = 15,
	Crossbow                       = 16,
	C4                             = 17,
	RemoteControl                  = 18,
	DualWield                      = 19,
	AR_BullPup                     = 20,
	AR_ForwardGrip                 = 21,
	MedPackPaddles                 = 22,
	SMG_P90                        = 23,
	AR_DrumGun                     = 24,
	Consumable_Small               = 25,
	Consumable_Large               = 26,
	Balloon                        = 27,
	MountedTurret                  = 28,
	CreativeTool                   = 29,
	ExplosiveBow                   = 30,
	AshtonIndigo                   = 31,
	AshtonChicago                  = 32,
	MAX                            = 33,
};

enum class EFortTargetingFXState : uint8
{
	TargetingStart                 = 0,
	TargetingEnd                   = 1,
	Max_None                       = 2,
	EFortTargetingFXState_MAX      = 3,
};

enum class EFortReloadFXState : uint8
{
	ReloadStart                    = 0,
	ReloadCartridge                = 1,
	ReloadEnd                      = 2,
	Max_None                       = 3,
	EFortReloadFXState_MAX         = 4,
};

enum class EFortWeaponSoundChannel : uint8
{
	NormalA                        = 0,
	NormalB                        = 1,
	LowAmmo                        = 2,
	Degraded                       = 3,
	Max_None                       = 4,
	EFortWeaponSoundChannel_MAX    = 5,
};

enum class EFortWeaponSoundState : uint8
{
	Normal                         = 0,
	LowAmmo                        = 1,
	Degraded                       = 2,
	Max_None                       = 3,
	EFortWeaponSoundState_MAX      = 4,
};

enum class EFortMontageInputType : uint8
{
	WindowClickOrHold              = 0,
	WindowHoldOnly                 = 1,
	InstantClick                   = 2,
	EFortMontageInputType_MAX      = 3,
};

enum class EFortAbilityTargetingSource : uint8
{
	Camera                         = 0,
	PawnForward                    = 1,
	PawnTowardsFocus               = 2,
	WeaponForward                  = 3,
	WeaponTowardsFocus             = 4,
	Custom                         = 5,
	Max_None                       = 6,
	EFortAbilityTargetingSource_MAX = 7,
};

enum class EFortAmmoType : uint8
{
	Pistol                         = 0,
	Shotgun                        = 1,
	Assault                        = 2,
	Sniper                         = 3,
	Energy                         = 4,
	EFortAmmoType_MAX              = 5,
};

enum class EFortEncryptionStatus : uint8
{
	ENCRYPTED                      = 0,
	RELEASED                       = 1,
	EFortEncryptionStatus_MAX      = 2,
};

enum class EFortSentenceAudioPreference : uint8
{
	AudioAsset                     = 0,
	FeedbackBank                   = 1,
	EFortSentenceAudioPreference_MAX = 2,
};

enum class ECreativePortalManagerValidityResult : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	ECreativePortalManagerValidityResult_MAX = 2,
};

enum class EFortCreativePlotPermission : uint8
{
	Private                        = 0,
	Public                         = 1,
	EFortCreativePlotPermission_MAX = 2,
};

enum class ERealEstateOffsetType : uint8
{
	CustomOffsetFromCorner         = 0,
	Center                         = 1,
	ERealEstateOffsetType_MAX      = 2,
};

enum class ETimespanAsTextFormat : uint8
{
	DaysHoursMinutesSeconds        = 0,
	Colons                         = 1,
	Approximate                    = 2,
	ETimespanAsTextFormat_MAX      = 3,
};

enum class EDeathCauseReason : uint8
{
	SelfInflicted                  = 0,
	SelfInflictedDBNO              = 1,
	Eliminated                     = 2,
	EliminatedDBNO                 = 3,
	EDeathCauseReason_MAX          = 4,
};

enum class EFortDefenderSubtype : uint8
{
	AssaultRifle                   = 0,
	Pistol                         = 1,
	Melee                          = 2,
	Sniper                         = 3,
	Shotgun                        = 4,
	Invalid                        = 5,
	EFortDefenderSubtype_MAX       = 6,
};

enum class EHordeTierStartStatus : uint8
{
	ReadyToStart                   = 0,
	WaitingForPlayer               = 1,
	WaitingForDBM                  = 2,
	GenericNotReadyToStart         = 3,
	EHordeTierStartStatus_MAX      = 4,
};

enum class EHordeWaveStingerType : uint8
{
	WaveSuccess                    = 0,
	WaveFailure                    = 1,
	WaveIncoming                   = 2,
	WaveStarted                    = 3,
	EHordeWaveStingerType_MAX      = 4,
};

enum class EQueueActionType : uint8
{
	Plot                           = 0,
	ZoneCleanup                    = 1,
	EnvironmentActorRestoration    = 2,
	EQueueActionType_MAX           = 3,
};

enum class EAthenaPIEStartupMode : uint8
{
	UseDefaults                    = 0,
	Warmup                         = 1,
	WarmupPaused                   = 2,
	Aircraft                       = 3,
	AircraftPaused                 = 4,
	Gameplay                       = 5,
	EAthenaPIEStartupMode_MAX      = 6,
};

enum class EFDynamicBuildOrder : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	None                           = 3,
	FDynamicBuildOrder_MAX         = 4,
};

enum class EFortFeedbackBroadcastFilter : uint8
{
	FFBF_Speaker                   = 0,
	FFBF_SpeakerTeam               = 1,
	FFBF_SpeakerAdressee           = 2,
	FFBF_HumanPvP_Team1            = 3,
	FFBF_HumanPvP_Team2            = 4,
	FFBF_None_Max                  = 5,
	FFBF_MAX                       = 6,
};

enum class EFortFeedbackSelectionMethod : uint8
{
	FFSM_Instigator                = 0,
	FFSM_Recipient                 = 1,
	FFSM_TeamWitness               = 2,
	FFSM_EnemyWitness              = 3,
	FFSM_Random                    = 4,
	FFSM_Priority_IRTE             = 5,
	FFSM_AllPawns                  = 6,
	FFSM_Announcer                 = 7,
	FFSM_MAX                       = 8,
};

enum class EFortFeedbackAddressee : uint8
{
	FFA_Instigator                 = 0,
	FFA_Recipient                  = 1,
	FFA_All                        = 2,
	FFA_MAX                        = 3,
};

enum class EFortFeedbackContext : uint8
{
	FFC_Instigator                 = 0,
	FFC_Recipient                  = 1,
	FFC_TeamWitness                = 2,
	FFC_EnemyWitness               = 3,
	FFC_AllPawns                   = 4,
	FFC_Announcer                  = 5,
	FFC_None_Max                   = 6,
	FFC_MAX                        = 7,
};

enum class EFortFootstepPosition : uint8
{
	Parallel                       = 0,
	Above                          = 1,
	Below                          = 2,
	AboveOrBelowAndVisible         = 3,
	Max_None                       = 4,
	EFortFootstepPosition_MAX      = 5,
};

enum class EFortFootstepSurfaceType : uint8
{
	Default                        = 0,
	Wood                           = 1,
	Stone                          = 2,
	Metal                          = 3,
	Water                          = 4,
	Snow                           = 5,
	Ice                            = 6,
	Lava                           = 7,
	Max_None                       = 8,
	EFortFootstepSurfaceType_MAX   = 9,
};

enum class EFortFootstepAudioType : uint8
{
	Crouch                         = 0,
	CrouchSprint                   = 1,
	Walk                           = 2,
	Sprint                         = 3,
	Jump                           = 4,
	Land                           = 5,
	LandHard                       = 6,
	Max_None                       = 7,
	EFortFootstepAudioType_MAX     = 8,
};

enum class ESubGameAccessReason : uint8
{
	NoAccess                       = 0,
	OpenAccess                     = 1,
	TokenItemAccess                = 2,
	XboxHomeSharingAccess          = 3,
	XboxServiceOutageAccess        = 4,
	LimitedAccess                  = 5,
	ESubGameAccessReason_MAX       = 6,
};

enum class EPartyFeedbackType : uint8
{
	PartyInProgressPlayerJoined    = 0,
	PartyInProgressPlayerLeft      = 1,
	Default                        = 2,
	EPartyFeedbackType_MAX         = 3,
};

enum class EFriendFeedbackType : uint8
{
	FriendRequestSent              = 0,
	FriendRequestReceived          = 1,
	FriendRequestAccepted          = 2,
	Default                        = 3,
	EFriendFeedbackType_MAX        = 4,
};

enum class EClampType : uint8
{
	Minimum                        = 0,
	Maximum                        = 1,
	EClampType_MAX                 = 2,
};

enum class EDynamicSoundOverride : uint8
{
	Cue                            = 0,
	Wave                           = 1,
	EDynamicSoundOverride_MAX      = 2,
};

enum class EPlayerQueueType : uint8
{
	Player                         = 0,
	Spectator                      = 1,
	Broadcaster                    = 2,
	EPlayerQueueType_MAX           = 3,
};

enum class EFortInputFilterLevel : uint8
{
	None                           = 0,
	Touch                          = 1,
	Gamepad                        = 2,
	Mouse                          = 3,
	EFortInputFilterLevel_MAX      = 4,
};

enum class EEventTournamentRound : uint8
{
	Qualifiers                     = 0,
	SemiFinals                     = 1,
	Finals                         = 2,
	Unknown                        = 3,
	EEventTournamentRound_MAX      = 4,
};

enum class EEventTournamentType : uint8
{
	Online                         = 0,
	Onsite                         = 1,
	Test                           = 2,
	Unknown                        = 3,
	EEventTournamentType_MAX       = 4,
};

enum class EAircraftLaunchReason : uint8
{
	StdTimerAllPlayers             = 0,
	EarlyTimerAllPlayers           = 1,
	StdTimerMostPlayers            = 2,
	EarlyTimerMostPlayers          = 3,
	StdTimerFewPlayers             = 4,
	EAircraftLaunchReason_MAX      = 5,
};

enum class EFortAbilityCostSource : uint8
{
	Stamina                        = 0,
	Durability                     = 1,
	AmmoMagazine                   = 2,
	AmmoPrimary                    = 3,
	Item                           = 4,
	EFortAbilityCostSource_MAX     = 5,
};

enum class EFortGameplayAbilityActivation : uint8
{
	Passive                        = 0,
	Triggered                      = 1,
	Active                         = 2,
	EFortGameplayAbilityActivation_MAX = 3,
};

enum class EFortAIWeaponUsage : uint8
{
	NoWeaponUsage                  = 0,
	UsesRangedWeapon               = 1,
	UsesMeleeWeapon                = 2,
	EFortAIWeaponUsage_MAX         = 3,
};

enum class EFortGameplayAbilityMontageSectionToPlay : uint8
{
	FirstSection                   = 0,
	RandomSection                  = 1,
	TestedRandomSection            = 2,
	EFortGameplayAbilityMontageSectionToPlay_MAX = 3,
};

enum class EJumpBoostPackState : uint8
{
	Idle                           = 0,
	Boost                          = 1,
	Hovering                       = 2,
	Falling                        = 3,
	None                           = 4,
	EJumpBoostPackState_MAX        = 5,
};

enum class EMedicPackState : uint8
{
	Idle                           = 0,
	Active                         = 1,
	None                           = 2,
	EMedicPackState_MAX            = 3,
};

enum class EFortGameplayCueSourceCondition : uint8
{
	AnySource                      = 0,
	LocalPlayerSource              = 1,
	NonLocalPlayerSource           = 2,
	EFortGameplayCueSourceCondition_MAX = 3,
};

enum class EFortGameplayCueAttachType : uint8
{
	AttachToTarget                 = 0,
	DoNotAttach                    = 1,
	EFortGameplayCueAttachType_MAX = 2,
};

enum class EPvPGameEndReasons : uint8
{
	PVPGER_TeamScoreLimit          = 0,
	PVPGER_LastManStanding         = 1,
	PVPGER_TimeExpired             = 2,
	PVPGER_MissionCompletion       = 3,
	PVPGER_MAX                     = 4,
};

enum class EFortServerGameMode : uint8
{
	Idle                           = 0,
	LobbyPvE                       = 1,
	LobbyPvP                       = 2,
	ZonePvP                        = 3,
	ZonePvE                        = 4,
	EFortServerGameMode_MAX        = 5,
};

enum class EFortBanHammerNotificationAction : uint8
{
	BanAndKick                     = 0,
	Kick                           = 1,
	EFortBanHammerNotificationAction_MAX = 2,
};

enum class ETeamChatRoomState : uint8
{
	NotCreated                     = 0,
	Creating                       = 1,
	Created                        = 2,
	Timeout                        = 3,
	ETeamChatRoomState_MAX         = 4,
};

enum class EPlayerIndicatorFlags : uint8
{
	None                           = 0,
	Minimap                        = 1,
	WorldArrow                     = 2,
	WorldName                      = 4,
	EPlayerIndicatorFlags_MAX      = 5,
};

enum class EFortScalabilityMode : uint8
{
	LowPower                       = 0,
	Frontend                       = 1,
	EFortScalabilityMode_MAX       = 2,
};

enum class ESavedAccountType : uint8
{
	None                           = 0,
	Facebook                       = 1,
	Google                         = 2,
	Epic                           = 3,
	Device                         = 4,
	Headless                       = 5,
	Refresh                        = 6,
	ESavedAccountType_MAX          = 7,
};

enum class EFortMobileFPSMode : uint8
{
	Mode_20Fps                     = 0,
	Mode_30Fps                     = 1,
	Mode_60Fps                     = 2,
	Mode_MAX                       = 3,
};

enum class EFortConsoleFPSMode : uint8
{
	Mode_30Fps                     = 0,
	Mode_30Fps_Unlocked            = 1,
	Mode_60Fps                     = 2,
	Mode_MAX                       = 3,
};

enum class EFortGiftWrapType : uint8
{
	System                         = 0,
	UserFree                       = 1,
	UserUnlock                     = 2,
	UserConsumable                 = 3,
	Message                        = 4,
	EFortGiftWrapType_MAX          = 5,
};

enum class EFortGlobalAction : uint8
{
	TrapConfirm                    = 0,
	TrapPicker                     = 1,
	BuildConfirm                   = 2,
	PerformBuildingEditInteraction = 3,
	PerformBuildingImprovementInteraction = 4,
	SwitchQuickBar                 = 5,
	Use                            = 6,
	Reload                         = 7,
	InventoryOrChatHold            = 8,
	GamepadChangeMaterialOrHarvestHold = 9,
	GamepadNextWeaponOrHarvestHold = 10,
	ChangeMaterial                 = 11,
	Fire                           = 12,
	RotatePrimitiveClockwise       = 13,
	Gadget1                        = 14,
	Gadget2                        = 15,
	Ability1                       = 16,
	Ability2                       = 17,
	Ability3                       = 18,
	ToggleFullScreenMap            = 19,
	ToggleInventory                = 20,
	Jump                           = 21,
	Crouch                         = 22,
	VehicleExit                    = 23,
	ShoppingCartCoast              = 24,
	VehicleJump                    = 25,
	GolfCartEBrake                 = 26,
	VehicleChangeSeat              = 27,
	GolfCartForward                = 28,
	GolfCartReverse                = 29,
	GolfCartHonk                   = 30,
	GamepadToggleHarvestOrHoldCreativePhone = 31,
	GamepadToggleCreativePhoneWeapon = 32,
	Count                          = 33,
	EFortGlobalAction_MAX          = 34,
};

enum class EChunkInstallState : uint8
{
	NotInstalled                   = 0,
	Pending                        = 1,
	Installed                      = 2,
	Unknown                        = 3,
	EChunkInstallState_MAX         = 4,
};

enum class EFortAccountLinkingUIConfig : uint8
{
	Disabled                       = 0,
	Default                        = 1,
	ExternalViewerOnly             = 2,
	FullExternal                   = 3,
	EFortAccountLinkingUIConfig_MAX = 4,
};

enum class EFortHelpContentLocation : uint8
{
	Top                            = 0,
	Bottom                         = 1,
	Max                            = 2,
};

enum class EFortHelpItemType : uint8
{
	Header                         = 0,
	Entry                          = 1,
	Max                            = 2,
};

enum class ESpecializationType : uint8
{
	Tier1                          = 0,
	Tier2                          = 1,
	Tier3                          = 2,
	Tier4                          = 3,
	NumTiers                       = 4,
	ESpecializationType_MAX        = 5,
};

enum class EFortHeroLoadoutPerkType : uint8
{
	Commander                      = 0,
	Standard                       = 1,
	EFortHeroLoadoutPerkType_MAX   = 2,
};

enum class EFortSupportBonusType : uint8
{
	Normal                         = 0,
	Tactical                       = 1,
	Max_None                       = 2,
	EFortSupportBonusType_MAX      = 3,
};

enum class EFortHexTileAdjacency : uint8
{
	North                          = 0,
	NorthEast                      = 1,
	SouthEast                      = 2,
	South                          = 3,
	SouthWest                      = 4,
	NorthWest                      = 5,
	Max_None                       = 6,
	EFortHexTileAdjacency_MAX      = 7,
};

enum class ESquadSlotType : uint8
{
	HeroSquadMissionDefender       = 0,
	SurvivorSquadLeadSurvivor      = 1,
	SurvivorSquadSurvivor          = 2,
	DefenderSquadMember            = 3,
	ExpeditionSquadMember          = 4,
	ESquadSlotType_MAX             = 5,
};

enum class EFortHomebaseSquadType : uint8
{
	AttributeSquad                 = 0,
	CombatSquad                    = 1,
	DefenderSquad                  = 2,
	ExpeditionSquad                = 3,
	Max_None                       = 4,
	EFortHomebaseSquadType_MAX     = 5,
};

enum class EHomebaseNodeType : uint8
{
	Gadget                         = 0,
	Utility                        = 1,
	Hidden                         = 2,
	EHomebaseNodeType_MAX          = 3,
};

enum class EFortHuskAnimType : uint8
{
	Basic                          = 0,
	Dwarf                          = 1,
	BlasterBig                     = 2,
	Weak                           = 3,
	TinyHead                       = 4,
	Beehive                        = 5,
	Husky                          = 6,
	Sploder                        = 7,
	Zapper                         = 8,
	EFortHuskAnimType_MAX          = 9,
};

enum class EFortInputGameMode : uint8
{
	SaveTheWorld                   = 0,
	Athena                         = 1,
	EFortInputGameMode_MAX         = 2,
};

enum class EFortIntensityCurveSequenceType : uint8
{
	Sequence                       = 0,
	Loop                           = 1,
	Random                         = 2,
	Max_None                       = 3,
	EFortIntensityCurveSequenceType_MAX = 4,
};

enum class ETInteractionType : uint8
{
	IT_NoInteraction               = 0,
	IT_Simple                      = 1,
	IT_LongPress                   = 2,
	IT_BuildingEdit                = 3,
	IT_BuildingImprovement         = 4,
	IT_TrapPlacement               = 5,
	IT_MAX                         = 6,
};

enum class EItemEvolutionRestrictionReason : uint8
{
	NoEvolutions                   = 0,
	BelowMaximumLevel              = 1,
	VaultOverflow                  = 2,
	MissingCatalyst                = 3,
	MissingCosts                   = 4,
	NoRarityUpgrade                = 5,
	InUseByCrafting                = 6,
	EItemEvolutionRestrictionReason_MAX = 7,
};

enum class EItemUpgradeRestrictionReason : uint8
{
	NoAdditionalLevels             = 0,
	MaximumLevelAchieved           = 1,
	VaultOverflow                  = 2,
	EItemUpgradeRestrictionReason_MAX = 3,
};

enum class EFortTemplateAccess : uint8
{
	Normal                         = 0,
	Trusted                        = 1,
	Private                        = 2,
	EFortTemplateAccess_MAX        = 3,
};

enum class EItemProfileType : uint8
{
	Common                         = 0,
	Campaign                       = 1,
	Athena                         = 2,
	EItemProfileType_MAX           = 3,
};

enum class EFortKickReason : uint8
{
	NotKicked                      = 0,
	GenericKick                    = 1,
	WasBanned                      = 2,
	EncryptionRequired             = 3,
	CrossPlayRestriction           = 4,
	ClientIdRestriction            = 5,
	EFortKickReason_MAX            = 6,
};

enum class ELobbyMissionGeneratorDetailsRequirement : uint8
{
	Unknown                        = 0,
	NotRequired                    = 1,
	Required                       = 2,
	ELobbyMissionGeneratorDetailsRequirement_MAX = 3,
};

enum class ELootQuotaLevel : uint8
{
	Unlimited                      = 0,
	Level1                         = 1,
	Level2                         = 2,
	Level3                         = 3,
	Level4                         = 4,
	Level5                         = 5,
	Level6                         = 6,
	Level7                         = 7,
	Level8                         = 8,
	Level9                         = 9,
	Level10                        = 10,
	Level11                        = 11,
	Level12                        = 12,
	Level13                        = 13,
	Level14                        = 14,
	Level15                        = 15,
	Level16                        = 16,
	Level17                        = 17,
	NumLevels                      = 18,
	ELootQuotaLevel_MAX            = 19,
};

enum class EFortMatchmakingType : uint8
{
	Gathering                      = 0,
	CriticalMission                = 1,
	QuickPlay                      = 2,
	Session                        = 3,
	EFortMatchmakingType_MAX       = 4,
};

enum class EFortSessionHelperJoinResult : uint8
{
	NoResult                       = 0,
	ReservationSuccess             = 1,
	ReservationFailure_PartyLimitReached = 2,
	ReservationFailure_IncorrectPlayerCount = 3,
	ReservationFailure_RequestTimedOut = 4,
	ReservationFailure_ReservationNotFound = 5,
	ReservationFailure_ReservationDenied = 6,
	ReservationFailure_ReservationDenied_Banned = 7,
	ReservationFailure_ReservationRequestCanceled = 8,
	ReservationFailure_ReservationInvalid = 9,
	ReservationFailure_BadSessionId = 10,
	ReservationFailure_ReservationDenied_ContainsExistingPlayers = 11,
	ReservationFailure_GeneralError = 12,
	ReservationFailure_NoSubsystem = 13,
	ReservationFailure_NoIdentity  = 14,
	ReservationFailure_InvalidSession = 15,
	ReservationFailure_InvalidUser = 16,
	ReservationFailure_EncryptionKey = 17,
	ReservationFailure_RefreshAuth = 18,
	ReservationFailure_AlreadyJoiningDuringReserve = 19,
	ReservationFailure_AlreadyJoiningDuringSkip = 20,
	JoinSessionSuccess             = 21,
	JoinSessionFailure_SessionIsFull = 22,
	JoinSessionFailure_SessionDoesNotExist = 23,
	JoinSessionFailure_CouldNotRetrieveAddress = 24,
	JoinSessionFailure_AlreadyInSession = 25,
	JoinSessionFailure_UnknownError = 26,
	JoinSessionFailure_InvalidSession = 27,
	JoinSessionFailure_InvalidSearchResultIndex = 28,
	JoinSessionFailure_AlreadyJoiningDuringJoin = 29,
	SearchPassFailure_NoSessionHelper = 30,
	SearchPassFailure_InvalidUser  = 31,
	SearchPassFailure_NoIdentity   = 32,
	SearchPassFailure_InvalidSearchResult = 33,
	SearchPassFailure_InvalidSearchResultIndex = 34,
	JoinSessionCanceled            = 35,
	EFortSessionHelperJoinResult_MAX = 36,
};

enum class EFortMatchmakingPool : uint8
{
	Any                            = 0,
	Desktop                        = 1,
	PS4                            = 2,
	XboxOne                        = 3,
	Mobile                         = 4,
	Test                           = 5,
	Switch                         = 6,
	Console                        = 7,
	All                            = 8,
	EFortMatchmakingPool_MAX       = 9,
};

enum class EFortMatchmakingPrivacyConfiguration : uint8
{
	UserPartyConfigured            = 0,
	ForcePrivate                   = 1,
	ForcePublic                    = 2,
	EFortMatchmakingPrivacyConfiguration_MAX = 3,
};

enum class EMatchmakingFlags : uint8
{
	None                           = 0,
	CreateNewOnly                  = 1,
	NoReservation                  = 2,
	Private                        = 4,
	UseWorldDataOwner              = 8,
	EMatchmakingFlags_MAX          = 9,
};

enum class EMatchmakingStartLocation : uint8
{
	Lobby                          = 0,
	Game                           = 1,
	CreateNew                      = 2,
	FindSingle                     = 3,
	EMatchmakingStartLocation_MAX  = 4,
};

enum class EMatchmakingCancelReasonV2 : uint8
{
	Explicit                       = 0,
	JoinedParty                    = 1,
	LeftParty                      = 2,
	PartyMemberJoined              = 3,
	PartyMemberLeft                = 4,
	PartyMemberCanceled            = 5,
	PlayReplay                     = 6,
	UIDestroyed                    = 7,
	PCDestroyed                    = 8,
	AppBackgrounded                = 9,
	HotfixOutdated                 = 10,
	TournamentOver                 = 11,
	NotInParty                     = 12,
	CrossplayBlocked               = 13,
	TournamentCrossplayBlocked     = 14,
	AccountLevelTooLow             = 15,
	FillNoCrossplay                = 16,
	Unknown                        = 17,
	EMatchmakingCancelReasonV2_MAX = 18,
};

enum class EMatchmakingErrorV2 : int32
{
	Success                        = 0,
	Canceled                       = 1,
	NeedUpdate                     = 2,
	VersionMismatch                = 3,
	NotLoggedIn                    = 4,
	NoIdentityInterface            = 5,
	NoSessionInterface             = 6,
	AlreadyInSession               = 7,
	FindSessionFailure             = 8,
	FailedToQueryEncryptionKey     = 9,
	FailedToRefreshAuthToken       = 10,
	FailedToCleanupSession         = 11,
	FailedToJoinSession            = 12,
	FailedToTravelToSession        = 13,
	Unauthorized                   = 14,
	BannedFromAthena               = 15,
	BannedFromAthenaForExploit     = 16,
	BannedFromAthenaForTeaming     = 17,
	BannedFromAthenaForTeamKilling = 18,
	InvalidCustomMatchKey          = 19,
	FailedToContactGameServices    = 20,
	FailedToConnectToMMS           = 21,
	MMSCommunicationIssue          = 22,
	ServiceReturnedError           = 23,
	PlaylistNoLongerAvailable      = 24,
	CrossplayUnsetWithInputDevicePoolShift = 25,
	CrossplayNeededForTournamentMatch = 26,
	MatchmakingDisabled            = 27,
	AccountLevelTooLow             = 28,
	UnknownError                   = 29,
	EMatchmakingErrorV2_MAX        = 30,
};

enum class EAthenaFilterDisplayType : uint8
{
	UseCategoryName                = 0,
	ShowFilterString               = 1,
	EAthenaFilterDisplayType_MAX   = 2,
};

enum class ESocialImportPanelPlatform : uint8
{
	Facebook                       = 0,
	VK                             = 1,
	Steam                          = 2,
	Xbox                           = 3,
	Playstation                    = 4,
	Switch                         = 5,
	ESocialImportPanelPlatform_MAX = 6,
};

enum class EPublishStatus : uint8
{
	Banned                         = 0,
	CannotPublish                  = 1,
	NeedsCreatorName               = 2,
	CanPublishProvisionally        = 3,
	CanPublish                     = 4,
	EPublishStatus_MAX             = 5,
};

enum class ETwitchViewerStatusType : uint8
{
	TwitchViewerStatus_Unknown     = 0,
	TwitchViewerStatus_Nonsubscriber = 1,
	TwitchViewerStatus_Subscriber  = 2,
	TwitchViewerStatus_Broadcaster = 3,
	TwitchViewerStatus_Max         = 4,
};

enum class EMegaStormState : uint8
{
	GatheringActorList             = 0,
	DamagingActors                 = 1,
	EMegaStormState_MAX            = 2,
};

enum class EMinigameFullscreenMapWidgetType : uint8
{
	Default_Map                    = 0,
	Creative_Scoreboard            = 1,
	EMinigameFullscreenMapWidgetType_MAX = 2,
};

enum class EFortMinigameEnd : uint8
{
	AbandonGame                    = 0,
	EndGame                        = 1,
	EndRound                       = 2,
	EFortMinigameEnd_MAX           = 3,
};

enum class EFortMinigameExec : uint8
{
	Yes                            = 0,
	No                             = 1,
	EFortMinigameExec_MAX          = 2,
};

enum class EMinigameTeamListType : uint8
{
	Blacklist                      = 0,
	Whitelist                      = 1,
	EMinigameTeamListType_MAX      = 2,
};

enum class EMinigameCaptureObjectiveState : uint8
{
	NotCaptured                    = 0,
	Captured                       = 1,
	EMinigameCaptureObjectiveState_MAX = 2,
};

enum class ETrackedObjectiveQuery : uint8
{
	All                            = 0,
	ExactTeam                      = 1,
	Friendly                       = 2,
	Neutral                        = 3,
	Hostile                        = 4,
	MAX                            = 5,
};

enum class EMinigameScoreType : uint8
{
	Time                           = 0,
	PointTotal                     = 1,
	EMinigameScoreType_MAX         = 2,
};

enum class EFortMinigameStatOperation : uint8
{
	Equal                          = 0,
	Less                           = 1,
	Greater                        = 2,
	LessOrEqual                    = 3,
	GreaterOrEqual                 = 4,
	EFortMinigameStatOperation_MAX = 5,
};

enum class EFortMinigameStatScope : uint8
{
	Group                          = 0,
	Team                           = 1,
	Player                         = 2,
	EFortMinigameStatScope_MAX     = 3,
};

enum class EFortMinigamePostGameSpawnLocationSetting : uint8
{
	IslandStart                    = 0,
	PreGameLocation                = 1,
	EFortMinigamePostGameSpawnLocationSetting_MAX = 2,
};

enum class EFortMinigamePlayerSpawnLocationSetting : uint8
{
	SpawnPads                      = 0,
	Air                            = 1,
	CurrentLocation                = 2,
	EFortMinigamePlayerSpawnLocationSetting_MAX = 3,
};

enum class EFortMiniMapIconRotation : uint8
{
	EFMMIR_None                    = 0,
	EFMMIR_Absolute                = 1,
	EFMMIR_Relative                = 2,
	EFMMIR_MAX                     = 3,
};

enum class EFortMiniMapContext : uint8
{
	EFMC_MiniMap                   = 0,
	EFMC_FullScreenMap             = 1,
	EFMC_MAX                       = 2,
};

enum class EFortMiniMapHeight : uint8
{
	EFMH_Equal                     = 0,
	EFMH_Below                     = 1,
	EFMH_Above                     = 2,
	EFMH_MAX                       = 3,
};

enum class EFortCheatMissionGenType : uint8
{
	NewGeneration                  = 0,
	OldGeneration                  = 1,
	Max_None                       = 2,
	EFortCheatMissionGenType_MAX   = 3,
};

enum class EFortOptionGenerationResult : uint8
{
	NoOptionsGenerated             = 0,
	NewOptionsGenerated            = 1,
	ExistingOptionsGenerated       = 2,
	EFortOptionGenerationResult_MAX = 3,
};

enum class EPollActorsInVolumeTypes : uint8
{
	DesignerPlacedOnly             = 0,
	PlayerBuiltOnly                = 1,
	All                            = 2,
	EPollActorsInVolumeTypes_MAX   = 3,
};

enum class EMissionReplyTypes : uint8
{
	Handled                        = 0,
	NotHandled                     = 1,
	EMissionReplyTypes_MAX         = 2,
};

enum class EMissionStormShieldState : uint8
{
	IDLE                           = 0,
	GROWING                        = 1,
	SHRINKING                      = 2,
	MAX                            = 3,
};

enum class ETimerOverrideSetting : uint8
{
	DefaultBehavior                = 0,
	ForceShow                      = 1,
	ForceHide                      = 2,
	ShowAtEnd                      = 3,
	ETimerOverrideSetting_MAX      = 4,
};

enum class EFortMtxPlatform : uint8
{
	Epic                           = 0,
	PSN                            = 1,
	Live                           = 2,
	Shared                         = 3,
	EpicPC                         = 4,
	EpicPCKorea                    = 5,
	IOSAppStore                    = 6,
	EpicAndroid                    = 7,
	Nintendo                       = 8,
	WeGame                         = 9,
	Samsung                        = 10,
	EFortMtxPlatform_MAX           = 11,
};

enum class EFortMusicSectionType : uint8
{
	Intro                          = 0,
	Loop                           = 1,
	Outro                          = 2,
	Max_None                       = 3,
	EFortMusicSectionType_MAX      = 4,
};

enum class EFortMusicSectionStopBehavior : uint8
{
	Crossfade                      = 0,
	AllowFadeOut                   = 1,
	EFortMusicSectionStopBehavior_MAX = 2,
};

enum class EFortMusicCombatIntensity : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	VeryHigh                       = 3,
	Max_None                       = 4,
	EFortMusicCombatIntensity_MAX  = 5,
};

enum class EMusicChannel : uint8
{
	VoiceA                         = 0,
	VoiceB                         = 1,
	Max_None                       = 2,
	EMusicChannel_MAX              = 3,
};

enum class EMusicFadeStyles : uint8
{
	CrossFade                      = 0,
	FadeOutThenIn                  = 1,
	Max_None                       = 2,
	EMusicFadeStyles_MAX           = 3,
};

enum class EMutatorListInitState : int32
{
	Default                        = 0,
	Enabled                        = 1,
	Disabled                       = 2,
	EMutatorListInitState_MAX      = 3,
};

enum class EFortAreaFlag : uint8
{
	Default                        = 0,
	Obstacle                       = 1,
	Smashable                      = 2,
	Unwalkable                     = 3,
	Interactable                   = 4,
	EFortAreaFlag_MAX              = 5,
};

enum class EFortNavLinkPattern : uint8
{
	Floor                          = 0,
	Stairs                         = 1,
	Roof                           = 2,
	Manual                         = 3,
	EFortNavLinkPattern_MAX        = 4,
};

enum class EFortNamedNavmesh : uint8
{
	Husk                           = 0,
	Smasher                        = 1,
	MAX                            = 2,
};

enum class EGameReadiness : uint8
{
	NotReady                       = 0,
	Ready                          = 1,
	SittingOut                     = 2,
	EGameReadiness_MAX             = 3,
};

enum class ESquadChangeType : uint8
{
	JoinSquad                      = 0,
	BenchSelf                      = 1,
	UnbenchSelf                    = 2,
	Swap                           = 3,
	None                           = 4,
	ESquadChangeType_MAX           = 5,
};

enum class EPathUndermineEvent : uint8
{
	Predicted                      = 0,
	Started                        = 1,
	Finished                       = 2,
	EPathUndermineEvent_MAX        = 3,
};

enum class EPathObstacleAction : uint8
{
	Melee                          = 0,
	Ignore                         = 1,
	AbortMoveAsFailed              = 2,
	FinishMoveAsSucceeded          = 3,
	EPathObstacleAction_MAX        = 4,
};

enum class EWardAffectType : uint8
{
	AffectsBothStartAndEndPoints   = 0,
	AffectsOnlyStartPoints         = 1,
	AffectsOnlyEndPoints           = 2,
	EWardAffectType_MAX            = 3,
};

enum class EFortControlRecoveryBehavior : uint8
{
	DefaultControl                 = 0,
	LimitedControl                 = 1,
	ChainControl                   = 2,
	EFortControlRecoveryBehavior_MAX = 3,
};

enum class EFortPawnPushSize : uint8
{
	FFPS_Normal                    = 0,
	FPPS_Player                    = 1,
	FPPS_Large                     = 2,
	FPPS_SuperLarge                = 3,
	EFortPawnPushSize_MAX          = 4,
};

enum class EFortAnnouncerTeamVocalChords : uint8
{
	Team1                          = 0,
	Team2                          = 1,
	Max_None                       = 2,
	EFortAnnouncerTeamVocalChords_MAX = 3,
};

enum class EFortBadMatchTeamSize : uint8
{
	Unspecified                    = 0,
	SmallTeam                      = 1,
	LargeTeam                      = 2,
	EFortBadMatchTeamSize_MAX      = 3,
};

enum class EFortBadMatchTriggerOperation : uint8
{
	LessThan                       = 0,
	LessThanOrEqual                = 1,
	Equal                          = 2,
	GreaterThan                    = 3,
	GreaterThanOrEqual             = 4,
	EFortBadMatchTriggerOperation_MAX = 5,
};

enum class EFortRewardType : uint8
{
	Default                        = 0,
	Missed                         = 1,
	Max_None                       = 2,
	EFortRewardType_MAX            = 3,
};

enum class EFortReplicatedStat : uint8
{
	MonsterKills                   = 0,
	MonsterDamagePoints            = 1,
	PlayerKills                    = 2,
	WoodGathered                   = 3,
	StoneGathered                  = 4,
	MetalGathered                  = 5,
	Deaths                         = 6,
	BuildingsBuilt                 = 7,
	BuildingsBuilt_Wood            = 8,
	BuildingsBuilt_Stone           = 9,
	BuildingsBuilt_Metal           = 10,
	BuildingsUpgraded_Wood2        = 11,
	BuildingsUpgraded_Wood3        = 12,
	BuildingsUpgraded_Stone2       = 13,
	BuildingsUpgraded_Stone3       = 14,
	BuildingsUpgraded_Metal2       = 15,
	BuildingsUpgraded_Metal3       = 16,
	BuildingsDestroyed             = 17,
	Repair_Wood                    = 18,
	Repair_Stone                   = 19,
	Repair_Metal                   = 20,
	FlagsCaptured                  = 21,
	FlagsReturned                  = 22,
	ContainersLooted               = 23,
	CraftingPoints                 = 24,
	TrapPlacementPoints            = 25,
	TrapActivationPoints           = 26,
	TotalScore                     = 27,
	OldTotalScore                  = 28,
	CombatScore                    = 29,
	BuildingScore                  = 30,
	UtilityScore                   = 31,
	BadgesScore                    = 32,
	None                           = 33,
	MAX                            = 34,
};

enum class EFortReplenishmentType : uint8
{
	Restricted                     = 0,
	ClampMin                       = 1,
	Add                            = 2,
	Ability                        = 3,
	EFortReplenishmentType_MAX     = 4,
};

enum class EFortPickupTossState : uint8
{
	NotTossed                      = 0,
	InProgress                     = 1,
	AtRest                         = 2,
	EFortPickupTossState_MAX       = 3,
};

enum class EFortPickupSpawnSource : uint8
{
	Unset                          = 0,
	PlayerElimination              = 1,
	Chest                          = 2,
	SupplyDrop                     = 3,
	AmmoBox                        = 4,
	EFortPickupSpawnSource_MAX     = 5,
};

enum class EFortPickupSourceTypeFlag : uint8
{
	Other                          = 0,
	Player                         = 1,
	Destruction                    = 2,
	Container                      = 4,
	AI                             = 8,
	Tossed                         = 16,
	FloorLoot                      = 32,
	EFortPickupSourceTypeFlag_MAX  = 33,
};

enum class EFortPlayerAnimBodyType : uint8
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	EFortPlayerAnimBodyType_MAX    = 3,
};

enum class ECreativeQuickbarSlots : uint8
{
	Phone                          = 0,
	ECreativeQuickbarSlots_MAX     = 1,
};

enum class EQuickbarSlots : uint8
{
	HarvestingTool                 = 0,
	Weapon1                        = 1,
	Weapon2                        = 2,
	Weapon3                        = 3,
	Gadget1                        = 4,
	Gadget2                        = 5,
	Ability1                       = 6,
	Ability2                       = 7,
	Ability3                       = 8,
	EQuickbarSlots_MAX             = 9,
};

enum class EFortPickerToDisplay : uint8
{
	TrapPicker                     = 0,
	WeaponPicker                   = 1,
	SocialPicker                   = 2,
	ChatPicker                     = 3,
	NotePicker                     = 4,
	EmotePicker                    = 5,
	SquadQuickChatPicker           = 6,
	EFortPickerToDisplay_MAX       = 7,
};

enum class EMapZoomingMode : uint8
{
	None                           = 0,
	ZoomingIn                      = 1,
	ZoomingOut                     = 2,
	EMapZoomingMode_MAX            = 3,
};

enum class EFortIdleDetectionState : uint8
{
	Disabled                       = 0,
	Default                        = 1,
	Suspicious                     = 2,
	Inactive                       = 3,
	EFortIdleDetectionState_MAX    = 4,
};

enum class ECameraStateRestoreReason : uint8
{
	Unknown                        = 0,
	ChangedFollowTarget            = 1,
	ChangedCameraType              = 2,
	InvokedHotKey                  = 3,
	Scrubbed                       = 4,
	Restored                       = 5,
	SpecialAction                  = 6,
	MAX                            = 7,
};

enum class EFollow : uint8
{
	NextTeammate                   = 0,
	PreviousTeammate               = 1,
	SpecialActor                   = 2,
	EFollow_MAX                    = 3,
};

enum class EFortMotionYawAxis : uint8
{
	Yaw                            = 0,
	Roll                           = 1,
	EFortMotionYawAxis_MAX         = 2,
};

enum class EFortInputActionGroup : uint8
{
	AllModes                       = 0,
	Combat                         = 1,
	Building                       = 2,
	Movement                       = 3,
	Edit                           = 4,
	Death                          = 5,
	Cinematic                      = 6,
	Picker                         = 7,
	Other                          = 8,
	Vehicle                        = 9,
	ShoppingCart                   = 10,
	GolfCart                       = 11,
	QuadCrasher                    = 12,
	Biplane                        = 13,
	Jackal                         = 14,
	Hamsterball                    = 15,
	ShipCannon                     = 16,
	Spectating                     = 17,
	FullscreenMap                  = 18,
	CreativeAll                    = 19,
	CreativeMoveToolEquipped       = 20,
	CreativeMoveObjectsFreely      = 21,
	CreativeMoveBuildingsOnGrid    = 22,
	CreativeFlying                 = 23,
	CreativeIslandPanel            = 24,
	CombatAndBuilding              = 25,
	EFortInputActionGroup_MAX      = 26,
};

enum class EFortInputActionType : uint8
{
	Press                          = 0,
	Click                          = 1,
	Hold                           = 2,
	Release                        = 3,
	EFortInputActionType_MAX       = 4,
};

enum class EFortInputDevice : uint8
{
	Mouse                          = 0,
	Keyboard                       = 1,
	Gamepad                        = 2,
	Touch                          = 3,
	EFortInputDevice_MAX           = 4,
};

enum class EItemInteractionStatus : uint8
{
	Interrupted                    = 0,
	Completed                      = 1,
	TimedOut                       = 2,
	EItemInteractionStatus_MAX     = 3,
};

enum class EItemInteractionType : uint8
{
	Search                         = 0,
	LockOnSearch                   = 1,
	None                           = 2,
	EItemInteractionType_MAX       = 3,
};

enum class EFortPawnStasisMode : uint8
{
	None                           = 0,
	NoMovement                     = 1,
	NoMovementOrTurning            = 2,
	NoMovementOrFalling            = 3,
	EFortPawnStasisMode_MAX        = 4,
};

enum class EBodyPartVisibilityGrouping : uint8
{
	AllParts                       = 0,
	AllButHead                     = 1,
	OnlyBackBling                  = 2,
	BackBlingAndCharm              = 3,
	EBodyPartVisibilityGrouping_MAX = 4,
};

enum class EBackpackType : uint8
{
	Jetpack                        = 0,
	Medic                          = 1,
	StormTracker                   = 2,
	Glider                         = 3,
	EBackpackType_MAX              = 4,
};

enum class ETrustedPlatformType : uint8
{
	Unknown                        = 0,
	Untrusted                      = 1,
	PS4                            = 2,
	XboxOne                        = 3,
	Switch                         = 4,
	ETrustedPlatformType_MAX       = 5,
};

enum class ETeamMemberState : uint8
{
	None                           = 0,
	FIRST_CHAT_MESSAGE             = 1,
	NeedAmmoHeavy                  = 1,
	NeedAmmoLight                  = 2,
	NeedAmmoMedium                 = 3,
	NeedAmmoShells                 = 4,
	NeedAmmoRocket                 = 5,
	ChatBubble                     = 6,
	EnemySpotted                   = 7,
	NeedBandages                   = 8,
	NeedMaterials                  = 9,
	NeedShields                    = 10,
	NeedWeapon                     = 11,
	LAST_CHAT_MESSAGE              = 11,
	MAX                            = 12,
};

enum class EFortPawnState : uint8
{
	Default                        = 0,
	InCombat                       = 1,
	DBNO                           = 2,
	IsReviving                     = 4,
	BeingRevived                   = 8,
	Dead                           = 16,
	EFortPawnState_MAX             = 17,
};

enum class EFortPlayerSurveyAnalyticsFinishReason : uint8
{
	Submitted                      = 0,
	Canceled                       = 1,
	EFortPlayerSurveyAnalyticsFinishReason_MAX = 2,
};

enum class EFortPlayerSurveyQuestionPresentationStyle : uint8
{
	Invalid                        = 0,
	MultipleChoice_Rating          = 1,
	Num                            = 2,
	EFortPlayerSurveyQuestionPresentationStyle_MAX = 3,
};

enum class EFortPlayerSurveyQuestionType : uint8
{
	Invalid                        = 0,
	MultipleChoice                 = 1,
	Num                            = 2,
	EFortPlayerSurveyQuestionType_MAX = 3,
};

enum class EVehicleTrickType : uint8
{
	None                           = 0,
	RollIncrement                  = 1,
	ReverseRollIncrement           = 2,
	YawIncrement                   = 3,
	ReverseYawIncrement            = 4,
	PitchIncrement                 = 5,
	ReversePitchIncrement          = 6,
	HeightIncrement                = 7,
	DistanceIncrement              = 8,
	AirTimeIncrement               = 9,
	ShoppingCart_Flying            = 10,
	ShoppingCart_Stooping          = 11,
	StartedLanding                 = 12,
	FailedLanding                  = 13,
	Cancelled                      = 14,
	StuckLanding                   = 15,
	Count                          = 16,
	EVehicleTrickType_MAX          = 17,
};

enum class EVehicleTrickAxis : uint8
{
	X                              = 0,
	XNeg                           = 1,
	Y                              = 2,
	YNeg                           = 3,
	Z                              = 4,
	ZNeg                           = 5,
	Count                          = 6,
	EVehicleTrickAxis_MAX          = 7,
};

enum class EDBNOType : uint8
{
	On                             = 0,
	Off                            = 1,
	NotWhenRespawning              = 2,
	EDBNOType_MAX                  = 3,
};

enum class EWeaponSelectionPreservationType : uint8
{
	KeepSelectionWhenRespawning    = 0,
	NeverKeepSelection             = 1,
	EWeaponSelectionPreservationType_MAX = 2,
};

enum class ERewardPlacementBonusType : uint8
{
	Solo                           = 0,
	Duo                            = 1,
	Squad                          = 2,
	LargeTeam                      = 3,
	None                           = 4,
	TwoTeam                        = 5,
	MediumTeam                     = 6,
	QuickSolo                      = 7,
	QuickDuo                       = 8,
	QuickSquad                     = 9,
	QuickLargeTeam                 = 10,
	QuickTwoTeam                   = 11,
	QuickMediumTeam                = 12,
	SinglePlacement                = 13,
	ERewardPlacementBonusType_MAX  = 14,
};

enum class ERewardTimePlayedType : uint8
{
	Default                        = 0,
	NoReward                       = 1,
	FlatValue                      = 2,
	ERewardTimePlayedType_MAX      = 3,
};

enum class EPlaylistUIExtensionSlot : uint8
{
	Primary                        = 0,
	TopRightCorner                 = 1,
	GameInfoBox                    = 2,
	Quickbar                       = 3,
	UpperCenter                    = 4,
	EPlaylistUIExtensionSlot_MAX   = 5,
};

enum class EAthenaWinCondition : uint8
{
	LastManStanding                = 0,
	LastManStandingIncludingAllies = 1,
	TimedTeamFinalFight            = 2,
	FirstToGoalScore               = 3,
	TimedLastMenStanding           = 4,
	MutatorControlled              = 5,
	MutatorControlledGoalScore     = 6,
	EAthenaWinCondition_MAX        = 7,
};

enum class EAthenaRespawnLocation : uint8
{
	LastDeath                      = 0,
	CreativePlayerStart            = 1,
	EAthenaRespawnLocation_MAX     = 2,
};

enum class EAthenaRespawnType : uint8
{
	None                           = 0,
	InfiniteRespawn                = 1,
	InfiniteRespawnExceptStorm     = 2,
	EAthenaRespawnType_MAX         = 3,
};

enum class EPlaylistVisibilityState : uint8
{
	Enabled                        = 0,
	Disabled                       = 1,
	Hidden                         = 2,
	EPlaylistVisibilityState_MAX   = 3,
};

enum class EPlaylistAdvertisementType : uint8
{
	None                           = 0,
	New                            = 1,
	Updated                        = 2,
	EPlaylistAdvertisementType_MAX = 3,
};

enum class EPlaysetOffsetType : uint8
{
	CustomOffsetFromCorner         = 0,
	Center                         = 1,
	EPlaysetOffsetType_MAX         = 2,
};

enum class EProfileGoState : uint8
{
	None                           = 0,
	SettlingLocation               = 1,
	RunningCommands                = 2,
	CompletedScenario              = 3,
	Summary                        = 4,
	Completed                      = 5,
	EProfileGoState_MAX            = 6,
};

enum class EFortHomingStyle : uint8
{
	None                           = 0,
	LockOn                         = 1,
	LaserTargeted                  = 2,
	LaserTargeted_NoTrace          = 3,
	EFortHomingStyle_MAX           = 4,
};

enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8
{
	AllGoalsInRange                = 0,
	AnyGoalInRange                 = 1,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX = 2,
};

enum class EFortTestGoalActorDot : uint8
{
	Dot3D                          = 0,
	Dot2D                          = 1,
	EFortTestGoalActorDot_MAX      = 2,
};

enum class EDistanceMode : uint8
{
	DistItemToContext              = 0,
	DistItemGoalActorToContext     = 1,
	DistItemToItemGoalActor        = 2,
	EDistanceMode_MAX              = 3,
};

enum class ECountAIAssignedToType : uint8
{
	Goal                           = 0,
	Actor                          = 1,
	Assignment                     = 2,
	ECountAIAssignedToType_MAX     = 3,
};

enum class ETwoPointSolverRotationA : uint8
{
	PointAToQuerier                = 0,
	QuerierToPointA                = 1,
	PointAToQuerierWithRandomOffset = 2,
	QuerierToPointAWithRandomOffset = 3,
	Custom                         = 4,
	ETwoPointSolverRotationA_MAX   = 5,
};

enum class EObjectiveStatusUpdateType : uint8
{
	Always                         = 0,
	OnPercent                      = 1,
	OnComplete                     = 2,
	Never                          = 3,
	EObjectiveStatusUpdateType_MAX = 4,
};

enum class EFortQuestRewardType : uint8
{
	BasicRewards                   = 0,
	BasicPlusSingleChoice          = 1,
	EFortQuestRewardType_MAX       = 2,
};

enum class EFortQuestType : uint8
{
	Task                           = 0,
	Optional                       = 1,
	DailyQuest                     = 2,
	TransientQuest                 = 3,
	SurvivorQuest                  = 4,
	Achievement                    = 5,
	Onboarding                     = 6,
	StreamBroadcaster              = 7,
	StreamViewer                   = 8,
	StreamSubscriber               = 9,
	Athena                         = 10,
	AthenaDailyQuest               = 11,
	AthenaEvent                    = 12,
	AthenaChallengeBundleQuest     = 13,
	All                            = 14,
	EFortQuestType_MAX             = 15,
};

enum class ECosmeticType : uint8
{
	Image                          = 0,
	Widget                         = 1,
	ECosmeticType_MAX              = 2,
};

enum class EFortQuestMapNodeLabelPosition : uint8
{
	Top                            = 0,
	Bottom                         = 1,
	EFortQuestMapNodeLabelPosition_MAX = 2,
};

enum class EFortQuestMapNodeType : uint8
{
	MandatoryQuest                 = 0,
	SideQuest                      = 1,
	EFortQuestMapNodeType_MAX      = 2,
};

enum class EFortQuestObjectiveItemEvent : uint8
{
	Craft                          = 0,
	Collect                        = 1,
	Acquire                        = 2,
	Consume                        = 3,
	OpenCardPack                   = 4,
	PurchaseCardPack               = 5,
	Convert                        = 6,
	Upgrade                        = 7,
	UpgradeRarity                  = 8,
	QuestComplete                  = 9,
	AssignWorker                   = 10,
	LevelUpCollectionBook          = 11,
	LevelUpAthenaSeason            = 12,
	LevelUpBattlePass              = 13,
	GainAthenaSeasonXp             = 14,
	HasItem                        = 15,
	HasAccumulatedItem             = 16,
	SlotInCollection               = 17,
	AlterationRespec               = 18,
	AlterationUpgrade              = 19,
	HasCompletedQuest              = 20,
	HasAssignedWorker              = 21,
	HasUpgraded                    = 22,
	HasConverted                   = 23,
	HasUpgradedRarity              = 24,
	HasLeveledUpCollectionBook     = 25,
	SlotHeroInLoadout              = 26,
	HasLeveledUpAthenaSeason       = 27,
	HasLeveledUpBattlePass         = 28,
	HasGainedAthenaSeasonXp        = 29,
	MinigameTime                   = 30,
	Max_None                       = 31,
	EFortQuestObjectiveItemEvent_MAX = 32,
};

enum class EFortQuestObjectiveStatEvent : uint8
{
	Kill                           = 0,
	TeamKill                       = 1,
	KillContribution               = 2,
	Damage                         = 3,
	Damage_OLD                     = 4,
	Visit                          = 5,
	Land                           = 6,
	Emote                          = 7,
	Spray                          = 8,
	Toy                            = 9,
	Build                          = 10,
	BuildingEdit                   = 11,
	BuildingRepair                 = 12,
	BuildingUpgrade                = 13,
	PlaceTrap                      = 14,
	Complete                       = 15,
	Craft                          = 16,
	Collect                        = 17,
	Win                            = 18,
	Interact                       = 19,
	TeamInteract                   = 20,
	Destroy                        = 21,
	Ability                        = 22,
	WaveComplete                   = 23,
	Custom                         = 24,
	ComplexCustom                  = 25,
	Client                         = 26,
	AthenaRank                     = 27,
	AthenaOutlive                  = 28,
	RevivePlayer                   = 29,
	Heal                           = 30,
	EarnVehicleTrickPoints         = 31,
	VehicleAirTime                 = 32,
	TimeElapsed                    = 33,
	NumGameplayEvents              = 34,
	Acquire                        = 35,
	Consume                        = 36,
	OpenCardPack                   = 37,
	PurchaseCardPack               = 38,
	Convert                        = 39,
	Upgrade                        = 40,
	UpgradeRarity                  = 41,
	QuestComplete                  = 42,
	AssignWorker                   = 43,
	CollectExpedition              = 44,
	CollectSuccessfulExpedition    = 45,
	LevelUpCollectionBook          = 46,
	LevelUpAthenaSeason            = 47,
	LevelUpBattlePass              = 48,
	GainAthenaSeasonXp             = 49,
	HasItem                        = 50,
	HasAccumulatedItem             = 51,
	SlotInCollection               = 52,
	AlterationRespec               = 53,
	AlterationUpgrade              = 54,
	HasCompletedQuest              = 55,
	HasAssignedWorker              = 56,
	HasUpgraded                    = 57,
	HasConverted                   = 58,
	HasUpgradedRarity              = 59,
	HasLeveledUpCollectionBook     = 60,
	SlotHeroInLoadout              = 61,
	HasLeveledUpAthenaSeason       = 62,
	HasLeveledUpBattlePass         = 63,
	HasGainedAthenaSeasonXp        = 64,
	MinigameDynamicEvent           = 65,
	MinigameComplete               = 66,
	MinigameDeath                  = 67,
	MinigameAssist                 = 68,
	Max_None                       = 69,
	EFortQuestObjectiveStatEvent_MAX = 70,
};

enum class EFortChallengeBundleInfoLockedReasonCode : uint8
{
	Unlocked                       = 0,
	NoKnownUnlockMethod            = 1,
	PurchaseTheBattlePass          = 2,
	ReachSpecificTier              = 3,
	TimeLeftBeforeUnlock           = 4,
	EFortChallengeBundleInfoLockedReasonCode_MAX = 5,
};

enum class EFortQuestState : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	Completed                      = 2,
	Claimed                        = 3,
	EFortQuestState_MAX            = 4,
};

enum class ERegisteredPlayerUnregistrationStatus : uint8
{
	Registered                     = 0,
	UnregistrationStarting         = 1,
	UnregistrationWaitingForInitialLock = 2,
	UnregistrationWaitingForScoreSave = 3,
	UnregistrationWaitingForFinalSave = 4,
	UnregistrationWaitingForProfileUnlock = 5,
	UnregistrationComplete         = 6,
	ERegisteredPlayerUnregistrationStatus_MAX = 7,
};

enum class ESpectatorSquadIdMode : uint8
{
	AlwaysOff                      = 0,
	AlwaysOn                       = 1,
	HoldToDisplay                  = 2,
	ESpectatorSquadIdMode_MAX      = 3,
};

enum class EEventMatchScreen : uint8
{
	None                           = 0,
	ActivePlayerGrid               = 1,
	EliminatedPlayerGrid           = 2,
	MatchStatus                    = 3,
	Scoreboard                     = 4,
	EEventMatchScreen_MAX          = 5,
};

enum class EDroneFollowMode : uint8
{
	None                           = 0,
	ForceFacingLocation            = 1,
	ForceFacingFollowedPlayer      = 2,
	TetherToFollowedPlayer         = 3,
	MAX                            = 4,
};

enum class EClassRepNodeMapping : uint8
{
	NotRouted                      = 0,
	RelevantAllConnections         = 1,
	Spatialize_Static              = 2,
	Spatialize_Dynamic             = 3,
	Spatialize_Dormancy            = 4,
	EClassRepNodeMapping_MAX       = 5,
};

enum class EFortSafeZoneState : uint8
{
	None                           = 0,
	Starting                       = 1,
	Holding                        = 2,
	Shrinking                      = 3,
	EFortSafeZoneState_MAX         = 4,
};

enum class EFortUIScoreType : uint8
{
	Combat                         = 0,
	Building                       = 1,
	Utility                        = 2,
	Badges                         = 3,
	Bonus                          = 4,
	Total                          = 5,
	Max_None                       = 6,
	EFortUIScoreType_MAX           = 7,
};

enum class EFortScriptedActionEnvironment : uint8
{
	FrontEnd                       = 0,
	GameServer                     = 1,
	GameClient                     = 2,
	Max_None                       = 3,
	EFortScriptedActionEnvironment_MAX = 4,
};

enum class EFortScriptedActionSource : uint8
{
	Quest                          = 0,
	Token                          = 1,
	Manual                         = 2,
	Max_None                       = 3,
	EFortScriptedActionSource_MAX  = 4,
};

enum class EServerManifestOutputFormat : uint8
{
	FlatFile                       = 0,
	Json                           = 1,
	HTTP                           = 2,
	EServerManifestOutputFormat_MAX = 3,
};

enum class EServerManifestCommandType : uint8
{
	Move                           = 0,
	Copy                           = 1,
	Unknown                        = 2,
	EServerManifestCommandType_MAX = 3,
};

enum class EFortSessionHelperJoinState : uint8
{
	NotJoining                     = 0,
	RequestingReservation          = 1,
	FailedReservation              = 2,
	WaitingOnGame                  = 3,
	AttemptingJoin                 = 4,
	JoiningSession                 = 5,
	FailedJoin                     = 6,
	CanceledJoin                   = 7,
	EFortSessionHelperJoinState_MAX = 8,
};

enum class EFortSoundIndicatorTypes : uint8
{
	Generic                        = 0,
	FootStep                       = 1,
	Gunshot                        = 2,
	Chest                          = 3,
	Glider                         = 4,
	Vehicle                        = 5,
	COUNT                          = 6,
	EFortSoundIndicatorTypes_MAX   = 7,
};

enum class EFortSpawnActorTime : uint8
{
	PostPlaylistLoad               = 0,
	StartOfStormHoldTime           = 1,
	EFortSpawnActorTime_MAX        = 2,
};

enum class EFortEventConditionType : uint8
{
	EFEC_StatCompare               = 0,
	EFEC_CanCraft                  = 1,
	EFEC_MAX                       = 2,
};

enum class EFortCompare : uint8
{
	EFC_LessThan                   = 0,
	EFC_LessThanOrEqual            = 1,
	EFC_GreaterThan                = 2,
	EFC_GreaterThanOrEqual         = 3,
	EFC_Equals                     = 4,
	EFC_MAX                        = 5,
};

enum class EFortEventRepeat : uint8
{
	EFER_Inactive                  = 0,
	EFER_Always                    = 1,
	EFER_OncePerPlayer             = 2,
	EFER_OncePerCampaign           = 3,
	EFER_OncePerMap                = 4,
	EFER_MAX                       = 5,
};

enum class EFortStatType : uint8
{
	Fortitude                      = 0,
	Offense                        = 1,
	Resistance                     = 2,
	Technology                     = 3,
	Fortitude_Team                 = 4,
	Offense_Team                   = 5,
	Resistance_Team                = 6,
	Technology_Team                = 7,
	Invalid                        = 8,
	EFortStatType_MAX              = 9,
};

enum class ESupplyDropItemTrackType : uint8
{
	SpecialActors                  = 0,
	ESupplyDropItemTrackType_MAX   = 1,
};

enum class ESupplyDropSpawnType : uint8
{
	SafeZoneDriven                 = 0,
	ItemDeliveryManagement         = 1,
	ESupplyDropSpawnType_MAX       = 2,
};

enum class EFortAutoTestState : uint8
{
	InitialLoad                    = 0,
	Login                          = 1,
	FrontendLoad                   = 2,
	FrontendPvELoad                = 3,
	FrontendPvETest                = 4,
	PvEMatchmaking                 = 5,
	ZoneLoad                       = 6,
	ZoneTest                       = 7,
	Finished                       = 8,
	MAX                            = 9,
};

enum class EReplaySmokeTestStep : uint8
{
	Setup                          = 0,
	TogglePause                    = 1,
	StepForward                    = 2,
	StepBackward                   = 3,
	StepToEnd                      = 4,
	StepToBeginning                = 5,
	SpeedUpPlayback                = 6,
	SlowDownPlayback               = 7,
	ToggleHideTimeline             = 8,
	IterateCameraModes             = 9,
	TogglePlayerOutlines           = 10,
	ToggleNamePlates               = 11,
	ToggleReplayRegion             = 12,
	ZoomIn                         = 13,
	ZoomOut                        = 14,
	ToggleAutoFollowThirdPerson    = 15,
	IncreaseExposure               = 16,
	DecreaseExposure               = 17,
	SetAutoExposure                = 18,
	IncreaseAperture               = 19,
	DecreaseAperture               = 20,
	IncreaseFocalLength            = 21,
	DecreaseFocalLength            = 22,
	IncreaseFocusDistance          = 23,
	DecreaseFocusDistance          = 24,
	SetAutoFocus                   = 25,
	ToggleDamageEffects            = 26,
	ToggleHideUI                   = 27,
	ToggleMap                      = 28,
	Reset                          = 29,
	MAX                            = 30,
};

enum class EFortTheaterType : uint8
{
	Standard                       = 0,
	Elder                          = 1,
	PvP                            = 2,
	PvP2                           = 3,
	Tutorial                       = 4,
	TutorialGate                   = 5,
	Max_None                       = 6,
	EFortTheaterType_MAX           = 7,
};

enum class EFortTheaterMapTileType : uint8
{
	Normal                         = 0,
	CriticalMission                = 1,
	AlwaysActive                   = 2,
	Outpost                        = 3,
	NonMission                     = 4,
	PvPFOB                         = 5,
	EFortTheaterMapTileType_MAX    = 6,
};

enum class EFortMapNavigationDirection : uint8
{
	North                          = 0,
	NorthEast                      = 1,
	East                           = 2,
	SouthEast                      = 3,
	South                          = 4,
	SouthWest                      = 5,
	West                           = 6,
	NorthWest                      = 7,
	Invalid                        = 8,
	EFortMapNavigationDirection_MAX = 9,
};

enum class EFortMissionQuestValidityResult : uint8
{
	Invalid                        = 0,
	InvalidNotPlayable             = 1,
	ValidLinked                    = 2,
	ValidObjectiveCondition        = 3,
	ValidFallback                  = 4,
	EFortMissionQuestValidityResult_MAX = 5,
};

enum class ECollectionSelectionMethod : uint8
{
	TierAsIndex                    = 0,
	TierAsIndexOverflowToLastValid = 1,
	Modulo                         = 2,
	Random                         = 3,
	None                           = 4,
	ECollectionSelectionMethod_MAX = 5,
};

enum class EPayoutScoringType : uint8
{
	Invalid                        = 0,
	Points                         = 1,
	Ranking                        = 2,
	Percentile                     = 3,
	Persistent                     = 4,
	EPayoutScoringType_MAX         = 5,
};

enum class EPayoutRewardType : uint8
{
	Invalid                        = 0,
	Commerce                       = 1,
	GameRelated                    = 2,
	Token                          = 3,
	EPayoutRewardType_MAX          = 4,
};

enum class EMessageFeedSubject : uint8
{
	ToyOwner                       = 0,
	OtherPlayerInteractingWithToy  = 1,
	EMessageFeedSubject_MAX        = 2,
};

enum class EMessageFeedRelationshipFilter : uint8
{
	Anyone                         = 0,
	SquadAndTeamMembers            = 1,
	SquadMembersOnly               = 2,
	SelfOnly                       = 3,
	EMessageFeedRelationshipFilter_MAX = 4,
};

enum class ETrackVerticality : uint8
{
	Floor                          = 0,
	Ramp                           = 1,
	GradualRamp                    = 2,
	Max_None                       = 3,
	ETrackVerticality_MAX          = 4,
};

enum class ETrackIncline : uint8
{
	NoNeighbor                     = 0,
	Flat                           = 1,
	Up                             = 2,
	Down                           = 3,
	GradualUp                      = 4,
	GradualDown                    = 5,
	Max_None                       = 6,
	ETrackIncline_MAX              = 7,
};

enum class ETrackPieceType : uint8
{
	None                           = 0,
	Straight                       = 1,
	Turn                           = 2,
	TShape                         = 3,
	Cross                          = 4,
	Max_None                       = 5,
	ETrackPieceType_MAX            = 6,
};

enum class ETrackDirection : uint8
{
	YNegative                      = 0,
	XPositive                      = 1,
	YPositive                      = 2,
	XNegative                      = 3,
	Max_None                       = 4,
	ETrackDirection_MAX            = 5,
};

enum class EUFortMatchmakingKnobsDataSource : uint8
{
	None                           = 0,
	Playlist                       = 1,
	Mutator                        = 2,
	GameMode                       = 3,
	Permissions                    = 4,
	UISettings                     = 5,
	Max                            = 6,
};

enum class ECreativeItemCategory : uint8
{
	Prefabs                        = 0,
	Devices                        = 1,
	Weapons                        = 2,
	Consumables                    = 3,
	Gallery                        = 4,
	ECreativeItemCategory_MAX      = 5,
};

enum class EFortPlaylistTeamSizeType : uint8
{
	Solo                           = 0,
	Duo                            = 1,
	Trio                           = 2,
	Squad                          = 3,
	LargeTeam                      = 4,
	MAX                            = 5,
};

enum class EFortGameFeatureState : uint8
{
	Unknown                        = 0,
	Unavailable                    = 1,
	Downloading                    = 2,
	DownloadFailed                 = 3,
	Available                      = 4,
	Preloading                     = 5,
	Preloaded                      = 6,
	Loading                        = 7,
	Loaded                         = 8,
	Count                          = 8,
	EFortGameFeatureState_MAX      = 9,
};

enum class EFortGameFeature : uint8
{
	EarlyStartup                   = 0,
	DedicatedServer                = 1,
	KairosInitial                  = 2,
	KairosCapture                  = 3,
	WorldAR                        = 4,
	Frontend                       = 5,
	GameplayAthena                 = 6,
	GameplayCampaign               = 7,
	Invalid                        = 8,
	Count                          = 8,
	EFortGameFeature_MAX           = 9,
};

enum class EFortStartupPhase : uint8
{
	InitializingEngine             = 0,
	EarlyStartupLoading            = 1,
	EarlyStartupFinished           = 2,
	GameStartupLoading             = 3,
	GameStartupFinished            = 4,
	Invalid                        = 5,
	Count                          = 5,
	EFortStartupPhase_MAX          = 6,
};

enum class EFortCreativeAdColorPreset : uint8
{
	Default                        = 0,
	Emphasized                     = 1,
	Common                         = 2,
	Uncommon                       = 3,
	Rare                           = 4,
	Epic                           = 5,
	Legendary                      = 6,
	EFortCreativeAdColorPreset_MAX = 7,
};

enum class EFortCreativeAdType : uint8
{
	Default                        = 0,
	Playset                        = 1,
	Toy                            = 2,
	Game                           = 3,
	Island                         = 4,
	Knob                           = 5,
	EFortCreativeAdType_MAX        = 6,
};

enum class EFortLobbyType : uint8
{
	Default                        = 0,
	Tournament                     = 1,
	Creative                       = 2,
	Division                       = 3,
	EFortLobbyType_MAX             = 4,
};

enum class EFortMatchmakingViolatorStyle : uint8
{
	None                           = 0,
	Basic                          = 1,
	HighStakes                     = 2,
	Showdown                       = 3,
	EFortMatchmakingViolatorStyle_MAX = 4,
};

enum class EFortMatchmakingTileStyle : uint8
{
	None                           = 0,
	Special                        = 1,
	HighStakes                     = 2,
	Showdown                       = 3,
	EFortMatchmakingTileStyle_MAX  = 4,
};

enum class EFortErrorSeverity : uint8
{
	Unspecified                    = 0,
	Silent                         = 1,
	Passive                        = 2,
	Blocking                       = 3,
	SevereBlocking                 = 4,
	EFortErrorSeverity_MAX         = 5,
};

enum class EFortPickerMode : uint8
{
	BuildingCategory               = 0,
	TrapCategory                   = 1,
	WeaponCategory                 = 2,
	SocialCategory                 = 3,
	Building                       = 4,
	Trap                           = 5,
	TrapRadial                     = 6,
	Weapon                         = 7,
	Social                         = 8,
	DirectPickEmote                = 9,
	DirectPickSpray                = 10,
	SquadQuickChat                 = 11,
	WeaponsSlotted                 = 12,
	EFortPickerMode_MAX            = 13,
};

enum class EPTTState : uint8
{
	Enabled                        = 0,
	MicDisabled                    = 1,
	AllSoundDisabled               = 2,
	EPTTState_MAX                  = 3,
};

enum class EFortPlayerRole : int32
{
	Player                         = 0,
	LiveSpectator                  = 1,
	ReplaySpectator                = 2,
	InactivePlayer                 = 3,
	EFortPlayerRole_MAX            = 4,
};

enum class EMobileInteractionIconTypes : uint8
{
	Interact                       = 0,
	Swap                           = 1,
	Revive                         = 2,
	Blocked                        = 3,
	MAX                            = 4,
};

enum class EAthenaPickerType : uint8
{
	EditMode                       = 0,
	Interact                       = 1,
	MAX                            = 2,
};

enum class EFortGliderType : uint8
{
	Glider                         = 0,
	Umbrella                       = 1,
	EFortGliderType_MAX            = 2,
};

enum class EItemListViewDisplayType : uint8
{
	World                          = 0,
	Outpost                        = 1,
	Account                        = 2,
	DeployableBase                 = 3,
	Max                            = 4,
};

enum class EOutpostBuildings : uint8
{
	StormShield                    = 0,
	CraftingTable                  = 1,
	Fabricator                     = 2,
	HarvestingOptimizer            = 3,
	StorageVault                   = 4,
	POST                           = 5,
	EOutpostBuildings_MAX          = 6,
};

enum class EFortClientAnnouncementQueueType : uint8
{
	Toasts                         = 0,
	Stickies                       = 1,
	Max                            = 2,
};

enum class EFortNotificationQueueType : uint8
{
	Toasts                         = 0,
	Stickies                       = 1,
	Messages                       = 2,
	Max                            = 3,
};

enum class EFortDialogResult : uint8
{
	Confirmed                      = 0,
	Declined                       = 1,
	Ignored                        = 2,
	Killed                         = 3,
	TimedOut                       = 4,
	Unknown                        = 5,
	EFortDialogResult_MAX          = 6,
};

enum class ETutorialType : uint8
{
	None                           = 0,
	Callout                        = 1,
	GuardScreen                    = 2,
	WidgetIntro                    = 3,
	Highlight                      = 4,
	ETutorialType_MAX              = 5,
};

enum class EFortBangType : uint8
{
	Invalid                        = 0,
	Custom                         = 1,
	PlayTab                        = 2,
	HeroesTab                      = 3,
	VaultTab                       = 4,
	StoreTab                       = 5,
	FriendsButton                  = 6,
	PartyInviteButton              = 7,
	SubGameAccessChanged           = 8,
	DailyRewardsButton             = 9,
	QuestsButton                   = 10,
	CompletedExpeditions           = 11,
	MainMenu                       = 12,
	HelpMenu                       = 13,
	VaultSchematics                = 14,
	VaultLeadSurvivors             = 15,
	VaultSurvivors                 = 16,
	VaultHeroes                    = 17,
	VaultDefenders                 = 18,
	VaultResources                 = 19,
	VaultMelee                     = 20,
	VaultRanged                    = 21,
	VaultConsumables               = 22,
	VaultIngredients               = 23,
	VaultTraps                     = 24,
	BattlePassTab                  = 25,
	CosmeticsTab                   = 26,
	CosmeticsOutfit                = 27,
	CosmeticGlider                 = 28,
	CosmeticContrail               = 29,
	CosmeticBattleBus              = 30,
	CosmeticVehicle                = 31,
	CosmeticItemWrap               = 32,
	CosmeticCallingCard            = 33,
	CosmeticMapMarker              = 34,
	CosmeticMusicPack              = 35,
	CosmeticPetSkin                = 36,
	CosmeticLoadingScreen          = 37,
	CosmeticBackpack               = 38,
	CosmeticHat                    = 39,
	CosmeticPickaxe                = 40,
	CosmeticDance                  = 41,
	AthenaDirectedAcquisitionTab   = 42,
	PlayerBanners                  = 43,
	STWCommand                     = 44,
	STWCommand_Heroes              = 45,
	STWCommand_Heroes_Manage       = 46,
	STWCommand_Heroes_HeroLoadout  = 47,
	STWCommand_Heroes_Defenders    = 48,
	STWCommand_Heroes_Expeditions  = 49,
	STWCommand_Survivors           = 50,
	STWCommand_Survivors_Manage    = 51,
	STWCommand_Survivors_Squads    = 52,
	STWCommand_Upgrades            = 53,
	STWCommand_Research            = 54,
	STWCommand_AccountXP           = 55,
	STWArmory                      = 56,
	STWArmory_Schematics           = 57,
	STWArmory_Backpack             = 58,
	STWArmory_Storage              = 59,
	STWArmory_CollectionBook       = 60,
	STWArmory_Transform            = 61,
	STWArmory_Resources            = 62,
	EFortBangType_MAX              = 63,
};

enum class EFortEventNameType : uint8
{
	Mission                        = 0,
	Client                         = 1,
	EFortEventNameType_MAX         = 2,
};

enum class EFortCraftFailCause : uint8
{
	Unknown                        = 0,
	NotEnoughResources             = 1,
	InventoryFull                  = 2,
	InsufficientTeamLevel          = 3,
	CraftingQueueFull              = 4,
	CurrentlyLocked                = 5,
	OverflowSchematic              = 6,
	EFortCraftFailCause_MAX        = 7,
};

enum class EKeepContainerType : uint8
{
	Base                           = 0,
	Storeroom                      = 1,
	FirstAid                       = 2,
	Armory                         = 3,
	Workshop                       = 4,
	AmmoStash                      = 5,
	Max                            = 6,
};

enum class EFortIndicatorState : uint8
{
	Hidden                         = 0,
	OnlyFriendsVisible             = 1,
	Visible                        = 2,
	EFortIndicatorState_MAX        = 3,
};

enum class EReadyCheckState : uint8
{
	CheckStarted                   = 0,
	Ready                          = 1,
	NotReady                       = 2,
	EReadyCheckState_MAX           = 3,
};

enum class EFortTeamAffiliation : uint8
{
	Friendly                       = 0,
	Neutral                        = 1,
	Hostile                        = 2,
	EFortTeamAffiliation_MAX       = 3,
};

enum class EFortAIUtility : uint8
{
	KillPlayersMelee               = 0,
	KillPlayersRanged              = 1,
	KillPlayersArtillery           = 2,
	DestroyBuildingsMelee          = 3,
	DestroyBuildingsRanged         = 4,
	DestroyBuildingsArtillery      = 5,
	DestroyTraps                   = 6,
	Tank                           = 7,
	Infiltrate                     = 8,
	Mob                            = 9,
	Support                        = 10,
	Kiting                         = 11,
	AreaOfDenial                   = 12,
	DisableTraps                   = 13,
	Dormant                        = 14,
	Assassin                       = 15,
	MAX                            = 16,
};

enum class EFortTileEdgeType : uint8
{
	Undefined                      = 0,
	Outer_1                        = 1,
	Transition_2                   = 2,
	Inner_3                        = 3,
	Border_4                       = 4,
	BorderTransitionSingle_5       = 5,
	BorderTransitionDouble_6       = 6,
	MAX                            = 7,
};

enum class EFortMovementUrgency : uint8
{
	None                           = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	NumLevels                      = 4,
	EFortMovementUrgency_MAX       = 5,
};

enum class EFortMovementStyle : uint8
{
	Running                        = 0,
	Walking                        = 1,
	Charging                       = 2,
	Sprinting                      = 3,
	PersonalVehicle                = 4,
	Flying                         = 5,
	EFortMovementStyle_MAX         = 6,
};

enum class EFortWeaponReloadType : uint8
{
	ReloadWholeClip                = 0,
	ReloadIndividualBullets        = 1,
	ReloadBasedOnAmmoCostPerFire   = 2,
	ReloadBasedOnCartridgePerFire  = 3,
	EFortWeaponReloadType_MAX      = 4,
};

enum class EFortWeaponTriggerType : uint8
{
	OnPress                        = 0,
	Automatic                      = 1,
	OnRelease                      = 2,
	OnPressAndRelease              = 3,
	EFortWeaponTriggerType_MAX     = 4,
};

enum class EFortDayPhasePrio : uint8
{
	Default                        = 0,
	DailySummary                   = 1,
	EFortDayPhasePrio_MAX          = 2,
};

enum class EFortCustomBodyType : uint8
{
	Small                          = 1,
	Medium                         = 2,
	MediumAndSmall                 = 3,
	Large                          = 4,
	LargeAndSmall                  = 5,
	LargeAndMedium                 = 6,
	All                            = 7,
	Deprecated                     = 8,
	EFortCustomBodyType_MAX        = 9,
};

enum class EFortDisplayGender : uint8
{
	Unknown                        = 0,
	Male                           = 1,
	Female                         = 2,
	NumTypes                       = 3,
	EFortDisplayGender_MAX         = 4,
};

enum class EFortCustomGender : uint8
{
	Invalid                        = 0,
	Male                           = 1,
	Female                         = 2,
	Both                           = 3,
	EFortCustomGender_MAX          = 4,
};

enum class EFortRarity : uint8
{
	Handmade                       = 0,
	Ordinary                       = 1,
	Sturdy                         = 2,
	Quality                        = 3,
	Fine                           = 4,
	Elegant                        = 5,
	Masterwork                     = 6,
	Epic                           = 7,
	Badass                         = 8,
	Legendary                      = 9,
	NumRarityValues                = 10,
	EFortRarity_MAX                = 11,
};

enum class EFortTargetSelectionFilter : uint8
{
	Damageable                     = 0,
	Everything                     = 1,
	Pawns                          = 2,
	Buildings                      = 3,
	Walls                          = 4,
	Traps                          = 5,
	Players                        = 6,
	AIPawns                        = 7,
	Instigator                     = 8,
	WeakSpots                      = 9,
	World                          = 10,
	Max                            = 11,
};

enum class EFortWeaponType : uint8
{
	None                           = 0,
	RangedAny                      = 1,
	Pistol                         = 2,
	Shotgun                        = 3,
	Rifle                          = 4,
	SMG                            = 5,
	Sniper                         = 6,
	GrenadeLauncher                = 7,
	RocketLauncher                 = 8,
	Bow                            = 9,
	Minigun                        = 10,
	LMG                            = 11,
	BiplaneGun                     = 12,
	MeleeAny                       = 13,
	Harvesting                     = 14,
	MAX                            = 15,
};

enum class EFortTargetSelectionTestType : uint8
{
	Overlap                        = 0,
	Swept                          = 1,
	Ballistic                      = 2,
	EFortTargetSelectionTestType_MAX = 3,
};

enum class EFortTargetSelectionShape : uint8
{
	Sphere                         = 0,
	Cone                           = 1,
	Box                            = 2,
	Capsule                        = 3,
	Line                           = 4,
	Cylinder                       = 5,
	Custom                         = 6,
	CustomOnSource                 = 7,
	EFortTargetSelectionShape_MAX  = 8,
};

enum class EFortBrushSize : uint8
{
	VeryVerySmall                  = 0,
	VerySmall                      = 1,
	Small                          = 2,
	Medium                         = 3,
	Large                          = 4,
	VeryLarge                      = 5,
	EFortBrushSize_MAX             = 6,
};

enum class ESpecialActorStatType : uint8
{
	NumEliminationsNearby          = 0,
	TimeInWorld                    = 1,
	PickupNumSpawns                = 2,
	PickupNumDespawns              = 3,
	PickupNumDropped               = 4,
	PickupNumTaken                 = 5,
	PlayerWon                      = 6,
	PlayerNumEliminations          = 7,
	PlayerNum                      = 8,
	TotalStats                     = 9,
	ESpecialActorStatType_MAX      = 10,
};

enum class EFortItemViewRotationMode : uint8
{
	None                           = 0,
	BoundsPivot                    = 1,
	World                          = 2,
	Relative                       = 3,
	EFortItemViewRotationMode_MAX  = 4,
};

enum class EFortInventoryCustomFilter : uint8
{
	Mythic                         = 0,
	Legendary                      = 1,
	Epic                           = 2,
	Rare                           = 3,
	Uncommon                       = 4,
	Common                         = 5,
	EFortInventoryCustomFilter_MAX = 6,
};

enum class EInventoryContentSortType : uint8
{
	ByName                         = 0,
	ByRating                       = 1,
	ByLevel                        = 2,
	ByCategory                     = 3,
	ByRarity                       = 4,
	ByLocation                     = 5,
	ByPersonality                  = 6,
	ByBonus                        = 7,
	BySubtype                      = 8,
	EInventoryContentSortType_MAX  = 9,
};

enum class EFortFrontendInventoryFilter : uint8
{
	Schematics                     = 0,
	WorldItems                     = 1,
	WorldItemsInGame               = 2,
	WorldItemsStorage              = 3,
	WorldItemsTransfer             = 4,
	ConsumablesAndAccountResources = 5,
	Heroes                         = 6,
	Defenders                      = 7,
	Survivors                      = 8,
	AthenaCharacter                = 9,
	AthenaBackpack                 = 10,
	AthenaPickaxe                  = 11,
	AthenaGliders                  = 12,
	AthenaContrails                = 13,
	AthenaEmotes                   = 14,
	AthenaItemWraps                = 15,
	AthenaLoadingScreens           = 16,
	AthenaLobbyMusic               = 17,
	Invisible                      = 18,
	Max_None                       = 19,
	EFortFrontendInventoryFilter_MAX = 20,
};

enum class EFortInventoryFilter : uint8
{
	WeaponMelee                    = 0,
	WeaponRanged                   = 1,
	Ammo                           = 2,
	Traps                          = 3,
	Consumables                    = 4,
	Ingredients                    = 5,
	Gadget                         = 6,
	Decorations                    = 7,
	Badges                         = 8,
	Heroes                         = 9,
	LeadSurvivors                  = 10,
	Survivors                      = 11,
	Defenders                      = 12,
	Resources                      = 13,
	ConversionControl              = 14,
	AthenaCosmetics                = 15,
	Playset                        = 16,
	CreativePlot                   = 17,
	TeamPerk                       = 18,
	Workers                        = 19,
	Invisible                      = 20,
	Max_None                       = 21,
	EFortInventoryFilter_MAX       = 22,
};

enum class EFortItemCategoryOrdinal : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	EFortItemCategoryOrdinal_MAX   = 3,
};

enum class ESubGameMatchmakingStatus : uint8
{
	Disabled                       = 0,
	Enabled                        = 1,
	ESubGameMatchmakingStatus_MAX  = 2,
};

enum class ESubGameAccessStatus : uint8
{
	Disabled                       = 0,
	LimitedAccess                  = 1,
	OpenAccess                     = 2,
	ESubGameAccessStatus_MAX       = 3,
};

enum class EFortUIFriendNotificationType : uint8
{
	Default                        = 0,
	FriendRequest                  = 1,
	PartyInvite                    = 2,
	AutoImportFriendSuggestion     = 3,
	EFortUIFriendNotificationType_MAX = 4,
};

enum class EFortNotificationPriority : uint8
{
	Vote                           = 0,
	Friend                         = 1,
	BoostedXP                      = 2,
	TwitchHigh                     = 3,
	GeneralSendNotification        = 4,
	TwitchLow                      = 10,
	Max                            = 11,
};

enum class EFortNotificationType : uint8
{
	Default                        = 0,
	Power                          = 1,
	HealthWarning                  = 2,
	Error                          = 3,
	GiftSent                       = 4,
	Max                            = 5,
};

enum class EFortContextualReticleTypes : uint8
{
	FCR_GenericFailure             = 0,
	FCR_Upgrade                    = 1,
	FCR_Repair                     = 2,
	FCR_Locked                     = 3,
	FCR_Placement                  = 4,
	FCR_Edit                       = 5,
	FCR_NoTarget                   = 6,
	FCR_InProgress                 = 7,
	FCR_None                       = 8,
	FCR_MAX                        = 9,
};

enum class EFortUserCloudRequestResult : uint8
{
	Success                        = 0,
	Failure_CloudStorageDisabled   = 1,
	Failure_CloudStorageError      = 2,
	Failure_FileNotFoundInUserFileList = 3,
	Failure_SavingNotAllowedForSpecifiedUser = 4,
	EFortUserCloudRequestResult_MAX = 5,
};

enum class EFortUserCloudRequestType : uint8
{
	LoadCloudFile                  = 0,
	SaveCloudFile                  = 1,
	EFortUserCloudRequestType_MAX  = 2,
};

enum class EVehicleAudioTriggerDir : uint8
{
	Forward                        = 0,
	Backward                       = 1,
	EVehicleAudioTriggerDir_MAX    = 2,
};

enum class EVehicleAudioInterpolationType : uint8
{
	None                           = 0,
	CustomCurve                    = 1,
	Linear                         = 2,
	EVehicleAudioInterpolationType_MAX = 3,
};

enum class EFortVisibilityBehavior : uint8
{
	Proximity                      = 0,
	OnceSeenAlwaysSeen             = 1,
	AlwaysSeen                     = 2,
	Invalid                        = 3,
	EFortVisibilityBehavior_MAX    = 4,
};

enum class EVolumeValidityResult : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	EVolumeValidityResult_MAX      = 2,
};

enum class EFortReloadMontageSection : uint8
{
	Intro                          = 0,
	Loop                           = 1,
	Outro                          = 2,
	EFortReloadMontageSection_MAX  = 3,
};

enum class EFortDisplayTier : uint8
{
	Invalid                        = 0,
	Handmade                       = 1,
	Copper                         = 2,
	Silver                         = 3,
	Malachite                      = 4,
	Obsidian                       = 5,
	Brightcore                     = 6,
	Spectrolite                    = 7,
	Shadowshard                    = 8,
	Sunbeam                        = 9,
	Moonglow                       = 10,
	EFortDisplayTier_MAX           = 11,
};

enum class EFortWeaponOverheatState : uint8
{
	None                           = 0,
	Heating                        = 1,
	Cooling                        = 2,
	Overheated                     = 3,
	EFortWeaponOverheatState_MAX   = 4,
};

enum class EWorldItemDropBehavior : uint8
{
	DropAsPickup                   = 0,
	DestroyOnDrop                  = 1,
	DropAsPickupDestroyOnEmpty     = 2,
	EWorldItemDropBehavior_MAX     = 3,
};

enum class EFortWorldManagerState : uint8
{
	WMS_Created                    = 0,
	WMS_QueryingWorld              = 1,
	WMS_WorldQueryComplete         = 2,
	WMS_CreatingNewWorld           = 3,
	WMS_LoadingExistingWorld       = 4,
	WMS_Running                    = 5,
	WMS_Failed                     = 6,
	WMS_MAX                        = 7,
};

enum class EFortLevelStreamingState : uint8
{
	LSS_Unloaded                   = 0,
	LSS_Loaded                     = 1,
	LSS_UnconditionalFoundationsUpdated = 2,
	LSS_AllFoundationsUpdated      = 3,
	LSS_NewActorsCreatedButNotUpdated = 4,
	LSS_AllUpdated                 = 5,
	LSS_Ready                      = 6,
	LSS_MAX                        = 7,
};

enum class EFortQueuedActionUserStatus : uint8
{
	Succeeded                      = 0,
	Failed                         = 1,
	WaitingForCloudRequest         = 2,
	WaitingForProfileSave          = 3,
	EFortQueuedActionUserStatus_MAX = 4,
};

enum class EFortWorldRecordState : uint8
{
	StartProcessing                = 0,
	WaitingForResponse             = 1,
	RetrievingTheaterInformation   = 2,
	RetrievingZoneInformation      = 3,
	LoadingWorldRecord             = 4,
	LoadingZoneRecord              = 5,
	SavingZoneRecord               = 6,
	SavingPlayerProfiles           = 7,
	SavingPlayerDeployableBases    = 8,
	Succeeded                      = 9,
	Failed                         = 10,
	Max_None                       = 11,
	EFortWorldRecordState_MAX      = 12,
};

enum class EFortWorldRecordAction : uint8
{
	LoadWorldOnly                  = 0,
	SaveWorldOnly                  = 1,
	SaveZoneAndWorld               = 2,
	LoadZoneAndWorld               = 3,
	SaveDeployableBasesAndWorld    = 4,
	Max_None                       = 5,
	EFortWorldRecordAction_MAX     = 6,
};

enum class EFortWorldMarkerType : uint8
{
	None                           = 0,
	Location                       = 1,
	Enemy                          = 2,
	Item                           = 3,
	SpecialLocal                   = 4,
	MAX                            = 5,
};

enum class EDeployableBaseUseType : uint8
{
	Neighborhood                   = 0,
	PvECombat                      = 1,
	EDeployableBaseUseType_MAX     = 2,
};

enum class EFortZoneType : uint8
{
	PVE                            = 0,
	PVP                            = 1,
	Keep                           = 2,
	SingleZone                     = 3,
	Max_None                       = 4,
	EFortZoneType_MAX              = 5,
};

enum class EFrontEndCamera : uint8
{
	Invalid                        = 0,
	Command                        = 1,
	Command_HeroLoadout            = 2,
	LegacyHeroLoadout              = 3,
	Cosmetics                      = 4,
	Expeditions                    = 5,
	FrontendDefault                = 6,
	Heroes                         = 7,
	HeroSelect                     = 8,
	HeroLoadout                    = 9,
	Home                           = 10,
	HomeBase                       = 11,
	Login                          = 12,
	Manage1                        = 13,
	Manage2                        = 14,
	Manage3                        = 15,
	Manage4                        = 16,
	MissionControl                 = 17,
	Party                          = 18,
	Play                           = 19,
	Research                       = 20,
	SkillTrees                     = 21,
	SmallCosmetics                 = 22,
	SpecialEvent                   = 23,
	SpecialEvent2                  = 24,
	Store                          = 25,
	StoreItemInspect               = 26,
	StwFrontendDefault             = 27,
	SurvivorSquadBuilding1         = 28,
	SurvivorSquadBuilding2         = 29,
	SurvivorSquadBuilding3         = 30,
	SurvivorSquadBuilding4         = 31,
	TutorialPhaseOne               = 32,
	TutorialPhaseTwo               = 33,
	TutorialPhaseThree             = 34,
	Upgrades                       = 35,
	Vault                          = 36,
	WorldMap                       = 37,
	LobbyCentered                  = 38,
	EFrontEndCamera_MAX            = 39,
};

enum class EDroneFacingLocationMode : uint8
{
	NotFacingLocation              = 0,
	FindingPoint                   = 1,
	TrackingPoint                  = 2,
	EDroneFacingLocationMode_MAX   = 3,
};

enum class EFireModeType : uint8
{
	Unset                          = 0,
	TapToShoot                     = 1,
	FireButton                     = 2,
	AutoFire                       = 3,
	ForceTouch                     = 4,
	Custom                         = 5,
	MAX                            = 6,
};

enum class ELayoutPropertyType : uint8
{
	PropertyType_Float             = 0,
	PropertyType_Integer           = 1,
	PropertyType_Bool              = 2,
	PropertyType_Rotator           = 3,
	PropertyType_MAX               = 4,
};

enum class ELayoutDataType : uint8
{
	Custom                         = 0,
	DefaultToolLayout              = 1,
	DefaultGameLayout              = 2,
	MAX_Local                      = 3,
	CustomCloudLayout              = 4,
	ELayoutDataType_MAX            = 5,
};

enum class ELevelSaveCategory : uint8
{
	ActorInstance                  = 0,
	VolumeInfoActor                = 1,
	ELevelSaveCategory_MAX         = 2,
};

enum class EFortMarkedActorScreenClamping : uint8
{
	Default                        = 0,
	Clamp                          = 1,
	ClampWhileNew                  = 2,
	DontClamp                      = 3,
	EFortMarkedActorScreenClamping_MAX = 4,
};

enum class EFortEncounterSpawnLimitType : uint8
{
	NoLimit                        = 0,
	NumPawnsLimit                  = 1,
	SpawnPointLimit                = 2,
	UserDefined                    = 3,
	MAX                            = 4,
};

enum class EFortEncounterUtilitiesMode : uint8
{
	LockedOnly                     = 0,
	LockedAndFree                  = 1,
	EFortEncounterUtilitiesMode_MAX = 2,
};

enum class EFortEncounterSpawnLocationManagementMode : uint8
{
	Spawn                          = 0,
	Search                         = 1,
	EFortEncounterSpawnLocationManagementMode_MAX = 2,
};

enum class EFortEncounterSpawnLocationPlacementMode : uint8
{
	Directional                    = 0,
	Ring                           = 1,
	Volume                         = 2,
	Custom                         = 3,
	Max_None                       = 4,
	EFortEncounterSpawnLocationPlacementMode_MAX = 5,
};

enum class EFortEncounterPacingMode : uint8
{
	SpawnPointsPercentageCurve     = 0,
	IntensityCurve                 = 1,
	Burst                          = 2,
	Fixed                          = 3,
	EFortEncounterPacingMode_MAX   = 4,
};

enum class EFortMissionAudibility : uint8
{
	UseVisibility                  = 0,
	Audible                        = 1,
	Inaudible                      = 2,
	EFortMissionAudibility_MAX     = 3,
};

enum class EFortMissionType : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Max_None                       = 2,
	EFortMissionType_MAX           = 3,
};

enum class EFortObjectiveRequirement : uint8
{
	Optional                       = 0,
	Required                       = 1,
	RequiredButCanFail             = 2,
	EFortObjectiveRequirement_MAX  = 3,
};

enum class EFortMissionStatus : uint8
{
	Created                        = 0,
	InProgress                     = 1,
	Succeeded                      = 2,
	Failed                         = 3,
	NeutralCompletion              = 4,
	Quit                           = 5,
	Max_None                       = 6,
	EFortMissionStatus_MAX         = 7,
};

enum class EMissionGenerationCategory : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	Survivor                       = 3,
	Max_None                       = 4,
	EMissionGenerationCategory_MAX = 5,
};

enum class EIndexNavigationResult : uint8
{
	Succeeded                      = 0,
	Modified                       = 1,
	Clamped                        = 2,
	StepOff                        = 3,
	NoMove                         = 4,
	EIndexNavigationResult_MAX     = 5,
};

enum class EStatRecordingPeriod : uint8
{
	Minute                         = 0,
	AthenaSafeZonePhase            = 1,
	Life                           = 2,
	Map                            = 3,
	Campaign                       = 4,
	Persistent                     = 5,
	Max                            = 6,
};

enum class EFortStrategicBuildingLevelCriteriaDisplayRepresentation : uint8
{
	Integer                        = 0,
	Float                          = 1,
	EFortStrategicBuildingLevelCriteriaDisplayRepresentation_MAX = 2,
};

enum class EFortStrategicBuildingCategory : uint8
{
	Defensive                      = 0,
	Offensive                      = 1,
	Utility                        = 2,
	EFortStrategicBuildingCategory_MAX = 3,
};

enum class EFortThreatDeactivationType : uint8
{
	Off                            = 0,
	Dormant                        = 1,
	EFortThreatDeactivationType_MAX = 2,
};

enum class EWrapPreviewGridLockerMode : uint8
{
	IgnoreLockerConfiguration      = 0,
	SupportedWeaponsOnly           = 1,
	UnsupportedWeaponsOnly         = 2,
	EWrapPreviewGridLockerMode_MAX = 3,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.ProjectileEventData
struct FProjectileEventData
{
public:
	class AFortProjectileBase*                   SpawnedProjectile;                                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHitResult>                    Hits;                                              // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        ExplodedActors;                                    // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct FortniteGame.AsyncTaskResult
struct FAsyncTaskResult
{
public:
	bool                                         bSucceeded;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2262[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ErrorCode;                                         // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  ErrorMessage;                                      // 0x18(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FortAIDirectorEvent
struct FFortAIDirectorEvent
{
public:
	enum class EFortAIDirectorEvent              Event;                                             // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2263[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               EventSource;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               EventTarget;                                       // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EventValue;                                        // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2264[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.PurchasedItemInfo
struct FPurchasedItemInfo
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quantity;                                          // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2265[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x24 (0x24 - 0x0)
// ScriptStruct FortniteGame.AthenaLevelInfo
struct FAthenaLevelInfo
{
public:
	int32                                        AccountLevel;                                      // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLevel;                                          // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LevelXp;                                           // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LevelXpForLevel;                                   // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookLevel;                                         // 0x14(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookMaxLevel;                                      // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookLevelXp;                                       // 0x1C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookLevelXpForLevel;                               // 0x20(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x34 (0x34 - 0x0)
// ScriptStruct FortniteGame.FortPublicAccountInfo
struct FFortPublicAccountInfo
{
public:
	int32                                        Level;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLevel;                                          // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LevelXp;                                           // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LevelXpForLevel;                                   // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaLevelInfo                      BattleRoyaleLevel;                                 // 0x10(0x24)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x38 - 0x34)
// ScriptStruct FortniteGame.FortPrivateAccountInfo
struct FFortPrivateAccountInfo : public FFortPublicAccountInfo
{
public:
	int32                                        MtxBalance;                                        // 0x34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortItemInstanceQuantityPair
struct FFortItemInstanceQuantityPair
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortInventoryType                InventoryType;                                     // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2266[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Quantity;                                          // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// ScriptStruct FortniteGame.McpPrivacySettings
struct FMcpPrivacySettings
{
public:
	bool                                         OptOutOfPublicLeaderboards;                        // 0x0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         OptOutOfFriendsLeaderboards;                       // 0x1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct FortniteGame.McpBanInfo
struct FMcpBanInfo
{
public:
	bool                                         bRequiresUserAck;                                  // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2267[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EPlayerBanReasons>         BanReasons;                                        // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bBanHasStarted;                                    // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2268[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             BanStartTimeUtc;                                   // 0x20(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BanDurationDays;                                   // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2269[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ExploitProgramName;                                // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                AdditionalInfo;                                    // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPlayerCompetitiveBanReasons      CompetitiveBanReason;                              // 0x50(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct FortniteGame.FortCampaignLoadout
struct FFortCampaignLoadout
{
public:
	class UFortPersonalVehicleItem*              PersonalVehicle;                                   // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FriendCode
struct FFriendCode
{
public:
	class FString                                Code;                                              // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CodeType;                                          // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct FortniteGame.FortHomeBaseInfo
struct FFortHomeBaseInfo
{
public:
	class FString                                BannerIconId;                                      // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BannerColorId;                                     // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x20(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         ValidData;                                         // 0x38(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.CosmeticVariantInfo
struct FCosmeticVariantInfo
{
public:
	struct FGameplayTag                          VariantChannelTag;                                 // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ActiveVariantTag;                                  // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x38 - 0x10)
// ScriptStruct FortniteGame.McpVariantChannelInfo
struct FMcpVariantChannelInfo : public FCosmeticVariantInfo
{
public:
	struct FGameplayTagContainer                 OwnedVariantTags;                                  // 0x10(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemVariantIsUsedFor;                              // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// ScriptStruct FortniteGame.FortAthenaLoadout
struct FFortAthenaLoadout
{
public:
	class FString                                BannerIconId;                                      // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BannerColorId;                                     // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaSkyDiveContrailItemDefinition*  SkyDiveContrail;                                   // 0x20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaGliderItemDefinition*           Glider;                                            // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaPickaxeItemDefinition*          Pickaxe;                                           // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDefaultCharacter;                               // 0x38(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCharacterItemDefinition*        Character;                                         // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMcpVariantChannelInfo>        CharacterVariantChannels;                          // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bForceUpdateVariants;                              // 0x58(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaHatItemDefinition*              Hat;                                               // 0x60(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaBackpackItemDefinition*         Backpack;                                          // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaLoadingScreenItemDefinition*    LoadingScreen;                                     // 0x70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaBattleBusItemDefinition*        BattleBus;                                         // 0x78(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaVehicleCosmeticItemDefinition*  VehicleDecoration;                                 // 0x80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaCallingCardItemDefinition*      CallingCard;                                       // 0x88(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaMapMarkerItemDefinition*        MapMarker;                                         // 0x90(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAthenaDanceItemDefinition*>    Dances;                                            // 0x98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAthenaVictoryPoseItemDefinition*      VictoryPose;                                       // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaMusicPackItemDefinition*        MusicPack;                                         // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaItemWrapDefinition*             ItemWrapOverride;                                  // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAthenaItemWrapDefinition*>     ItemWraps;                                         // 0xC0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAthenaPetItemDefinition*              PetSkin;                                           // 0xD0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FriendCodeLocString
struct FFriendCodeLocString
{
public:
	class FString                                Lang;                                              // 0x0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Text;                                              // 0x10(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x200 (0x200 - 0x0)
// ScriptStruct FortniteGame.FortTeamMemberInfo
struct FFortTeamMemberInfo
{
public:
	struct FUniqueNetIdRepl                      MemberUniqueId;                                    // 0x0(0x28)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      PartyLeaderUniqueId;                               // 0x28(0x28)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      ConsoleUniqueId;                                   // 0x50(0x28)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Platform;                                          // 0x78(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  PlayerName;                                        // 0x88(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bPartyLeader;                                      // 0xA0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInZone;                                         // 0xA1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasBoostXp;                                       // 0xA2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasRestXp;                                        // 0xA3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BannerIconId;                                      // 0xA8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BannerColorId;                                     // 0xB8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBattlePassPurchased;                              // 0xC8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_226F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BattlePassLevel;                                   // 0xCC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BattlePassSelfXpBoost;                             // 0xD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BattlePassFriendXpBoost;                           // 0xD4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumPlayersInParty;                                 // 0xD8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlayerIndex;                                       // 0xDC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        TeamAffiliation;                                   // 0xE0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2270[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  HeroClass;                                         // 0xE8(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  HeroLevel;                                         // 0x100(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                        HeroXP;                                            // 0x118(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2271[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             HeroItem;                                          // 0x120(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortItem*>                     SelectedGadgetItems;                               // 0x128(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                           HeroIcon;                                          // 0x138(0x88)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FFortHomeBaseInfo                     HomeBaseInfo;                                      // 0x1C0(0x40)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct FortniteGame.AthenaTravelLogEntry
struct FAthenaTravelLogEntry
{
public:
	float                                        Time;                                              // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Position;                                          // 0x4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x10(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	enum class EAthenaTravelEventType            Type;                                              // 0x1C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2272[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  InstigatorName;                                    // 0x20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaTravelLogPlayerType        InstigatorPlayerType;                              // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2273[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ReceiverName;                                      // 0x2C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAthenaTravelLogPlayerType        ReceiverPlayerType;                                // 0x34(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2274[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value;                                             // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2275[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FJsonObjectWrapper                    Meta;                                              // 0x40(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 LocationPOITags;                                   // 0x60(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.AthenaMatchLootReward
struct FAthenaMatchLootReward
{
public:
	class FString                                TemplateId;                                        // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2276[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.AthenaMatchXpReward
struct FAthenaMatchXpReward
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x18(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2277[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.AthenaTravelRecord
struct FAthenaTravelRecord
{
public:
	TArray<struct FAthenaTravelLogEntry>         Log;                                               // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct FortniteGame.AthenaMatchXpMultiplierGroup
struct FAthenaMatchXpMultiplierGroup
{
public:
	enum class EAthenaMatchXpMultiplierSource    Source;                                            // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2278[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Amount;                                            // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.AthenaAwardGroup
struct FAthenaAwardGroup
{
public:
	enum class ERewardSource                     RewardSource;                                      // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2279[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMcpLootEntry>                 Items;                                             // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        Score;                                             // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SeasonXp;                                          // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookXp;                                            // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct FortniteGame.AthenaRewardResult
struct FAthenaRewardResult
{
public:
	int32                                        LevelsGained;                                      // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BookLevelsGained;                                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalSeasonXpGained;                               // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalBookXpGained;                                 // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PrePenaltySeasonXpGained;                          // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAthenaMatchXpMultiplierGroup> XpMultipliers;                                     // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAthenaAwardGroup>             Rewards;                                           // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        AntiAddictionMultiplier;                           // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct FortniteGame.AthenaMatchTeamStats
struct FAthenaMatchTeamStats
{
public:
	int32                                        Place;                                             // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalPlayers;                                      // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct FortniteGame.AthenaWeaponStats
struct FAthenaWeaponStats
{
public:
	class FString                                WeaponId;                                          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Stats[0xD];                                        // 0x10(0x34)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_227D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct FortniteGame.AthenaMatchStats
struct FAthenaMatchStats
{
public:
	class FString                                StatBucket;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                MatchID;                                           // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                MatchEndTime;                                      // 0x20(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                MatchPlatform;                                     // 0x30(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Stats[0x14];                                       // 0x40(0x50)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAthenaWeaponStats>            WeaponStats;                                       // 0x90(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.FortQuestObjectiveCompletion
struct FFortQuestObjectiveCompletion
{
public:
	class FString                                StatName;                                          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227E[0x14];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortSubgameClientSettings
struct FFortSubgameClientSettings
{
public:
	TArray<class FString>                        PinnedQuestInstances;                              // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.AccountIdAndScore
struct FAccountIdAndScore
{
public:
	class FString                                AccountId;                                         // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalScore;                                        // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCriticalMatchBonus;                               // 0x14(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227F[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.FortQuestEarnedBadgeData
struct FFortQuestEarnedBadgeData
{
public:
	class FString                                TemplateId;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2280[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FortPlacedBuilding
struct FFortPlacedBuilding
{
public:
	class FString                                BuildingTag;                                       // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlacedTag;                                         // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FortOutpostCoreInfo
struct FFortOutpostCoreInfo
{
public:
	TArray<struct FFortPlacedBuilding>           PlacedBuildings;                                   // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                        AccountsWithEditPermission;                        // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.FortCloudSaveRecordInfo
struct FFortCloudSaveRecordInfo
{
public:
	int32                                        RecordIndex;                                       // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ArchiveNumber;                                     // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RecordFilename;                                    // 0x8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.FortCloudSaveInfo
struct FFortCloudSaveInfo
{
public:
	int32                                        SaveCount;                                         // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2281[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortCloudSaveRecordInfo>      SavedRecords;                                      // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// ScriptStruct FortniteGame.AccountIdAndMatchEndData
struct FAccountIdAndMatchEndData
{
public:
	class FString                                AccountId;                                         // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortQuestObjectiveCompletion> Advance;                                           // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortQuestEarnedBadgeData>     EarnedBadgeData;                                   // 0x20(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                        EarnedItemCaches;                                  // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        TotalScore;                                        // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCriticalMatchBonus;                               // 0x44(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2282[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumMissionPoints;                                  // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TheaterNum;                                        // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMcpProfileChangeRequest              TheaterItemUpdate;                                 // 0x50(0x58)(NativeAccessSpecifierPublic)
	int32                                        OutpostNum;                                        // 0xA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2283[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FMcpProfileChangeRequest              OutpostItemUpdate;                                 // 0xB0(0x58)(NativeAccessSpecifierPublic)
	class FString                                OutpostId;                                         // 0x108(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortOutpostCoreInfo                  OutpostInfo;                                       // 0x118(0x20)(NativeAccessSpecifierPublic)
	class FString                                DeployableBaseItemId;                              // 0x138(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortCloudSaveInfo                    CloudSaveInfo;                                     // 0x148(0x18)(NativeAccessSpecifierPublic)
	class FString                                LockCode;                                          // 0x160(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAbandoning;                                       // 0x170(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2284[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct FortniteGame.EndZoneScoreAndAwards
struct FEndZoneScoreAndAwards
{
public:
	bool                                         bResultsPendingSave;                               // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2285[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TotalScore;                                        // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCriticalMatchBonus;                               // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2286[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortQuestEarnedBadgeData>     EarnedBadgeData;                                   // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                        EarnedItemCaches;                                  // 0x20(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NumMissionPoints;                                  // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2287[0x3C];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.FortPersistentGameplayStatValue
struct FFortPersistentGameplayStatValue
{
public:
	class FString                                StatName;                                          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StatValue;                                         // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2288[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct FortniteGame.VolumePerformanceMetrics
struct FVolumePerformanceMetrics
{
public:
	int32                                        PerformanceValue;                                  // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PerformanceMaxValue;                               // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreviewDeltaValue;                                 // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortEventName
struct FFortEventName
{
public:
	class FName                                  CategoryName;                                      // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  EventName;                                         // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct FortniteGame.FortClientEventName
struct FFortClientEventName : public FFortEventName
{
public:
};

// 0x38 (0x38 - 0x0)
// ScriptStruct FortniteGame.Voter
struct FVoter
{
public:
	int32                                        VoteDecision;                                      // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastVoteDecision;                                  // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      NetId;                                             // 0x8(0x28)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumVotesCast;                                      // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2289[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct FortniteGame.ChoiceDataEntry
struct FChoiceDataEntry
{
public:
	class FText                                  ButtonText;                                        // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ButtonDescription;                                 // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ConfirmText;                                       // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bEnabled;                                          // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireConfirmation;                              // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCloseAfterSelection;                              // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_228A[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct FortniteGame.ChoiceData
struct FChoiceData
{
public:
	int32                                        MenuIdentifier;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowCloseButton;                                  // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_228B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Title;                                             // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FChoiceDataEntry>              Items;                                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.AttributeModifierInfo
struct FAttributeModifierInfo
{
public:
	uint8                                        Pad_228C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameplayEffect*                       InstantGEs;                                        // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_228D[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct FortniteGame.BuildingWeakSpotData
struct FBuildingWeakSpotData
{
public:
	TWeakObjectPtr<class ABuildingSMActor>       ParentBuilding;                                    // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal             Normal;                                            // 0x8(0xC)(NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize10                 Position;                                          // 0x14(0xC)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_228E[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// ScriptStruct FortniteGame.FortRequirementsInfo
struct FFortRequirementsInfo
{
public:
	int32                                        CommanderLevel;                                    // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PersonalPowerRating;                               // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxPersonalPowerRating;                            // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PartyPowerRating;                                  // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxPartyPowerRating;                               // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_228F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortQuestItemDefinition*>      ActiveQuestDefinitions;                            // 0x18(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortQuestItemDefinition*              QuestDefinition;                                   // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   ObjectiveStatHandle;                               // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UFortQuestItemDefinition*              UncompletedQuestDefinition;                        // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemDefinition;                                    // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EventFlag;                                         // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.BuildingClassData
struct FBuildingClassData
{
public:
	TSubclassOf<class ABuildingActor>            BuildingClass;                                     // 0x0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreviousBuildingLevel;                             // 0x8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        UpgradeLevel;                                      // 0xC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2290[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct FortniteGame.CreateBuildingActorData
struct FCreateBuildingActorData
{
public:
	uint32                                       BuildingClassHandle;                               // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize10                 BuildLoc;                                          // 0x4(0xC)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              BuildRot;                                          // 0x10(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bMirrored;                                         // 0x1C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2291[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SyncKey;                                           // 0x20(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2292[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBuildingClassData                    BuildingClassData;                                 // 0x28(0x10)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortItemEntryStateValue
struct FFortItemEntryStateValue
{
public:
	int32                                        IntValue;                                          // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  NameValue;                                         // 0x4(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFortItemEntryState               StateType;                                         // 0xC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2293[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct FortniteGame.FortCombatManagerEvent
struct FFortCombatManagerEvent
{
public:
	float                                        EventValue;                                        // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortCombatEvents                 Event;                                             // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2294[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct FortniteGame.LockOnInfo
struct FLockOnInfo
{
public:
	enum class ELockOnState                      State;                                             // 0x0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2295[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class AFortWeapon>            Weapon;                                            // 0x4(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                 LockOnTarget;                                      // 0xC(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              CamRotAtTargetAcquisiton;                          // 0x14(0xC)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                             LockOnCoords;                                      // 0x20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetAcquisitionTime;                             // 0x28(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetLockOnTime;                                  // 0x2C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetOutOfSightTime;                              // 0x30(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownStartTime;                                 // 0x34(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortPersistentGameplayStatContainer
struct FFortPersistentGameplayStatContainer
{
public:
	TArray<struct FFortPersistentGameplayStatValue> GameplayStats;                                     // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.FortUpdatedObjectiveStat
struct FFortUpdatedObjectiveStat
{
public:
	class UFortQuestItemDefinition*              Quest;                                             // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BackendName;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StatValue;                                         // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StatDelta;                                         // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentStage;                                      // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2296[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.FortGiftingInfo
struct FFortGiftingInfo
{
public:
	class FString                                PlayerName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortHeroType*                         HeroType;                                          // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2297[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x114 (0x120 - 0xC)
// ScriptStruct FortniteGame.FortItemEntry
struct FFortItemEntry : public FFastArraySerializerItem
{
public:
	int32                                        Count;                                             // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviousCount;                                     // 0x10(0x4)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2298[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemDefinition*                   ItemDefinition;                                    // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Durability;                                        // 0x20(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Level;                                             // 0x24(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        LoadedAmmo;                                        // 0x28(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2299[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        AlterationDefinitions;                             // 0x30(0x10)(ZeroConstructor, SaveGame, RepSkip, NativeAccessSpecifierPrivate)
	class FString                                ItemSource;                                        // 0x40(0x10)(ZeroConstructor, SaveGame, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                 ItemGuid;                                          // 0x50(0x10)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         Inventory_overflow_date;                           // 0x60(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWasGifted;                                        // 0x61(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsReplicatedCopy;                                 // 0x62(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDirty;                                          // 0x63(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUpdateStatsOnCollection;                          // 0x64(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_229A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortGiftingInfo                      GiftingInfo;                                       // 0x68(0x28)(RepSkip, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntryStateValue>      StateValues;                                       // 0x90(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortInventory>         ParentInventory;                                   // 0xA0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayAbilitySpecHandle            GameplayAbilitySpecHandle;                         // 0xA8(0x4)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_229B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortAlterationItemDefinition*> AlterationInstances;                               // 0xB0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<float>                                GenericAttributeValues;                            // 0xC0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_229C[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct FortniteGame.FortRewardActivity
struct FFortRewardActivity
{
public:
	enum class EFortRewardActivityType           ActivityType;                                      // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_229D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 ActivityGuid;                                      // 0x4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_229E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  TitleText;                                         // 0x18(0x18)(NativeAccessSpecifierPublic)
	class FText                                  DescriptionText;                                   // 0x30(0x18)(NativeAccessSpecifierPublic)
	float                                        RewardDisplayTime;                                 // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_229F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortItemEntry>                RewardItems;                                       // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortItemEntry>                MissedRewardItems;                                 // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	enum class EFortCompletionResult             ActivityCompletionResult;                          // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AdditionalCompletionMissionPoints;                 // 0x74(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct FortniteGame.FortRewardReport
struct FFortRewardReport
{
public:
	class FText                                  MissionName;                                       // 0x0(0x18)(NativeAccessSpecifierPublic)
	class FText                                  TheaterName;                                       // 0x18(0x18)(NativeAccessSpecifierPublic)
	class FText                                  Difficulty;                                        // 0x30(0x18)(NativeAccessSpecifierPublic)
	float                                        DifficultyValue;                                   // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortRewardActivity>           RewardActivities;                                  // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bIsFinalized;                                      // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A2[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x34 (0x40 - 0xC)
// ScriptStruct FortniteGame.DelayedQuickBarAction
struct FDelayedQuickBarAction : public FFastArraySerializerItem
{
public:
	uint32                                       ActionId;                                          // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDelayedQuickBarAction        Action;                                            // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 ItemGuid;                                          // 0x14(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryAssetId                       ItemDefinitionAssetId;                             // 0x24(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    QuickBarType;                                      // 0x34(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        QuickBarSlot;                                      // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceExecution;                                   // 0x3C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A5[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x120 - 0x108)
// ScriptStruct FortniteGame.DelayedQuickBarActionContainer
struct FDelayedQuickBarActionContainer : public FFastArraySerializer
{
public:
	TArray<struct FDelayedQuickBarAction>        Items;                                             // 0x108(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22A6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x88 (0x88 - 0x0)
// ScriptStruct FortniteGame.FortDamageNumberInfo
struct FFortDamageNumberInfo
{
public:
	struct FVector                               WorldLocation;                                     // 0x0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               HitNormal;                                         // 0xC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCriticalDamage;                                 // 0x18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Damage;                                            // 0x1C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDamageNumberType             DamageNumberType;                                  // 0x20(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VisualDamageScale;                                 // 0x24(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortElementalDamageType          ElementalDamageType;                               // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EStatCategory                     ScoreType;                                         // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttachScoreNumberToPlayer;                        // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A9[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x30(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>      MeshMIDs;                                          // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                DamageNumberArray;                                 // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 DamagedActorTags;                                  // 0x58(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                 DamagedActor;                                      // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class APawn>                  DamageCauser;                                      // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.LastBuildableState
struct FLastBuildableState
{
public:
	class UBuildingEditModeMetadata*             LastBuildableMetaData;                             // 0x0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LastBuildableMirrored;                             // 0x8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LastBuildableRotationIterations;                   // 0xC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.AIDirectorDebugInfo
struct FAIDirectorDebugInfo
{
public:
	float                                        Timestamp;                                         // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                DebugGraphData;                                    // 0x8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AC[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x150 (0x150 - 0x0)
// ScriptStruct FortniteGame.VehicleTrickInfo
struct FVehicleTrickInfo
{
public:
	float                                        LastOnGroundTime;                                  // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInAirTrick;                                       // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCreditTrick;                                      // 0x5(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MCreditDisabledTime;                               // 0x8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTrickDeactivated;                                 // 0xC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStuckLanding;                                     // 0xD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TrickScore;                                        // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AF[0x90];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TrickAxisCount;                                    // 0xA4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B0[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDoingRotationTrick;                               // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AirControlsAlpha;                                  // 0xC4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirDistance;                                       // 0xC8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirDistanceSqrd;                                   // 0xCC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirTime;                                           // 0xD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirHeight;                                         // 0xD4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeAtLaunch;                                      // 0xD8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationAtLaunch;                                  // 0xDC(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ForwardVectorAtLaunch;                             // 0xE8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               UpVectorAtLaunch;                                  // 0xF4(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FlatForwardVectorAtLaunch;                         // 0x100(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PrevForwardVec;                                    // 0x10C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PrevRightVec;                                      // 0x118(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PrevUpVec;                                         // 0x124(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PeterPanCount;                                     // 0x130(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StoopingSquirrelCount;                             // 0x134(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDidPeterPan : 1;                                  // Mask: 0x1, PropSize: 0x10x138(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDidStoopingSquirrel : 1;                          // Mask: 0x2, PropSize: 0x10x138(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B2[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct FortniteGame.GhostModeRepData
struct FGhostModeRepData
{
public:
	bool                                         bInGhostMode;                                      // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortWorldItemDefinition*              GhostModeItemDef;                                  // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreviousFocusedSlot;                               // 0x10(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeExitedGhostMode;                               // 0x14(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct FortniteGame.FortPlayerDeathReport
struct FFortPlayerDeathReport
{
public:
	float                                        ServerTimeForRespawn;                              // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ServerTimeForResurrect;                            // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LethalDamage;                                      // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerState*                      KillerPlayerState;                                 // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                             KillerPawn;                                        // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0x20(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDroppedBackpack : 1;                              // Mask: 0x1, PropSize: 0x10x28(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotifyUI : 1;                                     // Mask: 0x2, PropSize: 0x10x28(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_21A : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_22B5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 Tags;                                              // 0x30(0x20)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct FortniteGame.ReplicatedStatValues
struct FReplicatedStatValues
{
public:
	int32                                        StatValue;                                         // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ScoreValue;                                        // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x24 (0x24 - 0x0)
// ScriptStruct FortniteGame.FortExperienceDelta
struct FFortExperienceDelta
{
public:
	int32                                        Level;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Xp;                                                // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BaseXPEarned;                                      // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusXPEarned;                                     // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BoostXPEarned;                                     // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BoostXPMissed;                                     // 0x14(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RestXPEarned;                                      // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GroupBoostXPEarned;                                // 0x1C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortIsFinalXpUpdate              IsFinalXpUpdate;                                   // 0x20(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B6[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x298 (0x298 - 0x0)
// ScriptStruct FortniteGame.FortPlayerScoreReport
struct FFortPlayerScoreReport
{
public:
	struct FUniqueNetIdRepl                      PlayerID;                                          // 0x0(0x28)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x28(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortPlayerState>       PlayerState;                                       // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortTeam                         PlayerTeam;                                        // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReplicatedStatValues                 ReplicatedStats_Campaign[0x22];                    // 0x44(0x110)(NoDestructor, NativeAccessSpecifierPublic)
	struct FReplicatedStatValues                 ReplicatedStats_Zone[0x22];                        // 0x154(0x110)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        InitialLevel;                                      // 0x264(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InitialExperienceAmount;                           // 0x268(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortExperienceDelta                  ExperienceInfoDelta;                               // 0x26C(0x24)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        LastExperienceDeltaAmount;                         // 0x290(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastScoreDeltaAmount;                              // 0x294(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct FortniteGame.FortVoteConfig
struct FFortVoteConfig
{
public:
	int32                                        NumVoteOptions;                                    // 0x0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VoteDuration;                                      // 0x4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FailedVoteLockOutDuration;                         // 0x8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxVotesAllowedPerPlayer;                          // 0xC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortVoteArbitratorType           VoteArbitratorType;                                // 0x10(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct FortniteGame.FortAbilitySetHandle
struct FFortAbilitySetHandle
{
public:
	TWeakObjectPtr<class UAbilitySystemComponent> TargetAbilitySystemComponent;                      // 0x0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGameplayAbilitySpecHandle>    GrantedAbilityHandles;                             // 0x8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActiveGameplayEffectHandle>   AppliedEffectHandles;                              // 0x18(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct FortniteGame.AthenaGameMessageData
struct FAthenaGameMessageData
{
public:
	enum class EAthenaGameMsgType                MsgType;                                           // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22B9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  MsgText;                                           // 0x8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USoundCue*                             MsgSound;                                          // 0x20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MsgDelay;                                          // 0x28(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsTeamBased;                                      // 0x2C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TeamIndex;                                         // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DisplayTime;                                       // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct FortniteGame.EndOfDayRecap
struct FEndOfDayRecap
{
public:
	int32                                        DayNumber;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamScoreAtStartOfDay;                             // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamScoreAtEndOfDay;                               // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortPlayerScoreReport>        ScoreReports;                                      // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct FortniteGame.AppliedHomebaseData
struct FAppliedHomebaseData
{
public:
	class UAbilitySystemComponent*               Source;                                            // 0x0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               Target;                                            // 0x8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>   AppliedEffects;                                    // 0x10(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FFortAbilitySetHandle>         AppliedAbilitySets;                                // 0x20(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.TeamChangeRequest
struct FTeamChangeRequest
{
public:
	class AFortPlayerController*                 RequestingController;                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        DesiredTeam;                                       // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct FortniteGame.OnTimeHitInfo
struct FOnTimeHitInfo
{
public:
	UDelegateProperty_                           TimeCallback;                                      // 0x0(0x10)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BD[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1D0 (0x1D0 - 0x0)
// ScriptStruct FortniteGame.TieredWaveSetData
struct FTieredWaveSetData
{
public:
	int32                                        EDOIdx;                                            // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreatherBetweenWaves;                              // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWaveRules                        WaveRules;                                         // 0x8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          EnemyTypeToKillMod;                                // 0xC(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class UFortMissionInfo>> WaveMissions;                                      // 0x18(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                        WaveLengthMod;                                     // 0x28(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NumKillsMod;                                       // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        KillPointsMod;                                     // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DifficultyAddMod;                                  // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDeferTemporaryModifiers;                          // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UFortDifficultyOptionEncounter_SpawnPointsMultiplier> OverrideSpawnPointsMultiplier;                     // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_SpawnPointsCurve> OverrideSpawnPointsCurve;                          // 0x68(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_SpawnGroupProgression> OverrideSpawnProgression;                          // 0x90(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_UtilitiesAdjustment> OverrideUtilitiesAdjustment;                       // 0xB8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_UtilitiesFree> OverrideUtilitiesFree;                             // 0xE0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_UtilitiesLocked> OverrideUtilitiesLocked;                           // 0x108(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_Distance> OverrideDistance;                                  // 0x130(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_DirectionNumber> OverrideDirectionNumber;                           // 0x158(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_ModifierTags> OverrideModifierTags;                              // 0x180(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortDifficultyOptionEncounter_TimedModifierTags> OverrideTimedModifierTags;                         // 0x1A8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct FortniteGame.ActiveGameplayModifierHandle
struct FActiveGameplayModifierHandle
{
public:
	int32                                        Handle;                                            // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct FortniteGame.VoteData
struct FVoteData
{
public:
	enum class EFortVoteType                     VoteType;                                          // 0x0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      VoteInstigatorNetId;                               // 0x8(0x28)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortVoteConfig                       VoteConfig;                                        // 0x30(0x14)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             VoteStartTime;                                     // 0x48(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             VoteEndTime;                                       // 0x50(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoter>                        Voters;                                            // 0x58(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                        NumVotersWithMaxVotes;                             // 0x68(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          EndVoteTimerHandle;                                // 0x70(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortVoteStatus                   VoteStatus;                                        // 0x78(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.PlayerBuildableClassContainer
struct FPlayerBuildableClassContainer
{
public:
	TArray<TSubclassOf<class ABuildingSMActor>>  BuildingClasses;                                   // 0x0(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct FortniteGame.FortItemQuantityPair
struct FFortItemQuantityPair
{
public:
	struct FPrimaryAssetId                       ItemPrimaryAssetId;                                // 0x0(0x10)(Edit, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortItemDefinition>    ItemDefinition;                                    // 0x10(0x28)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Quantity;                                          // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct FortniteGame.FortZoneMissionAlertData
struct FFortZoneMissionAlertData
{
public:
	TArray<struct FFortItemQuantityPair>         MissionAlertRewards;                               // 0x0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class FString                                MissionAlertCategoryName;                          // 0x10(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MissionAlertID;                                    // 0x20(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct FortniteGame.FortZoneDifficultyIncreaseRewardData
struct FFortZoneDifficultyIncreaseRewardData
{
public:
	TArray<struct FFortItemQuantityPair>         Rewards;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xCC (0xD8 - 0xC)
// ScriptStruct FortniteGame.ActiveGameplayModifier
struct FActiveGameplayModifier : public FFastArraySerializerItem
{
public:
	uint8                                        Pad_22C6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortGameplayModifierItemDefinition*   ModifierDef;                                       // 0x10(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayModifierHandle         ModifierHandle;                                    // 0x18(0x4)(Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
