#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x3A44 (0x3E84 - 0x440)
// AnimBlueprintGeneratedClass JackalVehicle_Hoverboard_Base_AnimBP.JackalVehicle_Hoverboard_Base_AnimBP_C
class UJackalVehicle_Hoverboard_Base_AnimBP_C : public UFortVehicleAnimInstance_Jackal
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x440(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_8DE7DF7D4F376ECBED1D5CA548410F09; // 0x448(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79551EB741A99E971EF7D6AC51E2AB7D; // 0x468(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E544F6BD4E67C86DF50F4EA857293011; // 0x490(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_05646BC948C69241A42311BFA7BAD9D5; // 0x4B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FAE15B67426A9ADD073BEDA67E1F5012; // 0x4E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65CE27AC412803CE7745EAADF8A6135B; // 0x508(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B83BD71E4043B3CCA688E290A1FB33B7; // 0x530(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F545679245D83F81271178BBD9062754; // 0x558(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6E9AFD9E4A44EFF7995E74A9F8A880D8; // 0x580(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3B363C6F4BD85567705F1D86DA9F6764; // 0x5A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87A72B8642E2DE2F8F2AB4A4DAB6255C; // 0x5D0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_594697204AB3D8A369690CB91B3932FF; // 0x5F8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5B05797A4472A30842E703AF1D309BA5; // 0x670(0x78)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_75A30E6F473DE296B56ABCB14F5EDE9C; // 0x6E8(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_04E9D06A439207C912B6D28859DA435B; // 0x798(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CB4685694D065C4E720B3EA65A98D68C; // 0x7B8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F8BE85284382F9B366D110BAB24C662B; // 0x830(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_396A575645B03B8A7BA244BCA8D782BC; // 0x850(0x78)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_914DAF124F90261C72814CB42F14BC41; // 0x8C8(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E5199B58485B5211FAEF899C70143BD2; // 0x978(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6DF4196940DB44B4D0D4B590BC01C73B; // 0x9F0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0FDF118641FFC765A7AA91A15A263AF3; // 0xA10(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7D7980564576021329306DB8C5770A2E; // 0xA88(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_901DD32541BB65E9EC4FCBA63F039BA9; // 0xB00(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BB6137F34C2E8923FA5CF2A5334A9066; // 0xB78(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12A1E1464FACA0EFDD5ACCBE4911F4C3; // 0xBF0(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7EBEE7B34049E7FBC990C2B8FEBEF238; // 0xC68(0xA0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4C68BF4F4468E37592264599342645CB; // 0xD08(0xA0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C654317B4088E68E41881F810A7EE239; // 0xDA8(0xA0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13AB3AD54B1F8DA08DF929B7C4CCEA68; // 0xE48(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D88916CB4F7ACF447F3CD2B7803E964F; // 0xEE8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38D4F88D4A6BA041143EE6B67A81EA0A; // 0xF60(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6BA1F59040AAD52A8FE360948EACC33B; // 0xFD8(0x78)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_E5B09A5548FEED43467200BB3020C098; // 0x1050(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1FD79A0C41840AC6CD29748A5FFDF824; // 0x1100(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_21E6E1E3436159523B56DB8AE67669FF; // 0x1120(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AA7CE21744B997725DF0F9A604D9EA6B; // 0x1200(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_EA20ED3C4174FD18FFDD5799B12FC072; // 0x1278(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_231E49C3446B12BD1469A1B493F010A0; // 0x1340(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_D498404F4BC78A12AA3E8C920F26D81D; // 0x1360(0xB0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_55FCE12C40E1A7060FE1E3BB1338BBC1; // 0x1410(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_751B724A46E7763A1410F7B9DE339A39; // 0x14D8(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A3A403FD4C55D31A3AFE3AB2C455A192; // 0x15B8(0xA0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4BFBA05A4BFD621331408A8BA6001413; // 0x1658(0xB8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_CEE05901473A388B1A1809BEF10ACD31; // 0x1710(0xC8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_D7BA8497496DEB4FDCFCF499857BEC94; // 0x17D8(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_FAACF01B4CCB7F7A90709889CDC05C85; // 0x1800(0x28)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_D3B663484286CCC5791CF0A7274ED553; // 0x1828(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C36CB7AB4845790DA0411DA84C001DA4; // 0x18F0(0x78)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3C42ABD9487DAF96B272CC9CBD561670; // 0x1968(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9000B13E431E59EE037D3F9F02AB589B; // 0x1A48(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BE0ACCBD4ADB715526B39BA8169708ED; // 0x1AE8(0x78)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_2CA797A2426A9AE5BBDC9CA6BCBF6582; // 0x1B60(0xC8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_583AF96F41D18E175963ED9F28B6A826; // 0x1C28(0xB8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8FE022B740977CAA60F5B0A961ADC09E; // 0x1CE0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_875036A140945CC191B4AE8EEEAFA9B8; // 0x1D08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C657DE454BE3A79027EA4A979A49A407; // 0x1D30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2166A0154554B2DBBCEC9B8C4FDA30AB; // 0x1D58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DD93414141D304687BC5458C0867DA13; // 0x1D80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EF91C0A945322DE8438F4BA03DD7D01F; // 0x1DA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4331EB1644EFC9D0055FFE92048B9CD8; // 0x1DD0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D96DCDC84D09B1847B39D69FF54CC7C0; // 0x1DF8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F0BF3A684B617C3D4D83C3B3253F57BF; // 0x1E70(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5D7B0B494359E6C0AE2A8DB69B80D1B6; // 0x1E90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8003F0F547932228C9073CA032B05014; // 0x1EB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1B4DA54B42DAA1CFB1D9A99C83420831; // 0x1EE0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B09759F24943753BF994568BB66A1821; // 0x1F08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3C8ADC1748F7AC4F6EC838A7823415EE; // 0x1F30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_206E72BC463E7DE9628C179156E6B19D; // 0x1F58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1A8A018544359EC8669B809018EEAFA9; // 0x1F80(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_38848BC14590865E608A94945E853611; // 0x1FA8(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C7EF737C49800F420E682AB6C23A6B79; // 0x1FD0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34EA18EB447A23FCA5822DA600605598; // 0x1FF0(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_EBA24BBD448DC5B541C65F92B97CEE9B; // 0x2068(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_135E65944991E90AA1EAA2B9C100B35B; // 0x2108(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_71D496194AED024A3E1C5F85A83DBA16; // 0x2180(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7E2549644F616F9885FEBDA0EEADF98C; // 0x2220(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_ED7563674A62E0FB25040CBF9679B1BB; // 0x2298(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D17C2BA8408CD47EBE932F95452735A8; // 0x22B8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6DE99C13410FF88DE0AF6BB1EB0CCBA5; // 0x2330(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50A1798D43B1A6F0DAB04188378C9B17; // 0x2350(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_84EAE8334A06C45018E4B1BCCDA10B20; // 0x23C8(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0B89BBC940995842CD994796D24E2865; // 0x2468(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_257EA5584C3D8FD82EFF3A8BA7C161A8; // 0x24E0(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C4E2764A44DB82B8E7207BA72E22ADDB; // 0x2558(0xA0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24DF1ED1435BEA48D2AD0397095450BB; // 0x25F8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C47B47AB449159DDD55DE4B178FFB93D; // 0x2618(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_90C1DE4240AF79F632DD36AC515A7FC8; // 0x2690(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_05E7450A4A6788712C443BBEEA582FA6; // 0x2730(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5392EFDF4DDEB671847778A6CC36FF96; // 0x27A8(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_369976DA4370C1942C6FC08FAE125EB9; // 0x2848(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_CD2289BB494834D038BFF3A3F332FCF0; // 0x28C0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F6CD462543BF0C0C0B2AF19E43B4F978; // 0x28E0(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B2DBB53C45753C2ABE031E8BFD5DF025; // 0x2990(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_D9C3B7524515A03CE080919C58ADD27F; // 0x29B0(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_0C73B4D343B28F8C38F4DCBA2555A562; // 0x29D8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_EA1871F749846AA5DBE68C95979ED0A7; // 0x29F8(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2E579A35485226E1B8812EA4CD8F07B2; // 0x2AA8(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D25D073D4DA8FD8A6CB6629E932B20B2; // 0x2AC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CA8124FF4905D3E15D8F61B169343A56; // 0x2AF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2668C4C44D5D063F89BBC98281198C9A; // 0x2B18(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2743DD3846FF0FB2F84A828861FD1A51; // 0x2B40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A89F510D451FEA4075C5B5A02C835761; // 0x2B68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5706355F442CFE746C87A897708B5665; // 0x2B90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6A07BD1547B8550C9D2803BBC663095B; // 0x2BB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CB5BBC8C4868E22FD48411AD0A200E4D; // 0x2BE0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C52965D240FA54F655126CBB701755DF; // 0x2C08(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_486D5E0E475921E383648880878575E5; // 0x2C80(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25A1420A418624B09EB4A9A29D8E272D; // 0x2CA0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_188F4852435168B2AF93CCA4590B07FE; // 0x2D18(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0271F4DE433251E9A7093484EC591724; // 0x2D38(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8B9673594225FD508C64ABBA8FBA6663; // 0x2DB0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3E752B0542109AD394871BA23502FCBA; // 0x2DD0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D9135B324A5000BCF1CEADBEF3E52F0A; // 0x2E48(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0BAB283D4BE3C0C18030DE8EFFD0B1E1; // 0x2E68(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_72E664D3433AA22AB9510185EA286994; // 0x2E90(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_81F7338E4F3F69064B51D2876B84030B; // 0x2EB0(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_AE86C4AB4252CF3A4839FE85B6EBE3B7; // 0x2F60(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_59845A25443BCC01C9D3B0B40E464741; // 0x2F80(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C1B277D04368F0602CD39CB0D81F3909; // 0x3030(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7D71C5C14B00055F2F984ABA69A2DCE7; // 0x30A8(0xC8)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_28A5275B44292B3F602BB38D565C32E9; // 0x3170(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5483FB6A41D82667AC3738AD99B4C5D7; // 0x3210(0x78)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3D66557042F36BF85464688D1B719CB2; // 0x3288(0xE0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8587E7F444A72D7E98B952BA00C3145C; // 0x3368(0xB8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6F32E9904EA55F1CF13547ADC75860C4; // 0x3420(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3840453F4FD6503DF3A74091793F1343; // 0x3448(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6BA241064677EC0908931383C0504DC9; // 0x3470(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0B623BB24919BC5602FD88841E3EAC13; // 0x3498(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_AF632F62420ADFC8FAE276BF6063D16A; // 0x34C0(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F28D9DED43C13E0278B7E393DDAC25FB; // 0x34E8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A107EAA640810A48DC1E41B7C766FEFE; // 0x3508(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1712D7AE431AA172F2D86699A7E0D1E3; // 0x3580(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3C9C430F446E0C076E4A13A52E45CF90; // 0x35A0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F254788D4ECBCE56AF5CFDB890854D40; // 0x3618(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37F1E96744CB3EA5C07485818324567D; // 0x3638(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0CED74C9497FD4695AE8A5A763A43F26; // 0x36B0(0x78)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_DC37C64B426F86FD06454FAD1D5E6497; // 0x3728(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_51DC060A4771B597C5BB0EAACC41B58D; // 0x37D8(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6AE728FE41B681ED8C2D8BB413E65BFA; // 0x37F8(0xB0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_BFE79554463ED78DC42A808BD66205D6; // 0x38A8(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_51EFD56146582023BC2E91AAB529C224; // 0x3960(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_75D93F3B4A85475D5565F892E2FE1551; // 0x39D8(0xA0)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1A436FF4E706DB2D674499C29DDD6F4; // 0x3A78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D3B31E114AFFDA2B36CBD0AB0771C924; // 0x3AA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74F0D4B44111A451ECE42F99C1841F4B; // 0x3AC8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C674CEFA42EF0E5EBEF19ABAA368B992; // 0x3AF0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_38DCB9444A8364654EE3A3AA87D4D4EE; // 0x3B68(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F6FB87794D75D5ECCAAE5797403AC6B3; // 0x3B88(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_56446CB94FD76E3B82A8F9BE0FE3B7DC; // 0x3C00(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A5D665BA468DB7092BFAC7A0DD88F21E; // 0x3C20(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_67F263204BB811B243D5788C5E38F381; // 0x3C98(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_82610AFA4361CEC24BA0BF9A6999801A; // 0x3CB8(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_92DF8B68452C32639AEACC942827D387; // 0x3D68(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E2CEC49848E859BD0CC2428F9AF839A4; // 0x3DE0(0xA0)()
	enum class EFortCardinalDirection            PrePivot;                                          // 0x3E80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasHigherVelocity;                                 // 0x3E81(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldTrigerGrappleMontage;                        // 0x3E82(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         AreFeetAttachedToBoard;                            // 0x3E83(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("JackalVehicle_Hoverboard_Base_AnimBP_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_JackalVehicle_Hoverboard_Base_AnimBP_AnimGraphNode_TransitionResult_EF91C0A945322DE8438F4BA03DD7D01F();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_JackalVehicle_Hoverboard_Base_AnimBP(int32 EntryPoint, class AFortPlayerPawn* CallFunc_GetDriver_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint, bool K2Node_DynamicCast_bSuccess, float K2Node_Event_DeltaTimeX);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
