#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xDF8 (0xDF8 - 0x0)
// Function RewardInfoSimpleWidget.RewardInfoSimpleWidget_C.GetDisplayName
struct URewardInfoSimpleWidget_C_GetDisplayName_Params
{
public:
	class FText                                  DisplayName;                                       // 0x0(0x18)(Parm, OutParm)
	class FText                                  OutName;                                           // 0x18(0x18)(Edit, BlueprintVisible)
	enum class EFortItemType                     Temp_byte_Variable;                                // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5D35[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x38(0x18)()
	class FText                                  Temp_text_Variable_1;                              // 0x50(0x18)()
	class FText                                  Temp_text_Variable_2;                              // 0x68(0x18)()
	class FText                                  Temp_text_Variable_3;                              // 0x80(0x18)()
	class FText                                  Temp_text_Variable_4;                              // 0x98(0x18)()
	class FText                                  Temp_text_Variable_5;                              // 0xB0(0x18)()
	class FText                                  Temp_text_Variable_6;                              // 0xC8(0x18)()
	class FText                                  Temp_text_Variable_7;                              // 0xE0(0x18)()
	class FText                                  Temp_text_Variable_8;                              // 0xF8(0x18)()
	class FText                                  Temp_text_Variable_9;                              // 0x110(0x18)()
	class FText                                  Temp_text_Variable_10;                             // 0x128(0x18)()
	class FText                                  Temp_text_Variable_11;                             // 0x140(0x18)()
	class FText                                  Temp_text_Variable_12;                             // 0x158(0x18)()
	class FText                                  Temp_text_Variable_13;                             // 0x170(0x18)()
	class FText                                  Temp_text_Variable_14;                             // 0x188(0x18)()
	class FText                                  Temp_text_Variable_15;                             // 0x1A0(0x18)()
	class FText                                  Temp_text_Variable_16;                             // 0x1B8(0x18)()
	class FText                                  Temp_text_Variable_17;                             // 0x1D0(0x18)()
	class FText                                  Temp_text_Variable_18;                             // 0x1E8(0x18)()
	class FText                                  Temp_text_Variable_19;                             // 0x200(0x18)()
	class FText                                  Temp_text_Variable_20;                             // 0x218(0x18)()
	class FText                                  Temp_text_Variable_21;                             // 0x230(0x18)()
	class FText                                  Temp_text_Variable_22;                             // 0x248(0x18)()
	class FText                                  Temp_text_Variable_23;                             // 0x260(0x18)()
	class FText                                  Temp_text_Variable_24;                             // 0x278(0x18)()
	class FText                                  Temp_text_Variable_25;                             // 0x290(0x18)()
	class FText                                  Temp_text_Variable_26;                             // 0x2A8(0x18)()
	class FText                                  Temp_text_Variable_27;                             // 0x2C0(0x18)()
	class FText                                  Temp_text_Variable_28;                             // 0x2D8(0x18)()
	class FText                                  Temp_text_Variable_29;                             // 0x2F0(0x18)()
	class FText                                  Temp_text_Variable_30;                             // 0x308(0x18)()
	class FText                                  Temp_text_Variable_31;                             // 0x320(0x18)()
	class FText                                  Temp_text_Variable_32;                             // 0x338(0x18)()
	class FText                                  Temp_text_Variable_33;                             // 0x350(0x18)()
	class FText                                  Temp_text_Variable_34;                             // 0x368(0x18)()
	class FText                                  Temp_text_Variable_35;                             // 0x380(0x18)()
	class FText                                  Temp_text_Variable_36;                             // 0x398(0x18)()
	class FText                                  Temp_text_Variable_37;                             // 0x3B0(0x18)()
	class FText                                  Temp_text_Variable_38;                             // 0x3C8(0x18)()
	class FText                                  Temp_text_Variable_39;                             // 0x3E0(0x18)()
	class FText                                  Temp_text_Variable_40;                             // 0x3F8(0x18)()
	class FText                                  Temp_text_Variable_41;                             // 0x410(0x18)()
	class FText                                  Temp_text_Variable_42;                             // 0x428(0x18)()
	class FText                                  Temp_text_Variable_43;                             // 0x440(0x18)()
	class FText                                  Temp_text_Variable_44;                             // 0x458(0x18)()
	class FText                                  Temp_text_Variable_45;                             // 0x470(0x18)()
	class FText                                  Temp_text_Variable_46;                             // 0x488(0x18)()
	class FText                                  Temp_text_Variable_47;                             // 0x4A0(0x18)()
	class FText                                  Temp_text_Variable_48;                             // 0x4B8(0x18)()
	class FText                                  Temp_text_Variable_49;                             // 0x4D0(0x18)()
	class FText                                  Temp_text_Variable_50;                             // 0x4E8(0x18)()
	class FText                                  Temp_text_Variable_51;                             // 0x500(0x18)()
	class FText                                  Temp_text_Variable_52;                             // 0x518(0x18)()
	class FText                                  Temp_text_Variable_53;                             // 0x530(0x18)()
	class FText                                  Temp_text_Variable_54;                             // 0x548(0x18)()
	class FText                                  Temp_text_Variable_55;                             // 0x560(0x18)()
	class FText                                  Temp_text_Variable_56;                             // 0x578(0x18)()
	class FText                                  Temp_text_Variable_57;                             // 0x590(0x18)()
	class FText                                  Temp_text_Variable_58;                             // 0x5A8(0x18)()
	class FText                                  Temp_text_Variable_59;                             // 0x5C0(0x18)()
	class FText                                  Temp_text_Variable_60;                             // 0x5D8(0x18)()
	class FText                                  Temp_text_Variable_61;                             // 0x5F0(0x18)()
	class FText                                  Temp_text_Variable_62;                             // 0x608(0x18)()
	class FText                                  Temp_text_Variable_63;                             // 0x620(0x18)()
	class FText                                  Temp_text_Variable_64;                             // 0x638(0x18)()
	class FText                                  Temp_text_Variable_65;                             // 0x650(0x18)()
	class FText                                  Temp_text_Variable_66;                             // 0x668(0x18)()
	class FText                                  Temp_text_Variable_67;                             // 0x680(0x18)()
	class FText                                  Temp_text_Variable_68;                             // 0x698(0x18)()
	class FText                                  Temp_text_Variable_69;                             // 0x6B0(0x18)()
	class FText                                  Temp_text_Variable_70;                             // 0x6C8(0x18)()
	class FText                                  Temp_text_Variable_71;                             // 0x6E0(0x18)()
	class FText                                  Temp_text_Variable_72;                             // 0x6F8(0x18)()
	class FText                                  Temp_text_Variable_73;                             // 0x710(0x18)()
	class FText                                  Temp_text_Variable_74;                             // 0x728(0x18)()
	class FText                                  Temp_text_Variable_75;                             // 0x740(0x18)()
	class FText                                  Temp_text_Variable_76;                             // 0x758(0x18)()
	class FText                                  Temp_text_Variable_77;                             // 0x770(0x18)()
	class FText                                  Temp_text_Variable_78;                             // 0x788(0x18)()
	class FText                                  Temp_text_Variable_79;                             // 0x7A0(0x18)()
	class FText                                  Temp_text_Variable_80;                             // 0x7B8(0x18)()
	class FText                                  Temp_text_Variable_81;                             // 0x7D0(0x18)()
	class FText                                  Temp_text_Variable_82;                             // 0x7E8(0x18)()
	class FText                                  Temp_text_Variable_83;                             // 0x800(0x18)()
	class FText                                  Temp_text_Variable_84;                             // 0x818(0x18)()
	class FText                                  Temp_text_Variable_85;                             // 0x830(0x18)()
	class FText                                  Temp_text_Variable_86;                             // 0x848(0x18)()
	class FText                                  Temp_text_Variable_87;                             // 0x860(0x18)()
	class FText                                  Temp_text_Variable_88;                             // 0x878(0x18)()
	class FText                                  Temp_text_Variable_89;                             // 0x890(0x18)()
	class FText                                  Temp_text_Variable_90;                             // 0x8A8(0x18)()
	class FText                                  Temp_text_Variable_91;                             // 0x8C0(0x18)()
	class FText                                  Temp_text_Variable_92;                             // 0x8D8(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x8F0(0x18)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x908(0x40)(HasGetValueTypeHash)
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue;              // 0x948(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x950(0x18)()
	enum class EFortRarity                       CallFunc_GetRarity_ReturnValue;                    // 0x968(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5D36[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0x970(0x40)(HasGetValueTypeHash)
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue;              // 0x9B0(0x80)()
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue_1;            // 0xA30(0x80)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0xAB0(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0xAF0(0x40)(HasGetValueTypeHash)
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue_2;            // 0xB30(0x80)()
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xBB0(0x10)(ZeroConstructor, ReferenceParm)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xBC0(0x18)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_4;            // 0xBD8(0x40)(HasGetValueTypeHash)
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue_1;            // 0xC18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorker*                           K2Node_DynamicCast_AsFort_Worker;                  // 0xC20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0xC28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EFortInventoryFilter              CallFunc_GetFilterCategory_ReturnValue;            // 0xC29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5D37[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue_2;            // 0xC30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0xC38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5D38[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_GetTertiaryCategory_ItemCategoryText;     // 0xC40(0x18)()
	struct FSlateBrush                           CallFunc_GetTertiaryCategory_ItemCategoryBrush;    // 0xC58(0x88)()
	bool                                         CallFunc_GetTertiaryCategory_ReturnValue;          // 0xCE0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5D39[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_5;            // 0xCE8(0x40)(HasGetValueTypeHash)
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue_3;            // 0xD28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_1;                          // 0xD30(0x10)(ZeroConstructor, ReferenceParm)
	enum class EFortItemType                     CallFunc_GetType_ReturnValue;                      // 0xD40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5D3A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_1;                     // 0xD48(0x18)()
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0xD60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5D3B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue_4;            // 0xD68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortItemType                     CallFunc_GetType_ReturnValue_1;                    // 0xD70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5D3C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0xD78(0x18)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_6;            // 0xD90(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_2;                          // 0xDD0(0x10)(ZeroConstructor, ReferenceParm)
	class FText                                  CallFunc_Format_ReturnValue_2;                     // 0xDE0(0x18)()
};

// 0x0 (0x0 - 0x0)
// Function RewardInfoSimpleWidget.RewardInfoSimpleWidget_C.HandleDifferentItemOrQuantitySetBP
struct URewardInfoSimpleWidget_C_HandleDifferentItemOrQuantitySetBP_Params
{
public:
};

// 0x61 (0x61 - 0x0)
// Function RewardInfoSimpleWidget.RewardInfoSimpleWidget_C.ExecuteUbergraph_RewardInfoSimpleWidget
struct URewardInfoSimpleWidget_C_ExecuteUbergraph_RewardInfoSimpleWidget_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_GetQuantity_ReturnValue;                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue;              // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue;               // 0x10(0x18)()
	class UFortItemDefinition*                   CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x31(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5D3D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x38(0x28)(HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
